ANPdata:
- creation_date = "2021/07/27"
- maturity = "production"
- updated_date = "2021/07/27"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies the execution of the EarthWorm tunneler. Adversaries may tunnel network communications to and from a victim
    system within a separate protocol to avoid detection and network filtering, or to enable access to otherwise unreachable systems."""

# - false_positives = ["Updates to approved and trusted SSH executables can trigger this rule."]

- language = "eql"

- license = "Elastic License v2"

- references = ["http://rootkiter.com/EarthWorm/","https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"]

- risk_score = 47

- rule_id = "9f1c4ca3-44b5-481d-ba42-32dc215a2769"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Command and Control"]

- type = "eql"
name: "Potential Protocol Tunneling via EarthWorm"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
eql:
 "query": "process where event.type == \"start\" and process.args : \"-s\" and process.args : \"-d\" and process.args : \"rssocks\""
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1572"
      - name = "Protocol Tunneling"
      - reference = "https://attack.mitre.org/techniques/T1572/"
    - tactic:
      - id = "TA0011"
      - name = "Command and Control"
      - reference = "https://attack.mitre.org/tactics/TA0011/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1556"
  #     - name = "Modify Authentication Process"
  #     - reference = "https://attack.mitre.org/techniques/T1556/"
  #   - tactic:
  #     - id = "TA0006"
  #     - name = "Credential Access"
  #     - reference = "https://attack.mitre.org/tactics/TA0006/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
