ANPdata:
- creation_date = "2021/7/27"
- maturity = "production"
- updated_date = "2021/7/27"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies the use of a compression utility to collect known files containing sensitive information, such as credentials
    and system configurations."""

# - false_positives = ["Updates to approved and trusted SSH executables can trigger this rule."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://www.trendmicro.com/en_ca/research/20/l/teamtnt-now-deploying-ddos-capable-irc-bot-tntbotinger.html"]

- risk_score = 47

- rule_id = "6b84d470-9036-4cc0-a27c-6d90bbfe81ab"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Collection", "Credential Access"]

- type = "query"
name: "Sensitive Files Compression"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:start and
  process.name:(zip or tar or gzip or hdiutil or 7z) and
  process.args:
    (
      /root/.ssh/id_rsa or
      /root/.ssh/id_rsa.pub or
      /root/.ssh/id_ed25519 or
      /root/.ssh/id_ed25519.pub or
      /root/.ssh/authorized_keys or
      /root/.ssh/authorized_keys2 or
      /root/.ssh/known_hosts or
      /root/.bash_history or
      /etc/hosts or
      /home/*/.ssh/id_rsa or
      /home/*/.ssh/id_rsa.pub or
      /home/*/.ssh/id_ed25519 or
      /home/*/.ssh/id_ed25519.pub or
      /home/*/.ssh/authorized_keys or
      /home/*/.ssh/authorized_keys2 or
      /home/*/.ssh/known_hosts or
      /home/*/.bash_history or
      /root/.aws/credentials or
      /root/.aws/config or
      /home/*/.aws/credentials or
      /home/*/.aws/config or
      /root/.docker/config.json or
      /home/*/.docker/config.json or
      /etc/group or
      /etc/passwd or
      /etc/shadow or
      /etc/gshadow
    )" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1552"
      - name = "Unsecured Credentials"
      - reference = "https://attack.mitre.org/techniques/T1552/"
      - subtechnique:
        - id = "T1552.001"
        - name = "Credentials In Files"
        - reference = "https://attack.mitre.org/techniques/T1552/001/"   
    - tactic:
      - id = "TA0006"
      - name = "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1560"
      - name = "Archive Collected Data"
      - reference = "https://attack.mitre.org/techniques/T1560/"
      - subtechnique:
        - id = "T1560.001"
        - name = "Archive via Utility"
        - reference = "https://attack.mitre.org/techniques/T1560/001/"
    - tactic:
      - id = "TA0009"
      - name = "Collection"
      - reference = "https://attack.mitre.org/tactics/TA0009/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
