ANPdata:
- creation_date = "2021/7/27"
- maturity = "production"
- updated_date = "2021/7/27"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies a Secure Shell (SSH) client or server process creating or writing to a known SSH backdoor log file.
    Adversaries may modify SSH related binaries for persistence or credential access via patching sensitive functions to
    enable unauthorized access or to log SSH credentials for exfiltration."""

- false_positives = ["Updates to approved and trusted SSH executables can trigger this rule."]

- language = "eql"

- license = "Elastic License v2"

- references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor","https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf"]

- risk_score = 73

- rule_id = "f28e2be4-6eca-4349-bdd9-381573730c22"

- severity = "high"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Persistence", "Credential Access"]

- type = "eql"
name: "Potential OpenSSH Backdoor Logging Activity"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
eql:
  "query": "file where event.type == \"change\" and process.executable : (\"\/usr\/sbin\/sshd\", \"\/usr\/bin\/ssh\") and
  (
    file.name : (\".*\", \"~*\") or
    file.extension : (\"in\", \"out\", \"ini\", \"h\", \"gz\", \"so\", \"sock\", \"sync\", \"0\", \"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\") or
    file.path : 
    (
      \"\/private\/etc\/*--\", 
      \"\/usr\/share\/*\", 
      \"\/usr\/include\/*\", 
      \"\/usr\/local\/include\/*\", 
      \"\/private\/tmp\/*\", 
      \"\/private\/var\/tmp\/*\",
      \"\/usr\/tmp\/*\", 
      \"\/usr\/share\/man\/*\", 
      \"\/usr\/local\/share\/*\", 
      \"\/usr\/lib\/*.so.*\", 
      \"\/private\/etc\/ssh\/.sshd_auth\",
      \"\/usr\/bin\/ssd\", 
      \"\/private\/var\/opt\/power\", 
      \"\/private\/etc\/ssh\/ssh_known_hosts\", 
      \"\/private\/var\/html\/lol\", 
      \"\/private\/var\/log\/utmp\", 
      \"\/private\/var\/lib\",
      \"\/var\/run\/sshd\/sshd.pid\",
      \"\/var\/run\/nscd\/ns.pid\",
      \"\/var\/run\/udev\/ud.pid\",
      \"\/var\/run\/udevd.pid\"
    )
  )"
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1556"
      - name = "Modify Authentication Process"
      - reference = "https://attack.mitre.org/techniques/T1556/"
      # - subtechnique:
      #   - id = "T1552.001"
      #   - name = "Credentials In Files"
      #   - reference = "https://attack.mitre.org/techniques/T1552/001/"   
    - tactic:
      - id = "TA0006"
      - name = "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1554"
      - name = "Compromise Client Software Binary"
      - reference = "https://attack.mitre.org/techniques/T1554/"
      # - subtechnique:
      #   - id = "T1560.001"
      #   - name = "Archive via Utility"
      #   - reference = "https://attack.mitre.org/techniques/T1560/001/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
