ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies file permission modifications in common writable directories by a non-root user. Adversaries often drop files or payloads into a writable directory and change permissions prior to execution."""

- false_positives = ["Certain programs or applications may modify files or change ownership in writable directories. These can be exempted by username."]

- language = "kuery"

- license = "Elastic License v2"

# - references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor","https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf"]

- risk_score = 21

- rule_id = "9f9a2a82-93a8-4b1a-8778-1780895626d4"

- severity = "low"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "query"
name: "File Permission Modification in Writable Directory"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n  process.name:(chmod or chown or chattr or chgrp) and\n  process.working_directory:(/tmp or /var/tmp or /dev/shm) and\n  not user.name:root" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1222"
      - name = "File and Directory Permissions Modification"
      - reference = "https://attack.mitre.org/techniques/T1222/"
      # - subtechnique:
      #   - id = "T1070.004"
      #   - name = "File Deletion"
      #   - reference = "https://attack.mitre.org/techniques/T1070/004/"   
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1027"
  #     - name = "Obfuscated Files or Information"
  #     - reference = "https://attack.mitre.org/techniques/T1027/"
  #     # - subtechnique:
  #     #   - id = "T1560.001"
  #     #   - name = "Archive via Utility"
  #     #   - reference = "https://attack.mitre.org/techniques/T1560/001/"
  #   - tactic:
  #     - id = "TA0005"
  #     - name = "Defense Evasion"
  #     - reference = "https://attack.mitre.org/tactics/TA0005/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
