ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies the deletion of sensitive Linux system logs. This may indicate an attempt to evade detection or destroy forensic evidence on a system."""

# - false_positives = ["There is usually no reason to remove modules, but some buggy modules require it. These can be exempted by username. Note that some Linux distributions are not built to support the removal of modules at all."]

- language = "eql"

- license = "Elastic License v2"

- references = ["https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"]

- risk_score = 47

# - max_signals = 33

- rule_id = "aa895aea-b69c-4411-b110-8d7599634b30"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "eql"
name: "System Log File Deletion"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
eql:
  "query": "file where event.type == \"deletion\" and\n  file.path :     (    \"/var/run/utmp\",     \"/var/log/wtmp\",     \"/var/log/btmp\",     \"/var/log/lastlog\",     \"/var/log/faillog\",    \"/var/log/syslog\",     \"/var/log/messages\",     \"/var/log/secure\",     \"/var/log/auth.log\"    )"
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1070"
      - name = "Indicator Removal on Host"
      - reference = "https://attack.mitre.org/techniques/T1070/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = ""T1547""
  #     - name = "Boot or Logon Autostart Execution"
  #     - reference = "https://attack.mitre.org/techniques/T1547/"
  #     - subtechnique:
  #       - id = "T1547.006"
  #       - name ="Kernel Modules and Extensions"
  #       - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
