ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
- min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """
    Users can mark specific files as hidden simply by putting a "." as the first character in the file or folder name. Adversaries can use this to their advantage to hide files and folders on the system for persistence and defense evasion. This rule looks for hidden files or folders in common writable directories."""

- false_positives = ["Certain tools may create hidden temporary files or directories upon installation or as part of their normal behavior. These events can be filtered by the process arguments, username, or process name values."]

- language = "eql"

- license = "Elastic License v2"

# - references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor","https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf"]

- risk_score = 47

- max_signals = 33

- rule_id = "b9666521-4742-49ce-9ddc-b8e84c35acae"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "eql"
name: "Creation of Hidden Files and Directories"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.working_directory in (\"/tmp\", \"/var/tmp\", \"/dev/shm\") and\n  process.args regex~ \"\"\"\\.[a-z0-9_\\-][a-z0-9_\\-\\.]{1,254}\"\"\" and\n  not process.name in (\"ls\", \"find\")"
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1564"
      - name = "Hide Artifacts"
      - reference = "https://attack.mitre.org/techniques/T1564/"
      - subtechnique:
        - id = "T1564.001"
        - name = "Hidden Files and Directories"
        - reference = "https://attack.mitre.org/techniques/T1564/001/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    # - technique:
    #   - id = "T1027"
    #   - name = "Obfuscated Files or Information"
    #   - reference = "https://attack.mitre.org/techniques/T1027/"
      # - subtechnique:
      #   - id = "T1560.001"
      #   - name = "Archive via Utility"
      #   - reference = "https://attack.mitre.org/techniques/T1560/001/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
