ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
ANPrule:
- author = ["Elastic"]

- description = """
    Adversaries may attempt to disable the syslog service in an attempt to an attempt to disrupt event logging and evade
    detection by security controls."""

# - false_positives = ["Updates to approved and trusted SSH executables can trigger this rule."]

- language = "kuery"

- license = "Elastic License v2"

# - references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor","https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf"]

- risk_score = 47

- rule_id = "2f8a1226-5720-437d-9c20-e0029deb6194"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "query"
name: "Attempt to Disable Syslog Service"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n  ((process.name:service and process.args:stop) or\n     (process.name:chkconfig and process.args:off) or\n     (process.name:systemctl and process.args:(disable or stop or kill)))  and process.args:(syslog or rsyslog or \"syslog-ng\")" }  }

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1562"
      - name = "Impair Defenses"
      - reference = "https://attack.mitre.org/techniques/T1562/"
      - subtechnique:
        - id = "T1562.001"
        - name = "Disable or Modify Tools"
        - reference = "https://attack.mitre.org/techniques/T1562/001/"   
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1554"
  #     - name = "Compromise Client Software Binary"
  #     - reference = "https://attack.mitre.org/techniques/T1554/"
  #     # - subtechnique:
  #     #   - id = "T1560.001"
  #     #   - name = "Archive via Utility"
  #     #   - reference = "https://attack.mitre.org/techniques/T1560/001/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
