ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """
    Kernel modules are pieces of code that can be loaded and unloaded into the kernel upon demand. They extend the functionality of the kernel without the need to reboot the system. This rule identifies attempts to remove a kernel module."""

- false_positives = ["There is usually no reason to remove modules, but some buggy modules require it. These can be exempted by username. Note that some Linux distributions are not built to support the removal of modules at all."]

- language = "kuery"

- license = "Elastic License v2"

- references = [""http://man7.org/linux/man-pages/man8/modprobe.8.html""]

- risk_score = 73

# - max_signals = 33

- rule_id = "cd66a5af-e34b-4bb0-8931-57d0a043f2ef"

- severity = "high"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "query"
name: "Kernel Module Removal"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n  process.args:((rmmod and sudo) or (modprobe and sudo and (\"--remove\" or \"-r\")))" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1562"
      - name = "Impair Defenses"
      - reference = "https://attack.mitre.org/techniques/T1562/"
      - subtechnique:
        - id = "T1562.001"
        - name = "Disable or Modify Tools"
        - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    - technique:
      - id = ""T1547""
      - name = "Boot or Logon Autostart Execution"
      - reference = "https://attack.mitre.org/techniques/T1547/"
      - subtechnique:
        - id = "T1547.006"
        - name ="Kernel Modules and Extensions"
        - reference = "https://attack.mitre.org/techniques/T1547/006/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
