ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
ANPrule:
- author = ["Elastic"]

- description = """
    Malware or other files dropped or created on a system by an adversary may leave traces behind as to what was done within a network and how. Adversaries may remove these files over the course of an intrusion to keep their footprint low or remove them at the end as part of the post-intrusion cleanup process."""

# - false_positives = ["Automated tools such as Jenkins may encode or decode files as part of their normal behavior. These events can be filtered by the process executable or username values."]

- language = "kuery"

- license = "Elastic License v2"

# - references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor","https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf"]

- risk_score = 21

- rule_id = "a1329140-8de3-4445-9f87-908fb6d824f4"

- severity = "low"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "query"
name: "File Deletion via Shred"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and process.name:shred and\n  process.args:(\"-u\" or \"--remove\" or \"-z\" or \"--zero\")" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1070"
      - name = "Indicator Removal on Host"
      - reference = "https://attack.mitre.org/techniques/T1070/"
      - subtechnique:
        - id = "T1070.004"
        - name = "File Deletion"
        - reference = "https://attack.mitre.org/techniques/T1070/004/"   
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1027"
  #     - name = "Obfuscated Files or Information"
  #     - reference = "https://attack.mitre.org/techniques/T1027/"
  #     # - subtechnique:
  #     #   - id = "T1560.001"
  #     #   - name = "Archive via Utility"
  #     #   - reference = "https://attack.mitre.org/techniques/T1560/001/"
  #   - tactic:
  #     - id = "TA0005"
  #     - name = "Defense Evasion"
  #     - reference = "https://attack.mitre.org/tactics/TA0005/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
