ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
ANPrule:
- author = ["Elastic"]

- description = """
    Adversaries may encode/decode data in an attempt to evade detection by host- or network-based security controls."""

- false_positives = ["Automated tools such as Jenkins may encode or decode files as part of their normal behavior. These events can be filtered by the process executable or username values."]

- language = "kuery"

- license = "Elastic License v2"

# - references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor","https://www.welivesecurity.com/wp-content/uploads/2021/01/ESET_Kobalos.pdf"]

- risk_score = 21

- rule_id = "debff20a-46bc-4a4d-bae5-5cdd14222795"

- severity = "low"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]

- type = "query"
name: "Base16 or Base32 Encoding/Decoding Activity"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n  process.name:(base16 or base32 or base32plain or base32hex)" }  }

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1140"
      - name = "Deobfuscate/Decode Files or Information"
      - reference = "https://attack.mitre.org/techniques/T1140/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"   
    # - tactic:
    #   - id = "TA0005"
    #   - name = "Defense Evasion"
    #   - reference = "https://attack.mitre.org/tactics/TA0005/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1027"
      - name = "Obfuscated Files or Information"
      - reference = "https://attack.mitre.org/techniques/T1027/"
      # - subtechnique:
      #   - id = "T1560.001"
      #   - name = "Archive via Utility"
      #   - reference = "https://attack.mitre.org/techniques/T1560/001/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
