ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """
    An adversary may attempt to get detailed information about the operating system and hardware. This rule identifies common locations used to discover virtual machine hardware by a non-root user. This technique has been used by the Pupy RAT and other malware."""

- false_positives = ["Certain tools or automated software may enumerate hardware information. These tools can be exempted via user name or process arguments to eliminate potential noise."]

- language = "kuery"

- license = "Elastic License v2"

# - references = ["https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"]

- risk_score = 73

# - max_signals = 33

- rule_id = "5b03c9fb-9945-4d2f-9568-fd690fee3fba"

- severity = "high"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Discovery"]

- type = "query"
name: "Virtual Machine Fingerprinting"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\nprocess.args:(\"\/sys\/class\/dmi\/id\/bios_version\" or\n\"\/sys\/class\/dmi\/id\/product_name\" or\n\"\/sys\/class\/dmi\/id\/chassis_vendor\" or\n\"\/proc\/scsi\/scsi\" or\n\\"\/proc\/ide\/hd0\/model\") and\n  not user.name:root" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1082"
      - name = "System Information Discovery"
      - reference = "https://attack.mitre.org/techniques/T1082/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0007"
      - name = "Discovery"
      - reference = "https://attack.mitre.org/tactics/TA0007/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = ""T1547""
  #     - name = "Boot or Logon Autostart Execution"
  #     - reference = "https://attack.mitre.org/techniques/T1547/"
  #     - subtechnique:
  #       - id = "T1547.006"
  #       - name ="Kernel Modules and Extensions"
  #       - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
