ANPdata:
- creation_date = "2021/7/28"
- maturity = "production"
- updated_date = "2021/7/28"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies when a terminal (tty) is spawned via Perl. Attackers may upgrade a simple reverse shell to a fully interactive tty after obtaining initial access to a host."""

# - false_positives = ["Certain tools or automated software may enumerate hardware information. These tools can be exempted via user name or process arguments to eliminate potential noise."]

- language = "kuery"

- license = "Elastic License v2"

# - references = ["https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"]

- risk_score = 73

# - max_signals = 33

- rule_id = "05e5a668-7b51-4a67-93ab-e9af405c9ef3"

- severity = "high"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Execution"]

- type = "query"
name: "Interactive Terminal Spawned via Perl"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and process.name:perl and\n  process.args:(\"exec \\\"\/bin\/sh\\\";\" or \"exec \\\"\/bin\/dash\\\";\" or \"exec \\\"\/bin\/bash\\\";\")" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0002"
      - name = "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = ""T1547""
  #     - name = "Boot or Logon Autostart Execution"
  #     - reference = "https://attack.mitre.org/techniques/T1547/"
  #     - subtechnique:
  #       - id = "T1547.006"
  #       - name ="Kernel Modules and Extensions"
  #       - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
