ANPdata:
- creation_date = "2021/7/31"
- maturity = "production"
- updated_date = "2021/7/31"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """
    Identifies that a login attempt occurred at a forbidden time."""

# - false_positives = ["Certain tools or automated software may enumerate hardware information. These tools can be exempted via user name or process arguments to eliminate potential noise."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://github.com/linux-pam/linux-pam/blob/aac5a8fdc4aa3f7e56335a6343774cc1b63b408d/modules/pam_time/pam_time.c#L666"]

- risk_score = 47

# - max_signals = 33

- rule_id = "90e28af7-1d96-4582-bf11-9a1eff21d0e5"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Initial Access"]

- type = "query"
name: "Auditd Login Attempt at Forbidden Time"
index: ["auditbeat-*"]
type: any
kql:
  "query": {"query_string": {"query": "event.module:auditd and event.action:\"attempted-log-in-during-unusual-hour-to\"" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1078"
      - name = "Valid Accounts"
      - reference = "https://attack.mitre.org/techniques/T1078/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0001"
      - name = "Initial Access"
      - reference = "https://attack.mitre.org/tactics/TA0001/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1078"
      - name = "Valid Accounts"
      - reference = "https://attack.mitre.org/techniques/T1078/"
      # - subtechnique:
      #   - id = "T1547.006"
      #   - name ="Kernel Modules and Extensions"
      #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
