ANPdata:
- creation_date = "2021/7/31"
- maturity = "production"
- updated_date = "2021/7/31"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """Strace runs in a privileged context and can be used to escape restrictive environments by instantiating a shell in order to elevate privileges or move laterally."""

- false_positives = ["Strace is a dual-use tool that can be used for benign or malicious activity. Some normal use of this command may originate from developers or SREs engaged in debugging or system call tracing."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://en.wikipedia.org/wiki/Strace"]

- risk_score = 21

# - max_signals = 33

- rule_id = "d6450d4e-81c6-46a3-bd94-079886318ed5"

- severity = "low"

- tags = ["Elastic", "Host", "Linux", "Threat Detection"]

- type = "query"
name: "Strace Process Activity"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and process.name:strace" }  }
# threat:
#   - 01:
#     - threat_rule: 
#       - framework = "MITRE ATT&CK"
#     - technique: 
#       - id = "T1021"
#       - name = "Remote Services"
#       - reference = "https://attack.mitre.org/techniques/T1021/"
#       # - subtechnique:
#       #   - id = "T1562.001"
#       #   - name = "Disable or Modify Tools"
#       #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
#     - tactic:
#       - id = "TA0008"
#       - name = "Lateral Movement"
#       - reference = "https://attack.mitre.org/tactics/TA0008/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1078"
  #     - name = "Valid Accounts"
  #     - reference = "https://attack.mitre.org/techniques/T1078/"
  #     # - subtechnique:
  #     #   - id = "T1547.006"
  #     #   - name ="Kernel Modules and Extensions"
  #     #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
