ANPdata:
- creation_date = "2021/7/31"
- maturity = "production"
- updated_date = "2021/7/31"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """Iodine is a tool for tunneling Internet protocol version 4 (IPV4) traffic over the DNS protocol to circumvent firewalls, network security groups, and network access lists while evading detection."""

- false_positives = ["Normal use of Iodine is uncommon apart from security testing and research. Use by non-security engineers is very uncommon."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://code.kryo.se/iodine/"]

- risk_score = 73

# - max_signals = 33

- rule_id = "041d4d41-9589-43e2-ba13-5680af75ebc2"

- severity = "high"

- tags = ["Elastic", "Host", "Linux", "Threat Detection"]

- type = "query"
name: "Potential DNS Tunneling via Iodine"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and process.name:(iodine or iodined)" }  }
# threat:
#   - 01:
#     - threat_rule: 
#       - framework = "MITRE ATT&CK"
#     - technique: 
#       - id = "T1021"
#       - name = "Remote Services"
#       - reference = "https://attack.mitre.org/techniques/T1021/"
#       # - subtechnique:
#       #   - id = "T1562.001"
#       #   - name = "Disable or Modify Tools"
#       #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
#     - tactic:
#       - id = "TA0008"
#       - name = "Lateral Movement"
#       - reference = "https://attack.mitre.org/tactics/TA0008/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1078"
  #     - name = "Valid Accounts"
  #     - reference = "https://attack.mitre.org/techniques/T1078/"
  #     # - subtechnique:
  #     #   - id = "T1547.006"
  #     #   - name ="Kernel Modules and Extensions"
  #     #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
