ANPdata:
- creation_date = "2021/7/31"
- maturity = "production"
- updated_date = "2021/7/31"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """Adversaries may modify SSH related binaries for persistence or credential access by patching sensitive functions to enable unauthorized access or by logging SSH credentials for exfiltration."""

- false_positives = ["Trusted OpenSSH executable updates. It's recommended to verify the integrity of OpenSSH binary changes."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://blog.angelalonso.es/2016/09/anatomy-of-real-linux-intrusion-part-ii.html"]

- risk_score = 47

# - max_signals = 33

- rule_id = "0415f22a-2336-45fa-ba07-618a5942e22c"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Credential Access", "Persistence"]

- type = "query"
name: "Modification of OpenSSH Binaries"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:file and event.type:change and \n process.name:* and\n (file.path:(/usr/sbin/sshd or /usr/bin/ssh or /usr/bin/sftp or /usr/bin/scp) or file.name:libkeyutils.so) and\n not process.executable:/usr/bin/dpkg" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1543"
      - name = "Create or Modify System Process"
      - reference = "https://attack.mitre.org/techniques/T1543/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"
  - 02: 
    - threat_rule:
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1556"
      - name = "Modify Authentication Process"
      - reference = "https://attack.mitre.org/techniques/T1556/"
      # - subtechnique:
      #   - id = "T1547.006"
      #   - name ="Kernel Modules and Extensions"
      #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
    - tactic:
      - id = "TA0006"
      - name = "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
