ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """Identifies modification of the dynamic linker preload shared object (ld.so.preload). Adversaries may execute malicious payloads by hijacking the dynamic linker used to load libraries."""

# - false_positives = ["Network monitoring or management products may have a web server component that runs shell commands as part of normal behavior."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://www.anomali.com/blog/rocke-evolves-its-arsenal-with-a-new-malware-family-written-in-golang"]

- risk_score = 47

# - max_signals = 33

- rule_id = "717f82c2-7741-4f9b-85b8-d06aeb853f4f"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Privilege Escalation"]

- type = "query"
name: "Modification of Dynamic Linker Preload Shared Object"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
kql:
  "query": {"query_string": {"query": "event.category:file and not event.type:deletion and file.path:/etc/ld.so.preload" }  }
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1574"
      - name = "Hijack Execution Flow"
      - reference = "https://attack.mitre.org/techniques/T1574/"
      - subtechnique:
        - id = "T1574.006"
        - name = "LD_PRELOAD"
        - reference = "https://attack.mitre.org/techniques/T1574/006/"
    - tactic:
      - id = "TA0004"
      - name = "Privilege Escalation"
      - reference = "https://attack.mitre.org/tactics/TA0004/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1556"
  #     - name = "Modify Authentication Process"
  #     - reference = "https://attack.mitre.org/techniques/T1556/"
  #     # - subtechnique:
  #     #   - id = "T1547.006"
  #     #   - name ="Kernel Modules and Extensions"
  #     #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0006"
  #     - name = "Credential Access"
  #     - reference = "https://attack.mitre.org/tactics/TA0006/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
