ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"

ANPrule:
- author: ["Elastic"]

- description: "Identifies certutil.exe making a network connection. Adversaries could abuse certutil.exe to download a certificate, or malware, from a remote URL."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score: 21

- rule_id: "3838e0e3-1850-4850-a411-2e8c5ba40ba8"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1105",
        name : "Ingress Tool Transfer",
        reference : "https://attack.mitre.org/techniques/T1105/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]]]

name: Network Connection via Certutil
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "sequence by process.entity_id\n  [process where process.name : \"certutil.exe\" and event.type == \"start\"]\n  [network where process.name : \"certutil.exe\" and\n    not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",                                  \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\",                                  \"192.0.0.171/32\", \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\",                                  \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\", \"192.175.48.0/24\",                                  \"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\",                                  \"FE80::/10\", \"FF00::/8\")]"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
