ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies powershell.exe being used to download an executable file from an untrusted remote destination."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "33f306e8-417c-411b-965c-c2812d6d3f4d"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1105c",
        name : "Ingress Tool Transfer",
        reference : "https://attack.mitre.org/techniques/T1105c/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1059",
        name : "Command and Scripting Interpreter",
        reference : "https://attack.mitre.org/techniques/T1059/",
        subtechnique: [
          [id : "T1059.001",        
          name : "PowerShell",        
          reference : "https://attack.mitre.org/techniques/T1059/001/"]
          
        ]
      ],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]
    ]
  ]

name: Remote File Download via PowerShell
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "sequence by host.id, process.entity_id with maxspan=30s [network
    where process.name : (\"powershell.exe\", \"pwsh.exe\",
    \"powershell_ise.exe\") and network.protocol == \"dns\" and not
    dns.question.name : (\"localhost\", \"*.microsoft.com\",
    \"*.azureedge.net\", \"*.powershellgallery.com\", \"*.windowsupdate.com\",
    \"metadata.google.internal\") and not user.domain : \"NT AUTHORITY\"]
    [file where process.name : \"powershell.exe\" and event.type ==
    \"creation\" and file.extension : (\"exe\", \"dll\", \"ps1\", \"bat\") and
    not file.name : \"__PSScriptPolicy*.ps1\"]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
