ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a Windows trusted program that is known to be vulnerable to DLL Search Order Hijacking starting after being renamed or from a non-standard path. This is uncommon behavior and may indicate an attempt to evade defenses via side-loading a malicious DLL within the memory space of one of those processes."

- false_positives: ["Microsoft Antimalware Service Executable installed on non default installation path."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://news.sophos.com/en-us/2021/07/04/independence-day-revil-uses-supply-chain-exploit-to-attack-hundreds-of-businesses/"]

- risk_score: 73

- rule_id: "053a0387-f3b5-4ba5-8245-8002cca2bd08"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1574",
        name : "Hijack Execution Flow",
        reference : "https://attack.mitre.org/techniques/T1574/",
        subtechnique: [
          [id : "T1574.002",        
          name : "DLL Side-Loading",        
          reference : "https://attack.mitre.org/techniques/T1574/002/"]
        ]
      ],

      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

      
name: "Potential DLL Side-Loading via Microsoft Antimalware Service Executable"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type == \"start\" and
    (process.pe.original_file_name == \"MsMpEng.exe\" and not process.name : \"MsMpEng.exe\") or
    (process.name : \"MsMpEng.exe\" and not
          process.executable : (\"?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*.exe\",
                                \"?:\\\\Program Files\\\\Windows Defender\\\\*.exe\",
                                \"?:\\\\Program Files (x86)\\\\Windows Defender\\\\*.exe\"))"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
