ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies network activity from unexpected system applications. This may indicate adversarial activity as these applications are often leveraged by adversaries to execute code and evade detection."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "1fe3b299-fbb5-4657-a937-1d746f2c711a"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1127",
        name : "Trusted Developer Utilities Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1127/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]


name: "Unusual Network Activity from a Windows System Binary"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by process.entity_id with maxspan=5m
    [process where event.type in (\"start\", \"process_started\") and
      /* known applocker bypasses */
      (process.name : \"bginfo.exe\" or
        process.name : \"cdb.exe\" or
        process.name : \"control.exe\" or
        process.name : \"cmstp.exe\" or
        process.name : \"csi.exe\" or
        process.name : \"dnx.exe\" or
        process.name : \"fsi.exe\" or
        process.name : \"ieexec.exe\" or
        process.name : \"iexpress.exe\" or
        process.name : \"installutil.exe\" or
        process.name : \"Microsoft.Workflow.Compiler.exe\" or
        process.name : \"MSBuild.exe\" or
        process.name : \"msdt.exe\" or
        process.name : \"mshta.exe\" or
        process.name : \"msiexec.exe\" or
        process.name : \"msxsl.exe\" or
        process.name : \"odbcconf.exe\" or
        process.name : \"rcsi.exe\" or
        process.name : \"regsvr32.exe\" or
        process.name : \"xwizard.exe\")]
    [network where
      (process.name : \"bginfo.exe\" or
        process.name : \"cdb.exe\" or
        process.name : \"control.exe\" or
        process.name : \"cmstp.exe\" or
        process.name : \"csi.exe\" or
        process.name : \"dnx.exe\" or
        process.name : \"fsi.exe\" or
        process.name : \"ieexec.exe\" or
        process.name : \"iexpress.exe\" or
        process.name : \"installutil.exe\" or
        process.name : \"Microsoft.Workflow.Compiler.exe\" or
        process.name : \"MSBuild.exe\" or
        process.name : \"msdt.exe\" or
        process.name : \"mshta.exe\" or
        process.name : \"msiexec.exe\" or
        process.name : \"msxsl.exe\" or
        process.name : \"odbcconf.exe\" or
        process.name : \"rcsi.exe\" or
        process.name : \"regsvr32.exe\" or
        process.name : \"xwizard.exe\")]"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
