ANPdata:
- creation_date = "2021/8/4"
- maturity = "production"
- updated_date = "2021/8/4"
ANPrule:
- author: ["Elastic"]

- description: "Identifies attempts to enable the Windows scheduled tasks AT command via the registry. Attackers may use this method to move laterally or persist locally. The AT command has been deprecated since Windows 8 and Windows Server 2012, but still exists for backwards compatibility."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://docs.microsoft.com/en-us/windows/win32/cimwin32prov/win32-scheduledjob"]

- risk_score: 47

- rule_id: "9aa0e1f6-52ce-42e1-abb3-09657cee2698"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1562",
        name : "Impair Defenses",
        reference : "https://attack.mitre.org/techniques/T1562/",
        subtechnique: [
          [id : "T1562.001",        
          name : "Rundll32",        
          reference : "https://attack.mitre.org/techniques/T1562/001/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Scheduled Tasks AT Command Enabled"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "registry where 
    registry.path : \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\Configuration\\\\EnableAt\" and registry.data.strings == \"1\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
