ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies Mshta.exe making outbound network connections. This may indicate adversarial activity, as Mshta is often leveraged by adversaries to execute malicious scripts and evade detection."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "c2d90150-0133-451c-a783-533e736c12d7"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/",
        subtechnique: [
          [id : "T1218.005",        
          name : "Mshta",        
          reference : "https://attack.mitre.org/techniques/T1218/005/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Mshta Making Network Connections"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by process.entity_id with maxspan=10m
    [process where event.type in (\"start\", \"process_started\") and process.name : \"mshta.exe\" and
      not process.parent.name : \"Microsoft.ConfigurationManagement.exe\" and
      not (process.parent.executable : \"C:\\\\Amazon\\\\Amazon Assistant\\\\amazonAssistantService.exe\" or
            process.parent.executable : \"C:\\\\TeamViewer\\\\TeamViewer.exe\") and
      not process.args : \"ADSelfService_Enroll.hta\"]
    [network where process.name : \"mshta.exe\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
