ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "A suspicious Endpoint Security parent process was detected. This may indicate a process hollowing or other form of code injection."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "b41a13c6-ba45-4bab-a534-df53d0cfed6a"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1036",
        name : "Masquerading",
        reference : "https://attack.mitre.org/techniques/T1036/"
      ],

      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Suspicious Endpoint Security Parent Process"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\", \"info\") and
    process.name : (\"esensor.exe\", \"elastic-endpoint.exe\") and
    process.parent.executable != null and
      /* add FPs here */
    not process.parent.executable : (\"C:\\\\Program Files\\\\Elastic\\\\*\", 
                                      \"C:\\\\Windows\\\\System32\\\\services.exe\", 
                                      \"C:\\\\Windows\\\\System32\\\\WerFault*.exe\", 
                                      \"C:\\\\Windows\\\\System32\\\\wermgr.exe\")"


  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
