ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies suspicious creation of Alternate Data Streams on highly targeted files. This is uncommon for legitimate files
    and sometimes done by adversaries to hide malware."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "71bccb61-e19b-452f-b104-79a60e546a95"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1564",
        name : "Hide Artifacts",
        reference : "https://attack.mitre.org/techniques/T1564/",
        subtechnique: [
          [id : "T1564.004",        
          name : "NTFS File Attributes",        
          reference : "https://attack.mitre.org/techniques/T1564/004/"]

        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Unusual File Creation - Alternate Data Stream"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "file where event.type == \"creation\" and
    file.path : \"C:\\\\*:*\" and
    not file.path : \"C:\\\\*:zone.identifier*\" and
    file.extension :
      (
        \"pdf\",
        \"dll\",
        \"png\",
        \"exe\",
        \"dat\",
        \"com\",
        \"bat\",
        \"cmd\",
        \"sys\",
        \"vbs\",
        \"ps1\",
        \"hta\",
        \"txt\",
        \"vbe\",
        \"js\",
        \"wsh\",
        \"docx\",
        \"doc\",
        \"xlsx\",
        \"xls\",
        \"pptx\",
        \"ppt\",
        \"rtf\",
        \"gif\",
        \"jpg\",
        \"png\",
        \"bmp\",
        \"img\",
        \"iso\"
      )"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
