ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the use of Windows Management Instrumentation Command (WMIC) to discover certain System Security Settings
    such as AntiVirus or Host Firewall details."

# - false_positives: ["If the domains listed in this rule are used as part of an authorized workflow, this rule will be triggered by those
#     events. Validate that this is expected activity and tune the rule to fit your environment variables."]

# - interval: "30m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment."""

# - references: ["https://community.jisc.ac.uk/blogs/csirt/article/trickbot-analysis-and-mitigation", "https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware"]

# - max_signals: 33

- risk_score: 47

- rule_id: "6ea55c81-e2ba-42f2-a134-bccf857ba922"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Discovery"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1518",
        name : "Software Discovery",
        reference : "https://attack.mitre.org/techniques/T1518/"],
       
      
      tactic: [
        id : "TA0007",
        name : "Discovery",
        reference : "https://attack.mitre.org/tactics/TA0007/"]
    ]
  ]

name: "Security Software Discovery using WMIC"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: any
eql:
 "query": "process where event.type in (\"start\", \"process_started\") and    (process.name:\"wmic.exe\" or process.pe.original_file_name:\"wmic.exe\") and      process.args:\"/namespace:\\\\root\\\\SecurityCenter2\" and process.args:\"Get\""
  

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
