ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule: 
- author: ["Elastic"]

- description : |
    """
    "query": "sequence\n  [ any where parsedmessage.Image like \"*Windows*system32*msiexec.exe\" ]\n  [ any where parsedmessage.TargetFilename like \"*Program Files (x86)*Kaspersky Lab*NetworkAgent*protcomp*kl_remote.dll\" ]\n [any where anp.normdata.majorsubgroup == \"Session Create\" and parsedmessage.dst_port ==\"8080\" and parsedmessage.dst_ip ==\"192.168.1.11\"]"   
    """

- false_positives :  ["This is meant to run only on datasources using agents v7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."]

- language : "eql"

- license : "Elastic License v2"

- risk_score : 73

- rule_id : "493834ca-f861-414c-8602-150d5505b777"

- severity : "high"

- tags :  ["Elastic", "Threat Detection", "Defense Evasion"]

- threat: [

    
    [framework : "MITRE ATT&CK",
      tactic: [
        id : "TA0002",      name : "Execution",      reference : "https://attack.mitre.org/tactics/TA0002/"]],

    [framework : "MITRE ATT&CK",
    
    technique: [
      id : "T1566",
      name : "Phishing",
      reference : "https://attack.mitre.org/techniques/T1566/",
      subtechnique: [

        [id : "T1566.001",        name : "Spearphishing Attachment",        reference : "https://attack.mitre.org/techniques/T1566/001/"],     
        [id : "T1566.002",        name : "Spearphishing Link",        reference : "https://attack.mitre.org/techniques/T1566/002/"]
      ]
    ],
    
    tactic: [
      id : "TA0001",
      name : "Initial Access",
      reference : "https://attack.mitre.org/tactics/TA0001/"]
]]


name: "EQL_rule"

index: winasa 
  # anpsiem-log-agentbase-windowsserver-000001
# , anpsiem-log-agentless-syslog-security-cisco-firewall-asa-000001

type: any

# type: frequency

# num_events: 2

# query_key: event.code

# timeframe:
#   hours: 1


eql:
  "query": "sequence\n   [any where anp.normdata.majorsubgroup == \"Session Create\" and parsedmessage.dst_port ==\"8080\" and parsedmessage.dst_ip ==\"192.168.1.11\" and parsedmessage.src_ip == \"10.0.20.23\"]\n [any where event.code ==\"8\" and anpip== \"10.0.20.23\" ]"
  # "query": "sequence\n  [any where event.code ==\"4624\" ]\n [ any where parsedmessage.Image like \"*Windows*system32*msiexec.exe\" and parsedmessage.RuleName == \"DLL\" ]\n [any where anp.normdata.majorsubgroup == \"Session Create\" and parsedmessage.dst_port ==\"8080\" and parsedmessage.dst_ip ==\"192.168.1.11\"]"

  # "query": "any where event.code == \"860\"" 
 



alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
