ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies command shell activity started via RunDLL32, which is commonly abused by attackers to host malicious code."

- false_positives: ["Microsoft Windows installers leveraging RunDLL32 for installation."]

# - interval: "30m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment."""

# - references: ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

# - max_signals: 33

- risk_score: 21

- rule_id: "9ccf3ce0-0057-440a-91f5-870c6ad39093"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1059",
        name : "Command and Scripting Interpreter",
        reference : "https://attack.mitre.org/techniques/T1059/",
        subtechnique: [
          [id : "T1059.001",        
          name : "PowerShell",        
          reference : "https://attack.mitre.org/techniques/T1059/001/"]
        ]],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]]]

name: "Command Shell Activity Started via RunDLL32"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: any
eql:
  "query": "process where event.type == \"start\" and
    process.name : (\"cmd.exe\", \"powershell.exe\") and
      process.parent.name : \"rundll32.exe\" and process.parent.command_line != null and
      /* common FPs can be added here */
      not process.parent.args : (\"C:\\\\Windows\\\\System32\\\\SHELL32.dll,RunAsNewUser_RunDLL\",
                                \"C:\\\\WINDOWS\\\\*.tmp,zzzzInvokeManagedCustomActionOutOfProc\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
