ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
- min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "tifies the PowerShell engine being invoked by unexpected processes. Rather than executing PowerShell functionality
    with powershell.exe, some attackers do this to operate more stealthily."

# - false_positives: ["Legitimate scheduled tasks may be created during installation of new software."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     The SxS DotLocal folder is a legitimate feature that can be abused to hijack standard modules loading order by forcing an executable on the same application.exe.local folder to load a malicious DLL module from the same directory."""

# - references: ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"]

# - max_signals: 33

- risk_score: 47

- rule_id: "852c1f19-68e8-43a6-9dce-340771fe1be3"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1059",
        name : "Command and Scripting Interpreter",
        reference : "https://attack.mitre.org/techniques/T1059/",
        subtechnique: [
          [id : "T1059.001",        
          name : "PowerShell",        
          reference : "https://attack.mitre.org/techniques/T1059/001/"]
        ]
      ],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]]
  ]

name: "Suspicious PowerShell Engine ImageLoad"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: any
eql:
  "query": "library where dll.name : (\"System.Management.Automation.ni.dll\", \"System.Management.Automation.dll\") and
    /* add false positives relevant to your environment here */
    not process.executable : (\"C:\\\\Windows\\\\System32\\\\RemoteFXvGPUDisablement.exe\", \"C:\\\\Windows\\\\System32\\\\sdiagnhost.exe\") and
    not process.executable regex~ \"\"\"C:\\\\Program Files( x86)?\\\\*\\\\.exe\"\"\" and
      not process.name :
      (
        \"Altaro.SubAgent.exe\",
        \"AppV_Manage.exe\",
        \"azureadconnect.exe\",
        \"CcmExec.exe\",
        \"configsyncrun.exe\",
        \"choco.exe\",
        \"ctxappvservice.exe\",
        \"DVLS.Console.exe\",
        \"edgetransport.exe\",
        \"exsetup.exe\",
        \"forefrontactivedirectoryconnector.exe\",
        \"InstallUtil.exe\",
        \"JenkinsOnDesktop.exe\",
        \"Microsoft.EnterpriseManagement.ServiceManager.UI.Console.exe\",
        \"mmc.exe\",
        \"mscorsvw.exe\",
        \"msexchangedelivery.exe\",
        \"msexchangefrontendtransport.exe\",
        \"msexchangehmworker.exe\",
        \"msexchangesubmission.exe\",
        \"msiexec.exe\",
        \"MsiExec.exe\",
        \"noderunner.exe\",
        \"NServiceBus.Host.exe\",
        \"NServiceBus.Host32.exe\",
        \"NServiceBus.Hosting.Azure.HostProcess.exe\",
        \"OuiGui.WPF.exe\",
        \"powershell.exe\",
        \"powershell_ise.exe\",
        \"pwsh.exe\",
        \"SCCMCliCtrWPF.exe\",
        \"ScriptEditor.exe\",
        \"ScriptRunner.exe\",
        \"sdiagnhost.exe\",
        \"servermanager.exe\",
        \"setup100.exe\",
        \"ServiceHub.VSDetouredHost.exe\",
        \"SPCAF.Client.exe\",
        \"SPCAF.SettingsEditor.exe\",
        \"SQLPS.exe\",
        \"telemetryservice.exe\",
        \"UMWorkerProcess.exe\",
        \"w3wp.exe\",
        \"wsmprovhost.exe\"
      )"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
