ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Detects attempts to establish persistence on an endpoint by abusing Microsoft Office add-ins."

# - false_positives:  ["""Legitimate scheduled tasks may be created during installation of new software."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://labs.mwrinfosecurity.com/blog/add-in-opportunities-for-office-persistence/"]

# - max_signals: 33

- risk_score: 73

- rule_id: "f44fa4b6-524c-4e87-8d9e-a32599e4fb7c"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1137",
        name : "Office Application Startup",
        reference : "https://attack.mitre.org/techniques/T1137/"
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]
name: "Persistence via Microsoft Office AddIns"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "file where event.type != \"deletion\" and
    file.extension : (\"wll\",\"xll\",\"ppa\",\"ppam\",\"xla\",\"xlam\") and
    file.path :
        (
        \"C:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Word\\\\Startup\\\\*\",
        \"C:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Microsoft\\\\AddIns\\\\*\",
        \"C:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Excel\\\\XLSTART\\\\*\"
        )"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
