ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies files written or modified in the startup folder by unsigned processes. Adversaries may abuse this technique
    to maintain persistence in an environment."

# - false_positives:  ["""A legitimate VBA for Outlook is usually configured interactively via OUTLOOK.EXE."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

# - references: ["https://www.microsoftpressstore.com/articles/article.aspx?p=2762082&seqNum=2"]

# - max_signals: 33

- risk_score: 41

- rule_id: "2fba96c0-ade5-4bce-b92f-a5df2509da3f"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.001",        
          name : "Registry Run Keys / Startup Folder",        
          reference : "https://attack.mitre.org/techniques/T1547/001/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Startup Folder Persistence via Unsigned Process"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by host.id, process.entity_id with maxspan=5s
    [process where event.type in (\"start\", \"process_started\") and process.code_signature.trusted == false and
    /* suspicious paths can be added here  */
    process.executable : (\"C:\\\\Users\\\\*.exe\", 
                          \"C:\\\\ProgramData\\\\*.exe\", 
                          \"C:\\\\Windows\\\\Temp\\\\*.exe\", 
                          \"C:\\\\Windows\\\\Tasks\\\\*.exe\", 
                          \"C:\\\\Intel\\\\*.exe\", 
                          \"C:\\\\PerfLogs\\\\*.exe\")
    ]
    [file where event.type != \"deletion\" and user.domain != \"NT AUTHORITY\" and
      file.path : (\"C:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\*\", 
                  \"C:\\\\ProgramData\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\StartUp\\\\*\")
    ]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
