ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies execution of suspicious persistent programs (scripts, rundll32, etc.) by looking at process lineage and
    command line usage."

# - false_positives:  ["""A legitimate VBA for Outlook is usually configured interactively via OUTLOOK.EXE."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

# - references: ["https://www.microsoftpressstore.com/articles/article.aspx?p=2762082&seqNum=2"]

# - max_signals: 33

- risk_score: 47

- rule_id: "e7125cea-9fe1-42a5-9a05-b0792cf86f5a"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.001",        
          name : "Registry Run Keys / Startup Folder",        
          reference : "https://attack.mitre.org/techniques/T1547/001/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]
name: "Execution of Persistent Suspicious Program"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "/* userinit followed by explorer followed by early child process of explorer (unlikely to be launched interactively) within 1m */
    sequence by host.id, user.name with maxspan=1m
      [process where event.type in (\"start\", \"process_started\") and process.name : \"userinit.exe\" and process.parent.name : \"winlogon.exe\"]
      [process where event.type in (\"start\", \"process_started\") and process.name : \"explorer.exe\"]
      [process where event.type in (\"start\", \"process_started\") and process.parent.name : \"explorer.exe\" and
      /* add suspicious programs here */
      process.pe.original_file_name in (\"cscript.exe\",
                                        \"wscript.exe\",
                                        \"PowerShell.EXE\",
                                        \"MSHTA.EXE\",
                                        \"RUNDLL32.EXE\",
                                        \"REGSVR32.EXE\",
                                        \"RegAsm.exe\",
                                        \"MSBuild.exe\",
                                        \"InstallUtil.exe\") and
        /* add potential suspicious paths here */
        process.args : (\"C:\\\\Users\\\\*\", \"C:\\\\ProgramData\\\\*\", \"C:\\\\Windows\\\\Temp\\\\*\", \"C:\\\\Windows\\\\Tasks\\\\*\", \"C:\\\\PerfLogs\\\\*\", \"C:\\\\Intel\\\\*\")
      ]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
