ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies port monitor and print processor registry modifications. Adversaries may abuse port monitor and print
    processors to run malicious DLLs during system boot that will be executed as SYSTEM for privilege escalation and/or
    persistence, if permissions allow writing a fully-qualified pathname for that DLL."

# - false_positives:  ["""Legitimate local user creations may be done by a system or network administrator. Verify whether this is known
    # behavior in your environment. Local user creations from unfamiliar users or hosts should be investigated. If known
    # behavior is causing false positives, it can be exempted from the rule."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "8f3e91c7-d791-4704-80a1-42c160d7aa27"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.010",        
          name : "Port Monitors",        
          reference : "https://attack.mitre.org/techniques/T1547/010/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.010",        
          name : "Port Monitors",        
          reference : "https://attack.mitre.org/techniques/T1547/002/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]
name: "Potential Port Monitor or Print Processor Registration Abuse"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "registry where event.type in (\"creation\", \"change\") and
    registry.path : (\"HKLM\\\\SYSTEM\\\\*ControlSet*\\\\Control\\\\Print\\\\Monitors\\\\*\",
      \"HLLM\\\\SYSTEM\\\\*ControlSet*\\\\Control\\\\Print\\\\Environments\\\\Windows*\\\\Print Processors\\\\*\") and
    registry.data.strings : \"*.dll\" and
    /* exclude SYSTEM SID - look for changes by non-SYSTEM user */
    not user.id : \"S-1-5-18\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
