ANPdata:
- creation_date = "2021/8/12"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/12"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies User Account Control (UAC) bypass via sdclt.exe. Attackers bypass UAC to stealthily execute code with
    elevated permissions."

# - false_positives:  ["""Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as
    # manufacturer and signature information."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

# - references: ["https://github.com/AzAgarampur/byeintegrity-uac"]

# - max_signals: 33

- risk_score: 73

- rule_id: "9b54e002-034a-47ac-9307-ad12c03fa900"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1548",
        name : "Abuse Elevation Control Mechanism",
        reference : "https://attack.mitre.org/techniques/T1548/",
        subtechnique: [
          [id : "T1548.002",        
          name : "Bypass User Account Control",        
          reference : "https://attack.mitre.org/techniques/T1548/002/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]

name: "Bypass UAC via Sdclt"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "/* add winlogbeat-* when process.code_signature.* fields are populated */
    /* still needs testing, applicable binary was not available on test machine */
    sequence with maxspan=1m
      [process where event.type in (\"start\", \"process_started\") and process.name : \"sdclt.exe\" and
        /* uncomment once in winlogbeat */
        /* process.code_signature.subject_name == \"Microsoft Corporation\" and process.code_signature.trusted == true and */
        process.args : \"/kickoffelev\"
      ] by process.entity_id
      [process where event.type in (\"start\", \"process_started\") and process.parent.name : \"sdclt.exe\" and
        not (process.executable : \"C:\\\\Windows\\\\System32\\\\sdclt.exe\" or
              process.executable : \"C:\\\\Windows\\\\System32\\\\control.exe\" or
              process.executable : \"C:\\\\Windows\\\\SysWOW64\\\\sdclt.exe\" or
              process.executable : \"C:\\\\Windows\\\\SysWOW64\\\\control.exe\")
      ] by process.parent.entity_id"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
