ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies User Account Control (UAC) bypass attempts by abusing an elevated COM Interface to launch a malicious
    program. Attackers may attempt to bypass UAC to stealthily execute code with elevated permissions."

# - false_positives:  ["""Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as
    # manufacturer and signature information."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

- references: ["https://swapcontext.blogspot.com/2020/11/uac-bypasses-from-comautoapprovallist.html"]

# - max_signals: 33

- risk_score: 47

- rule_id: "fc7c0fa4-8f03-4b3e-8336-c5feab0be022"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1548",
        name : "Abuse Elevation Control Mechanism",
        reference : "https://attack.mitre.org/techniques/T1548/",
        subtechnique: [
          [id : "T1548.002",        
          name : "Bypass User Account Control",        
          reference : "https://attack.mitre.org/techniques/T1548/002/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]
name: "UAC Bypass Attempt via Elevated COM Internet Explorer Add-On Installer"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and    process.executable : \"C:\\\\*\\\\AppData\\\\*\\\\Temp\\\\IDC*.tmp\\\\*.exe\" and    process.parent.name : \"ieinstal.exe\" and process.parent.args : \"-Embedding\"    /* uncomment once in winlogbeat */    /* and not (process.code_signature.subject_name == \"Microsoft Corporation\" and process.code_signature.trusted == true) */"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
