ANPdata:
- creation_date = "2021/8/12"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/12"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies an attempt to bypass User Account Control (UAC) by masquerading as a Microsoft trusted Windows directory.
    Attackers may bypass UAC to stealthily execute code with elevated permissions."

# - false_positives:  ["""Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as
    # manufacturer and signature information."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

- references: ["https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e"]

# - max_signals: 33

- risk_score: 73

- rule_id: "290aca65-e94d-403b-ba0f-62f320e63f51"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1548",
        name : "Abuse Elevation Control Mechanism",
        reference : "https://attack.mitre.org/techniques/T1548/",
        subtechnique: [
          [id : "T1548.002",        
          name : "Bypass User Account Control",        
          reference : "https://attack.mitre.org/techniques/T1548/002/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]

name: "UAC Bypass Attempt via Windows Directory Masquerading"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
      process.args : (\"C:\\\\Windows \\\\system32\\\\*.exe\", \"C:\\\\Windows \\\\SysWOW64\\\\*.exe\")"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
