ANPdata:
- creation_date = "2021/8/12"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/12"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies unusual child processes of Service Host (svchost.exe) that traditionally do not spawn any child processes.
    This may indicate a code injection or an equivalent form of exploitation."

- false_positives:  ["Changes to Windows services or a rarely executed child process."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

# - references: ["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527", "https://github.com/afwu/PrintNightmare"]

# - max_signals: 33

- risk_score: 47

- rule_id: "6a8ab9cc-4023-4d17-b5df-1a3e16882ce7"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion", "Privilege Escalation"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1055",
        name : "Process Injection",
        reference : "https://attack.mitre.org/techniques/T1055/",
        subtechnique: [
          [id : "T1055.012",        
          name : "Process Hollowing",        
          reference : "https://attack.mitre.org/techniques/T1055/012/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]],
    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1055",
        name : "Process Injection",
        reference : "https://attack.mitre.org/techniques/T1055/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]
    
  ]
name: "Unusual Service Host Child Process - Childless Service"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
     process.parent.name : \"svchost.exe\" and
     /* based on svchost service arguments -s svcname where the service is known to be childless */
    process.parent.args : (\"WdiSystemHost\",\"LicenseManager\",
      \"StorSvc\",\"CDPSvc\",\"cdbhsvc\",\"BthAvctpSvc\",\"SstpSvc\",\"WdiServiceHost\",
      \"imgsvc\",\"TrkWks\",\"WpnService\",\"IKEEXT\",\"PolicyAgent\",\"CryptSvc\",
      \"netprofm\",\"ProfSvc\",\"StateRepository\",\"camsvc\",\"LanmanWorkstation\",
      \"NlaSvc\",\"EventLog\",\"hidserv\",\"DisplayEnhancementService\",\"ShellHWDetection\",
      \"AppHostSvc\",\"fhsvc\",\"CscService\",\"PushToInstall\") and
      /* unknown FPs can be added here */
     not process.name : (\"WerFault.exe\",\"WerFaultSecure.exe\",\"wermgr.exe\")"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
