ANPdata:
- creation_date = "2021/8/12"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/12"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Detects unusual Print Spooler service (spoolsv.exe) child processes. This may indicate an attempt to exploit privilege
    escalation vulnerabilities related to the Printing Service on Windows."

- false_positives:  ["Install or update of a legitimate printing driver. Verify the printer driver file metadata such as manufacturer and signature
    information."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

- references: ["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527", "https://github.com/afwu/PrintNightmare"]

# - max_signals: 33

- risk_score: 47

- rule_id: "ee5300a7-7e31-4a72-a258-250abb8b3aa1"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1068",
        name : "Exploitation for Privilege Escalation",
        reference : "https://attack.mitre.org/techniques/T1068/"
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]
name: "Unusual Print Spooler Child Process"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type == \"start\" and
    process.parent.name : \"spoolsv.exe\" and user.id : \"S-1-5-18\" and
    /* exclusions for FP control below */
    not process.name : (\"splwow64.exe\", \"PDFCreator.exe\", \"acrodist.exe\", \"spoolsv.exe\", \"msiexec.exe\", \"route.exe\", \"WerFault.exe\") and
    not process.command_line : \"*\\\\WINDOWS\\\\system32\\\\spool\\\\DRIVERS*\" and
    not (process.name : \"net.exe\" and process.command_line : (\"*stop*\", \"*start*\")) and
    not (process.name : (\"cmd.exe\", \"powershell.exe\") and process.command_line : (\"*.spl*\", \"*\\\\program files*\", \"*route add*\")) and
    not (process.name : \"netsh.exe\" and process.command_line : (\"*add portopening*\", \"*rule name*\")) and
    not (process.name : \"regsvr32.exe\" and process.command_line : \"*PrintConfig.dll*\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
