ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"

ANPrule:
- author: ["Elastic"]

- description: "Identifies use of WinRar or 7z to create an encrypted files. Adversaries will often compress and encrypt data in preparation for exfiltration."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.welivesecurity.com/2020/12/02/turla-crutch-keeping-back-door-open/"]

- risk_score: 47

- rule_id: "45d273fb-1dca-457d-9855-bcb302180c21"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Collection"]

- type: "eql"


- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1560",
        name : "Archive Collected Data",
        reference : "https://attack.mitre.org/techniques/T1560/"],
      tactic: [
        id : "TA0009",
        name : "Collection",
        reference : "https://attack.mitre.org/tactics/TA0009/"]
      ]
  ]

name: Encrypting Files with WinRar or 7z
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
num_events: 1
type: frequency
timeframe:
  hours: 1

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  ((process.name:\"rar.exe\" or process.code_signature.subject_name == \"win.rar GmbH\" or\n      process.pe.original_file_name == \"Command line RAR\") and\n    process.args == \"a\" and process.args : (\"-hp*\", \"-p*\", \"-dw\", \"-tb\", \"-ta\", \"/hp*\", \"/p*\", \"/dw\", \"/tb\", \"/ta\"))  or\n  (process.pe.original_file_name in (\"7z.exe\", \"7za.exe\") and\n     process.args == \"a\" and process.args : (\"-p*\", \"-sdel\"))  /* uncomment if noisy for backup software related FPs */  /* not process.parent.executable : (\"C:\\\\Program Files\\\\*.exe\", \"C:\\\\Program Files (x86)\\\\*.exe\") */"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
