ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies built-in Windows script interpreters (cscript.exe or wscript.exe) being used to download an executable file from a remote destination."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "1d276579-3380-4095-ad38-e596a01bc64f"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1105c",
        name : "Ingress Tool Transfer",
        reference : "https://attack.mitre.org/techniques/T1105c/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]]]

name: Remote File Download via Script Interpreter
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: frequency
num_events: 1
timeframe:
  hours: 1
  
eql:
  "query": "sequence by host.id, process.entity_id\n
    [network where process.name : (\"wscript.exe\", \"cscript.exe\") and network.protocol != \"dns\" and\n
    network.direction == \"outgoing\" and network.type == \"ipv4\" and destination.ip != \"127.0.0.1\"]\n
    [file where event.type == \"creation\" and file.extension : (\"exe\", \"dll\")]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
