ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies instances of Internet Explorer (iexplore.exe) being started via the Component Object Model (COM) making unusual network connections. Adversaries could abuse Internet Explorer via COM to avoid suspicious processes making network connections and bypass host-based firewall restrictions."

- false_positives: ["Processes such as MS Office using IEproxy to render HTML content."]

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "acd611f3-2b93-47b3-a0a3-7723bcc46f6d"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1071",
        name : "Application Layer Protocol",
        reference : "https://attack.mitre.org/techniques/T1071/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]]]

name: Potential Command and Control via Internet Explorer
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "sequence by host.id, user.id with maxspan = 5s [library where
    dll.name : \"IEProxy.dll\" and process.name : (\"rundll32.exe\",
    \"regsvr32.exe\")] [process where event.type == \"start\" and
    process.parent.name : \"iexplore.exe\" and process.parent.args :
    \"-Embedding\"] /* IE started via COM in normal conditions makes few
    connections, mainly to Microsoft and OCSP related domains, add FPs
    here */ [network where network.protocol == \"dns\" and process.name :
    \"iexplore.exe\" and not dns.question.name : (
    \"*.microsoft.com\", \"*.digicert.com\", \"*.msocsp.com\",
    \"*.windowsupdate.com\", \"*.bing.com\", \"*.identrust.com\",
    \"*.sharepoint.com\", \"*.office365.com\", \"*.office.com\" )
    ]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
