ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the desktopimgdownldr utility being used to download a remote file. An adversary may use desktopimgdownldr to download arbitrary files as an alternative to certutil."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/"]

- risk_score: 47

- rule_id: "15c0b7a7-9c34-4869-b25b-fa6518414899"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1105",
        name : "Ingress Tool Transfer",
        reference : "https://attack.mitre.org/techniques/T1105/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]]]

name: Remote File Download via Desktopimgdownldr Utility
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n(process.name : \"desktopimgdownldr.exe\" or process.pe.original_file_name == \"desktopimgdownldr.exe\") and\nprocess.args : \"/lockscreenurl:http*\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
