ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the password log file from the default Mimikatz memssp module."

# - false_positives: ["HTTP traffic on a non standard port. Verify that the destination IP address is not related to a Domain Controller."]

- language: "eql"

- license: "Elastic License v2"

# - references: ["https://github.com/outflanknl/Dumpert", "https://github.com/hoangprod/AndrewSpecial"]

- risk_score: 73

# - max_signals: 33

- rule_id: "ebb200e8-adf0-43f8-a0bb-4ee5b5d852c6"

# - note: """## Triage and analysis Domain DPAPI Backup keys are stored on domain controllers and can be dumped remotely with tools such as Mimikatz. The resulting .pvk private key can be used to decrypt ANY domain user masterkeys, which then can be used to decrypt any secrets protected by those keys."""

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: Mimikatz Memssp Log File Detected
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: any

eql:
  "query": "file where file.name : \"mimilsa.log\" and process.name : \"lsass.exe\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
