ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Adversaries may register a rogue network logon provider module for persistence and/or credential access via intercepting the authentication credentials in clear text during user logon."

- false_positives: ["Authorized third party network logon providers."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy", "https://docs.microsoft.com/en-us/windows/win32/api/npapi/nf-npapi-nplogonnotify"]

- risk_score: 47

- rule_id: "54c3d186-0461-4dc3-9b33-2dc5c7473936"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1556",
        name : "Modify Authentication Process",
        reference : "https://attack.mitre.org/techniques/T1556/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1543",
        name : "Create or Modify System Process",
        reference : "https://attack.mitre.org/techniques/T1543/"
        
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: Network Logon Provider Registry Modification
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any

eql:
 "query": "registry where registry.data.strings != null and\n    registry.path : \"HKLM\\\\SYSTEM\\\\*ControlSet*\\\\Services\\\\*\\\\NetworkProvider\\\\ProviderPath\" and\n    /* Excluding default NetworkProviders RDPNP, LanmanWorkstation and webclient. */    not ( user.id : \"S-1-5-18\" and\n          registry.data.strings in                    (\"%SystemRoot%\\\\System32\\\\ntlanman.dll\",                    \"%SystemRoot%\\\\System32\\\\drprov.dll\",                    \"%SystemRoot%\\\\System32\\\\davclnt.dll\")          )"
  

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
