ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies attempts to export a registry hive which may contain credentials using the Windows reg.exe tool."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://medium.com/threatpunter/detecting-attempts-to-steal-passwords-from-the-registry-7512674487f8"]

- risk_score: 73

- rule_id: "a7e7bfa3-088e-4f13-b29e-3986e0e756b8"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]


name: Credential Acquisition via Registry Hive Dumping
index: .ds-winlogbeat-8.0.0-2022.02.19-000001


type: any

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n
    process.pe.original_file_name == \"reg.exe\" and\n
    process.args : (\"save\", \"export\") and\n
    process.args : (\"hklm\\\\sam\", \"hklm\\\\security\")"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
