ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies MsBuild.exe making outbound network connections. This may indicate adversarial activity as MsBuild is often leveraged by adversaries to execute code and evade detection."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "0e79980b-4250-4a50-a509-69294c14e84b"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1127",
        name : "Trusted Developer Utilities Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1127/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "MsBuild Making Network Connections"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by process.entity_id
    [process where process.name : \"MSBuild.exe\" and event.type == \"start\"]
    [network where process.name : \"MSBuild.exe\" and
      not cidrmatch(destination.ip, \"127.0.0.1\", \"::1\")]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
