ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies when a script interpreter or signed binary is launched via a non-standard working directory. An attacker may
    use this technique to evade defenses."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Verify process details such as command line and hash to confirm this activity legitimacy."

- references: ["https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/", "https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/"]

- risk_score: 47

- rule_id: "8a1d4831-3ce6-4859-9891-28931fa6101d"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"


- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/",
        subtechnique: [
          [id : "T1218.011",        
          name : "Rundll32",        
          reference : "https://attack.mitre.org/techniques/T1218/011/"],
          [id : "T1218.005",        
          name : "Mshta",        
          reference : "https://attack.mitre.org/techniques/T1218/005/"],
          [id : "T1218.010",        
          name : "Regsvr32",        
          reference : "https://attack.mitre.org/techniques/T1218/010/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1059",
        name : "Command and Scripting Interpreter",
        reference : "https://attack.mitre.org/techniques/T1059/",
        subtechnique: [
          [id : "T1059.001",        
          name : "Compromise Software Supply Chain",        
          reference : "https://attack.mitre.org/techniques/T1059/001/"]
        ]
      ],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]]]


name: "Suspicious Execution from a Mounted Device"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type == \"start\" and process.executable : \"C:\\\\*\" and
    (process.working_directory : \"?:\\\\\" and not process.working_directory: \"C:\\\\\") and
    process.parent.name : \"explorer.exe\" and
    process.name : (\"rundll32.exe\", \"mshta.exe\", \"powershell.exe\", \"pwsh.exe\", \"cmd.exe\", \"regsvr32.exe\",
                    \"cscript.exe\", \"wscript.exe\")"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
