ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Jscript tries to query the AmsiEnable registry key from the HKEY_USERS registry hive before initializing Antimalware Scan Interface (AMSI). If this key is set to 0, AMSI is not enabled for the Jscript process. An adversary can modify this key to disable AMSI protections."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://hackinparis.com/data/slides/2019/talks/HIP2019-Dominic_Chell-Cracking_The_Perimeter_With_Sharpshooter.pdf", "https://docs.microsoft.com/en-us/windows/win32/amsi/antimalware-scan-interface-portal"]

- risk_score: 73

- rule_id: "f874315d-5188-4b4a-8521-d1c73093a7e4"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1562",
        name : "Impair Defenses",
        reference : "https://attack.mitre.org/techniques/T1562/",
        subtechnique: [
          [id : "T1562.001",        
          name : "Disable or Modify Tools",        
          reference : "https://attack.mitre.org/techniques/T1562/001/"],
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]

name: "Modification of AmsiEnable Registry Key"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "registry where event.type in (\"creation\", \"change\") and    registry.path : \"HKEY_USERS\\\\Software\\\\Microsoft\\\\Windows Script\\\\Settings\\\\AmsiEnable\" and    registry.data.strings: \"0\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
