ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "A suspicious WerFault child process was detected, which may indicate an attempt to run unnoticed. Verify process details such as command line, network connections, file writes and parent process details as well."

- false_positives: ["Custom Windows error reporting debugger or applications restarted by WerFault after a crash."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.hexacorn.com/blog/2019/09/19/silentprocessexit-quick-look-under-the-hood/", "https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Persistence/persistence_SilentProcessExit_ImageHijack_sysmon_13_1.evtx", "https://blog.menasec.net/2021/01/"]

- risk_score: 47

- rule_id: "ac5012b8-8da8-440b-aaaf-aedafdea2dff"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1036",
        name : "Masquerading",
        reference : "https://attack.mitre.org/techniques/T1036/"
      ],

      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]


name: "Suspicious WerFault Child Process"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    process.parent.name : \"WerFault.exe\" and
    not process.name : (\"cofire.exe\",
                        \"psr.exe\",
                        \"VsJITDebugger.exe\",
                        \"TTTracer.exe\",
                        \"rundll32.exe\",
                        \"LogiOptionsMgr.exe\") and
    not process.args : (\"/LOADSAVEDWINDOWS\",
                        \"/restore\",
                        \"RestartByRestartManager*\",
                        \"--restarted\",
                        \"createdump\",
                        \"dontsend\",
                        \"/watson\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
