ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies use of wmic.exe for shadow copy deletion on endpoints. This commonly occurs in tandem with ransomware or
    other destructive attacks."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 73

- rule_id: "dc9c1f74-dac3-48e3-b47f-eb79db358f57"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1070",
        name : "Indicator Removal on Host",
        reference : "https://attack.mitre.org/techniques/T1070/",
        subtechnique: [
          [id : "T1070.004",        
          name : "File Deletion",        
          reference : "https://attack.mitre.org/techniques/T1070/004/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]


name: "Volume Shadow Copy Deletion via WMIC"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    (process.name : \"WMIC.exe\" or process.pe.original_file_name == \"wmic.exe\") and
    process.args : \"delete\" and process.args : \"shadowcopy\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
