ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies WMIC whitelisting bypass techniques by alerting on suspicious execution of scripts. When WMIC loads scripting
    libraries it may be indicative of a whitelist bypass."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Verify process details such as command line and hash to confirm this activity legitimacy."

- references: ["https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html"]

- risk_score: 21

- rule_id: "7f370d54-c0eb-4270-ac5a-9a6020585dc6"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1220",
        name : "XSL Script Processing",
        reference : "https://attack.mitre.org/techniques/T1220/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Suspicious WMIC XSL Script Execution"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by process.entity_id with maxspan = 2m
    [process where event.type in (\"start\", \"process_started\") and
      (process.name : \"WMIC.exe\" or process.pe.original_file_name : \"wmic.exe\") and
      process.args : (\"format*:*\", \"/format*:*\", \"*-format*:*\") and
      not process.command_line : \"* /format:table *\"]
    [library where event.type == \"start\" and dll.name : (\"jscript.dll\", \"vbscript.dll\")]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
