ANPdata:
- creation_date = "2021/8/4"
- maturity = "production"
- updated_date = "2021/8/4"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a process termination event quickly followed by the deletion of its executable file. Malware tools and other non-native files dropped or created on a system by an adversary may leave traces to indicate to what occurred. Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "09443c92-46b3-45a4-8f25-383b028b258d"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1070",
        name : "Indicator Removal on Host",
        reference : "https://attack.mitre.org/techniques/T1070/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Process Termination followed by Deletion"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by host.id with maxspan=5s
    [process where event.type == \"end\" and 
      process.code_signature.trusted == false and
      not process.executable : (\"C:\\\\Windows\\\\SoftwareDistribution\\\\*.exe\", \"C:\\\\Windows\\\\WinSxS\\\\*.exe\")
    ] by process.executable
    [file where event.type == \"deletion\" and file.extension : (\"exe\", \"scr\", \"com\")] by file.path"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
