ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Compiled HTML files (.chm) are commonly distributed as part of the Microsoft HTML Help system. Adversaries may conceal
    malicious code in a CHM file and deliver it to a victim for execution. CHM content is loaded by the HTML Help executable
    program (hh.exe)."

# - false_positives: ["Microsoft Windows installers leveraging RunDLL32 for installation."]

# - interval: "30m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     This is related to the `Process Execution from an Unusual Directory rule`."""

- references: ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

# - max_signals: 33

- risk_score: 21

- rule_id: "b29ee2be-bf99-446c-ab1a-2dc0183394b8"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/",
        subtechnique: [
          [id : "T1218.001",        
          name : "Compiled HTML File",        
          reference : "https://attack.mitre.org/techniques/T1218/001/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]

name: "Network Connection via Compiled HTML File"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: any
eql:
  "query": "sequence by process.entity_id
    [process where process.name : \"hh.exe\" and event.type == \"start\"]
    [network where process.name : \"hh.exe\" and
      not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",
        \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\",
        \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\",
        \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\",
        \"FE80::/10\", \"FF00::/8\")]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
