ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies remote execution via Windows Remote Management (WinRM) remote shell on a target host. This could be an
    indication of lateral movement."

- false_positives:  ["WinRM is a dual-use protocol that can be used for benign or malicious activity. It's important to baseline your
    environment to determine the amount of noise to expect from this tool."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Investigating Large DNS ResponsesDetection alerts from this rule indicate an attempt was made to exploit CVE-2020-1350 (SigRed) through the use of large DNS responses on a Windows DNS server. Here are some possible avenues of investigation - Investigate any corresponding Intrusion Detection Signatures (IDS) alerts that can validate this detection alert.- Examine the `dns.question_type` network fieldset with a protocol analyzer, such as Zeek, Packetbeat, or Suricata, for `SIG` or `RRSIG` data.- Validate the patch level and OS of the targeted DNS server to validate the observed activity was not large-scale Internet vulnerability scanning.- Validate that the source of the network activity was not from an authorized vulnerability scan or compromise assessment."""

# - references: ["https://blog.menasec.net/2020/08/new-trick-to-detect-lateral-movement.html"]

# - max_signals: 33

- risk_score: 47

- rule_id: "1cd01db9-be24-4bef-8e7c-e923f0ff78ab"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/"
      ],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]
    ]
  ]

name: "Incoming Execution via WinRM Remote Shell"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001

type: any
eql:
  "query": "sequence by host.id with maxspan=30s   [network where process.pid == 4 and network.direction == \"incoming\" and    destination.port in (5985, 5986) and network.protocol == \"http\" and source.ip != \"::1\" and source.ip !=\"127.0.0.1\"   ]   [process where event.type == \"start\" and process.parent.name : \"winrshost.exe\" and not process.name : \"conhost.exe\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
