ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies potential behavior of SharpRDP, which is a tool that can be used to perform authenticated command execution
    against a remote target via Remote Desktop Protocol (RDP) for the purposes of lateral movement."

# - false_positives:  ["""PowerShell remoting is a dual-use protocol that can be used for benign or malicious activity. It's important to
    # baseline your environment to determine the amount of noise to expect from this tool."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Investigating Large DNS ResponsesDetection alerts from this rule indicate an attempt was made to exploit CVE-2020-1350 (SigRed) through the use of large DNS responses on a Windows DNS server. Here are some possible avenues of investigation - Investigate any corresponding Intrusion Detection Signatures (IDS) alerts that can validate this detection alert.- Examine the `dns.question_type` network fieldset with a protocol analyzer, such as Zeek, Packetbeat, or Suricata, for `SIG` or `RRSIG` data.- Validate the patch level and OS of the targeted DNS server to validate the observed activity was not large-scale Internet vulnerability scanning.- Validate that the source of the network activity was not from an authorized vulnerability scan or compromise assessment."""

- references: ["https://posts.specterops.io/revisiting-remote-desktop-lateral-movement-8fb905cb46c3", "https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Lateral%20Movement/LM_sysmon_3_12_13_1_SharpRDP.evtx"]

# - max_signals: 33

- risk_score: 73

- rule_id: "8c81e506-6e82-4884-9b9a-75d3d252f967"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/"
      ],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]
    ]
  ]
  
name: "Potential SharpRDP Behavior"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "/* Incoming RDP followed by a new RunMRU string value set to cmd, powershell, taskmgr or tsclient, followed by process execution within 1m */
    sequence by host.id with maxspan=1m
      [network where event.type == \"start\" and process.name : \"svchost.exe\" and destination.port == 3389 and 
      network.direction == \"incoming\" and network.transport == \"tcp\" and
      source.ip != \"127.0.0.1\" and source.ip != \"::1\"
      ]
      [registry where process.name : \"explorer.exe\" and 
      registry.path : (\"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\RunMRU\\\\*\") and
      registry.data.strings : (\"cmd.exe*\", \"powershell.exe*\", \"taskmgr*\", \"\\\\tsclient\\\\*.exe\\\\*\")
      ]
      
      [process where event.type in (\"start\", \"process_started\") and
      (process.parent.name : (\"cmd.exe\", \"powershell.exe\", \"taskmgr.exe\") or process.args : (\"\\\\tsclient\\\\*.exe\")) and 
      not process.name : \"conhost.exe\"
      ]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
