ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies remote scheduled task creations on a target host. This could be indicative of adversary lateral movement."

# - false_positives:  ["""PowerShell remoting is a dual-use protocol that can be used for benign or malicious activity. It's important to
    # baseline your environment to determine the amount of noise to expect from this tool."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Decode the base64 encoded tasks actions registry value to investigate the task configured action."

# - references: ["https://blog.netspi.com/how-to-access-rdp-over-a-reverse-ssh-tunnel/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "954ee7c8-5437-49ae-b2d6-2960883898e9"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/"
      ],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]
    ],
    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1053",
        name : "Scheduled Task/Job",
        reference : "https://attack.mitre.org/techniques/T1053/"
      ],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]
    ]
  ]
  
name: "Remote Scheduled Task Creation"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "/* Task Scheduler service incoming connection followed by TaskCache registry modification  */
    sequence by host.id, process.entity_id with maxspan = 1m
      [network where process.name : \"svchost.exe\" and
      network.direction == \"incoming\" and source.port >= 49152 and destination.port >= 49152 and
      source.ip != \"127.0.0.1\" and source.ip != \"::1\"
      ]
      [registry where registry.path : \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tasks\\\\*\\\\Actions\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
