ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "A scheduled task was created by a Windows script via cscript.exe, wscript.exe or powershell.exe. This can be abused by
    an adversary to establish persistence."

- false_positives:  ["Legitimate scheduled tasks may be created during installation of new software."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."

# - references: ["https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "689b9d57-e4d5-4357-ad17-9c334609d79a"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1053",
        name : "Scheduled Task/Job",
        reference : "https://attack.mitre.org/techniques/T1053/"
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Scheduled Task Created by a Windows Script"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "sequence by host.id with maxspan = 30s
    [library where dll.name : \"taskschd.dll\" and process.name : (\"cscript.exe\", \"wscript.exe\", \"powershell.exe\")]
    [registry where registry.path : \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tasks\\\\*\\\\Actions\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
