ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
- updated_date = "2021/8/11"

ANPrule:
- author: ["Elastic"]

- description: "Identifies attempts to create new local users. This is sometimes done by attackers to increase access to a system or
    domain."

- false_positives:  ["Legitimate local user creations may be done by a system or network administrator. Verify whether this is known
    behavior in your environment. Local user creations from unfamiliar users or hosts should be investigated. If known
    behavior is causing false positives, it can be exempted from the rule."]

- language: "kuery"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "38e17753-f581-4644-84da-0d60a8318694"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "query"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1136",
        name : "Create Account",
        reference : "https://attack.mitre.org/techniques/T1136/"],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]],
    
  ]
name: Creation of a local user account
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any

kql:
  "query": {"query_string": {"query": "event.module:security and event.code:4720" }  }

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
