ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies potential hijacking of the Microsoft Update Orchestrator Service to establish persistence with an integrity
    level of SYSTEM."

# - false_positives:  ["""Legitimate local user creations may be done by a system or network administrator. Verify whether this is known
    # behavior in your environment. Local user creations from unfamiliar users or hosts should be investigated. If known
    # behavior is causing false positives, it can be exempted from the rule."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://github.com/irsl/CVE-2020-1313"]

# - max_signals: 33

- risk_score: 73

- rule_id: "265db8f5-fc73-4d0d-b434-6483b56372e2"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1543",
        name : "Create or Modify System Process",
        reference : "https://attack.mitre.org/techniques/T1543/",
        subtechnique: [
          [id : "T1543.003",        
          name : "Windows Service",        
          reference : "https://attack.mitre.org/techniques/T1543/003/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Persistence via Update Orchestrator Service Hijack"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type == \"start\" and
    process.parent.executable : \"C:\\\\Windows\\\\System32\\\\svchost.exe\" and
    process.parent.args : \"UsoSvc\" and
    not process.executable :
          (
            \"C:\\\\Windows\\\\System32\\\\UsoClient.exe\",
            \"C:\\\\Windows\\\\System32\\\\MusNotification.exe\",
            \"C:\\\\Windows\\\\System32\\\\MusNotificationUx.exe\",
            \"C:\\\\Windows\\\\System32\\\\MusNotifyIcon.exe\",
            \"C:\\\\Windows\\\\System32\\\\WerFault.exe\",
            \"C:\\\\Windows\\\\System32\\\\WerMgr.exe\"
            )"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
