ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Windows services typically run as SYSTEM and can be used as a privilege escalation opportunity. Malware or penetration
    testers may run a shell as a service to gain SYSTEM permissions."

# - false_positives:  ["""Legitimate scheduled tasks running third party software."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

# - references: ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16", "https://www.clearskysec.com/wp-content/uploads/2020/10/Operation-Quicksand.pdf"]

# - max_signals: 33

- risk_score: 47

- rule_id: "0022d47d-39c7-4f69-a232-4fe9dc7a3acd"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1543",
        name : "Create or Modify System Process",
        reference : "https://attack.mitre.org/techniques/T1543/",
        subtechnique: [
          [id : "T1543.003",        
          name : "Windows Service",        
          reference : "https://attack.mitre.org/techniques/T1543/003/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "System Shells via Services"
index: .ds-winlogbeat-8.0.0-2022.02.19-000001
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    process.parent.name : \"services.exe\" and
    process.name : (\"cmd.exe\", \"powershell.exe\") and
    
    /* Third party FP's */
    not process.args : \"NVDisplay.ContainerLocalSystem\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
