ANPdata:
- creation_date = "2021/07/27"
- maturity = "production"
- updated_date = "2021/07/27"

ANPrule:
- author = ["Elastic"]

- description = """
    Identifies the deletion of WebServer access logs. This may indicate an attempt to evade detection or destroy forensic
    evidence on a system."""

- language = "eql"

- license = "Elastic License v2"

- risk_score = 47

- rule_id = "665e7a4f-c58e-4fc6-bc83-87a7572670ac"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Windows", "macOS", "Threat Detection", "Defense Evasion"]

- type = "eql"

name: "Potential Cookies Theft via Browser Debugging"

index: ["auditbeat-*", "winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]

type: any

eql:
  "query": "file where event.type == \"deletion\" and\n  file.path : (\"C:\\inetpub\\logs\\LogFiles\\*.log\",\"/var/log/apache*/access.log\",\"/etc/httpd/logs/access_log\",\"/var/log/httpd/access_log\",\"/var/www/*/logs/access.log\")"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1070"
      - name = "Indicator Removal on Host"
      - reference = "https://attack.mitre.org/techniques/T1070/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
