ANPdata:
- creation_date = "2021/07/27"
- maturity = "production"
- updated_date = "2021/07/27"

ANPrule:
- author = ["Elastic"]

- description = """
    Timestomping is an anti-forensics technique which is used to modify the timestamps of a file, often to mimic files that
    are in the same folder."""

- language = "eql"

- license = "Elastic License v2"

- max_signals = 33

- risk_score = 47

- rule_id = "b0046934-486e-462f-9487-0d4cf9e429c6"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "macOS", "Threat Detection", "Defense Evasion"]

- type = "eql"

name: "Timestomping using Touch Command"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type == \"start\" and\n process.name : \"touch\" and user.id != \"0\" and\n process.args : (\"-r\", \"-t\", \"-a*\",\"-m*\") and\n not process.args : (\"/usr/lib/go-*/bin/go\", \"/usr/lib/dracut/dracut-functions.sh\", \"/tmp/KSInstallAction.*/m/.patch/*\")"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1070"
      - name = "Indicator Removal on Host"
      - reference = "https://attack.mitre.org/techniques/T1070/"
      - subtechnique:
        - id = "T1070.006"
        - name = "Timestomp"
        - reference = "https://attack.mitre.org/techniques/T1070/006/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
