ANPdata:
- creation_date = "2021/07/27"
- maturity = "production"
- updated_date = "2021/07/27"
- min_stack_version = "7.14.0"

ANPrule:
- author = ["Elastic"]

- description = """
    Detects events which have a mismatch on the expected event agent ID. The status "agent_id_mismatch"
    occurs when the expected agent ID associated with the API key does not match the actual agent ID in an event. This could
    indicate attempts to spoof events in order to masquerade actual activity to evade detection."""

- false_positives = ["This is meant to run only on datasources using agents v7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."]

- language = "kuery"

- license = "Elastic License v2"

- risk_score = 73

- rule_id = "493834ca-f861-414c-8602-150d5505b777"

- severity = "high"

- tags = ["Elastic", "Threat Detection", "Defense Evasion"]

- type = "query"

name: "Agent Spoofing - Mismatched Agent ID"

index: ["logs-*", "metrics-*", "traces-*"]

type: any

kql:
  "query": {"query_string": {"query": "event.agent_id_status:*" }}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1036"
      - name = "Masquerading"
      - reference = "https://attack.mitre.org/techniques/T1036/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"


[rule.threshold]
field = ["agent.id"]
value = 2

[[rule.threshold.cardinality]]
field = "host.id"
value = 2
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
