ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule:
- author = ["Elastic"]

- description = """
    Identifies the execution of a shell process with suspicious arguments which may be indicative of reverse shell activity."""

- language = "eql"

- license = "Elastic License v2"

- references = ["https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md","https://github.com/WangYihang/Reverse-Shell-Manager","https://www.netsparker.com/blog/web-security/understanding-reverse-shells/"]

- risk_score = 73

- rule_id = "a1a0375f-22c2-48c0-81a4-7c2d11cc6856"

- severity = "high"

- tags = ["Elastic", "Host", "Linux", "macOS", "Threat Detection", "Execution"]

- type = "eql"

name: "Potential Reverse Shell Activity via Terminal"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.name in (\"sh\", \"bash\", \"zsh\", \"dash\", \"zmodload\") and\n  process.args:(\"*/dev/tcp/*\", \"*/dev/udp/*\", \"zsh/net/tcp\", \"zsh/net/udp\")"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
    - tactic:
      - id = "TA0002"
      - name = "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
