ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule:
- author = ["Elastic"]

- description = """
    Identifies suspicious child processes of a Java Archive (JAR) file. JAR files may be used to deliver malware in order to
    evade detection."""

- language = "eql"

- license = "Elastic License v2"

- risk_score = 47

- rule_id = "8acb7614-1d92-4359-bfcf-478b6d9de150"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "macOS", "Threat Detection", "Execution"]

- type = "eql"

name: "Suspicious JAR Child Process"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.parent.name : \"java\" and\n  process.name : (\"sh\", \"bash\", \"dash\", \"ksh\", \"tcsh\", \"zsh\", \"curl\", \"wget\") and\n  process.args : \"-jar\" and process.args : \"*.jar\" and\n  /* Add any FP's here */\n  not process.executable : (\"/Users/*/.sdkman/*\", \"/Library/Java/JavaVirtualMachines/*\") and\n not process.args : (\"/usr/local/*\", \"/Users/*/github.com/*\", \"/Users/*/src/*\")"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
      - subtechnique:
        - id = "T1059.007"
        - name = "JavaScript/JScript"
        - reference = "https://attack.mitre.org/techniques/T1059/007/"
    - tactic:
      - id = "TA0002"
      - name = "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
