ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule:
- author = ["Elastic"]

- description = """
    Both ~/.bash_profile and ~/.bashrc are files containing shell commands that are run when Bash is invoked. These files
    are executed in a user's context, either interactively or non-interactively, when a user logs in so that their
    environment is set correctly. Adversaries may abuse this to establish persistence by executing malicious content
    triggered by a user’s shell."""

- false_positives = ["Changes to the Shell Profile tend to be noisy, a tuning per your environment will be required."]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://www.anomali.com/blog/pulling-linux-rabbit-rabbot-malware-out-of-a-hat"]

- risk_score = 47

- rule_id = "e6c1a552-7776-44ad-ae0f-8746cc07773c"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Linux", "Threat Detection", "Persistence"]

- type = "query"

name: "Bash Shell Profile Modification"

index: ["logs-endpoint.events.*", "auditbeat-*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:file and event.type:change and\n  process.name:(* and not (\"sudo\" or\n                           \"vim\" or\n                           \"zsh\" or\n                           \"env\" or\n                           \"nano\" or\n                           \"bash\" or\n                           \"Terminal\" or\n                           \"xpcproxy\" or\n                           \"login\" or\n                           \"cat\" or\n                           \"cp\" or\n                           \"launchctl\" or\n                           \"java\")) and\n  not process.executable:(\"/Applications/*\" or \"/private/var/folders/*\" or \"/usr/local/*\") and\n  file.path:(\"/private/etc/rc.local\" or\n             \"/etc/rc.local\" or\n             \"/home/*/.profile\" or\n             \"/home/*/.profile1\" or\n             \"/home/*/.bash_profile\" or\n             \"/home/*/.bash_profile1\" or\n             \"/home/*/.bashrc\" or\n             \"/Users/*/.bash_profile\" or\n             \"/Users/*/.zshenv\")"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1546"
      - name = "Event Triggered Execution"
      - reference = "https://attack.mitre.org/techniques/T1546/"
      - subtechnique: 
        - id = "T1546.004"
        - name = ".bash_profile and .bashrc"
        - reference = "https://attack.mitre.org/techniques/T1546/004/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
