ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule:
- author = ["Elastic"]

- description = """
    An adversary may add the setuid or setgid bit to a file or directory in order to run a file with the privileges of the
    owning user or group. An adversary can take advantage of this to either do a shell escape or exploit a vulnerability in
    an application with the setuid or setgid bit to get code running in a different user’s context. Additionally,
    adversaries can use this mechanism on their own malware to make sure they're able to execute in elevated contexts in the
    future."""

- language = "lucene"

- license = "Elastic License v2"

- max_signals = 33

- risk_score = 21

- rule_id = "8a1b0278-0f9a-487d-96bd-d4833298e87a"

- severity = "low"

- tags = ["Elastic", "Host", "Linux", "macOS", "Threat Detection", "Privilege Escalation"]

- type = "query"

name: "Setuid / Setgid Bit Set via chmod"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n process.name:chmod and process.args:(\"+s\" or \"u+s\" or /4[0-9]{3}/ or g+s or /2[0-9]{3}/) and\n NOT process.args:           (             /.*\\/Applications\\/VirtualBox.app\\/.+/ or\n             /\\/usr\\/local\\/lib\\/python.+/ or\n             /\\/var\\/folders\\/.+\\/FP.*nstallHelper/ or\n             /\\/Library\\/Filesystems\\/.+/ or\n             /\\/usr\\/lib\\/virtualbox\\/.+/ or\n             /\\/Library\\/Application.*/ or\n             \"/run/postgresql\" or\n             \"/var/crash\" or\n             \"/var/run/postgresql\" or\n             /\\/usr\\/bin\\/.+/ or /\\/usr\\/local\\/share\\/.+/ or\n             /\\/Applications\\/.+/ or /\\/usr\\/libexec\\/.+/ or\n             \"/var/metrics\" or /\\/var\\/lib\\/dpkg\\/.+/ or\n             /\\/run\\/log\\/journal\\/.*/ or\n             \\/Users\\/*\\/.minikube\\/bin\\/docker-machine-driver-hyperkit           ) and\n NOT process.parent.executable:           (             /\\/var\\/lib\\/docker\\/.+/ or\n             \"/System/Library/PrivateFrameworks/PackageKit.framework/Versions/A/XPCServices/package_script_service.xpc/Contents/MacOS/package_script_service\" or\n             \"/var/lib/dpkg/info/whoopsie.postinst\"           )"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1548"
      - name = "Abuse Elevation Control Mechanism"
      - reference = "https://attack.mitre.org/techniques/T1548/"
      - subtechnique: 
        - id = "T1548.001"
        - name = "Setuid and Setgid"
        - reference = "https://attack.mitre.org/techniques/T1548/001/"
    - tactic:
      - id = "TA0004"
      - name = Privilege Escalation"
      - reference = "https://attack.mitre.org/tactics/TA0004/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
