ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule:
- author = ["Elastic"]

- description = """
    A sudoers file specifies the commands that users or groups can run and from which terminals. Adversaries can take
    advantage of these configurations to execute commands as other users or spawn processes with higher privileges."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://cve.mitre.org/cgi-bin/cvename.cgi?name=2021-3156","https://blog.qualys.com/vulnerabilities-research/2021/01/26/cve-2021-3156-heap-based-buffer-overflow-in-sudo-baron-samedit","https://www.bleepingcomputer.com/news/security/latest-macos-big-sur-also-has-sudo-root-privilege-escalation-flaw","https://www.sudo.ws/alerts/unescape_overflow.html"]

- risk_score = 73

- rule_id = "931e25a5-0f5e-4ae0-ba0d-9e94eff7e3a4"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "macOS", "Threat Detection", "Privilege Escalation"]

- type = "query"

name: "Sudoers File Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:file and event.type:change and file.path:(\"/etc/sudoers*\" or \"/private/etc/sudoers*\")"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1548"
      - name = "Abuse Elevation Control Mechanismn"
      - reference = "https://attack.mitre.org/techniques/T1548/"
      - subtechnique:
        - id = "T1548.003"
        - name = "Sudo and Sudo Caching"
        - reference = "https://attack.mitre.org/techniques/T1548/003/"
    - tactic:
      - id = "TA0004"
      - name = Privilege Escalation"
      - reference = "https://attack.mitre.org/tactics/TA0004/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
