ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"

ANPrule:
- author : ["Elastic"]

- description: "Identifies the use of the Exchange PowerShell cmdlet, Set-CASMailbox, to add a new ActiveSync allowed device. Adversaries may target user email to collect sensitive information."

- false_positives: ["Legitimate exchange system administration activity."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/", "https://docs.microsoft.com/en-us/powershell/module/exchange/set-casmailbox?view=exchange-ps"]

- risk_score: 47

- rule_id: "ce64d965-6cb0-466d-b74f-8d2c76f47f05"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Collection"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1114",
        name : "Email Collection",
        reference : "https://attack.mitre.org/techniques/T1114/"],
      tactic: [
        id : "TA0009",
        name : "Collection",
        reference : "https://attack.mitre.org/tactics/TA0009/"]
    ]

  ]

name: New ActiveSyncAllowedDeviceID Added via PowerShell
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.name: (\"powershell.exe\", \"pwsh.exe\") and process.args : \"Set-CASMailbox*ActiveSyncAllowedDeviceIDs*\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
