ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"

ANPrule:
- author: ["Elastic"]

- description: "Identifies the use of the Exchange PowerShell cmdlet, New-MailBoxExportRequest, to export the contents of a primary mailbox or archive to a .pst file. Adversaries may target user email to collect sensitive information."

- false_positives: ["Legitimate exchange system administration activity."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/", "https://docs.microsoft.com/en-us/powershell/module/exchange/new-mailboxexportrequest?view=exchange-ps"]

- risk_score: 47

- rule_id: "6aace640-e631-4870-ba8e-5fdda09325db"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Collection"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1114",
        name : "Email Collection",
        reference : "https://attack.mitre.org/techniques/T1114/"],
      tactic: [
        id : "TA0009",
        name : "Collection",
        reference : "https://attack.mitre.org/tactics/TA0009/"]
    ]
  ]
name: Exporting Exchange Mailbox via PowerShell
index: anp-log-agentbase-winclient
type: frequency
num_events: 1
timeframe:
  hours: 1
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n process.name: (\"powershell.exe\", \"pwsh.exe\") and process.args : \"New-MailboxExportRequest*\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
