ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "This rule identifies a large number (15) of nslookup.exe executions with an explicit query type from the same host. This may indicate command and control activity utilizing the DNS protocol."

# - false_positives: ["Legitimate exchange system administration activity."]

- language: "kuery"

- license: "Elastic License v2"

- references: ["https://unit42.paloaltonetworks.com/dns-tunneling-in-the-wild-overview-of-oilrigs-dns-tunneling/"]

- risk_score: 47

# - max_signals: 33

- rule_id: "3a59fc81-99d3-47ea-8cd6-d48d561fca20"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "threshold"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1071",
        name : "Application Layer Protocol",
        reference : "https://attack.mitre.org/techniques/T1071/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]]]

name: "Potential DNS Tunneling via NsLookup"
index: anp-log-agentbase-winclient-*
type: any
kql:
  "query": {"query_string": {"query": "event.category:process and event.type:start and process.name:nslookup.exe and process.args:(-querytype=* or -qt=* or -q=* or -type=*)" }  }

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
