ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "The malware known as SUNBURST targets the SolarWind's Orion business software for command and control. This rule detects post-exploitation command and control activity of the SUNBURST backdoor."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html"]

- risk_score: 73

- rule_id: "22599847-5d13-48cb-8872-5796fee8692b"

- note: "## Triage and analysis The SUNBURST malware attempts to hide within the Orion Improvement Program (OIP) network traffic. As this rule detects post-exploitation network traffic, investigations into this should be prioritized."

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1071",
        name : "Application Layer Protocol",
        reference : "https://attack.mitre.org/techniques/T1071/",
        subtechnique: [
          [id : "T1071.001",        
          name : "Web Protocols",        
          reference : "https://attack.mitre.org/techniques/T1071/001/"]
        ]
      ],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1195",
        name : "Supply Chain Compromise",
        reference : "https://attack.mitre.org/techniques/T1195/",
        subtechnique: [
          [id : "T1195.002",        
          name : "Compromise Software Supply Chain",        
          reference : "https://attack.mitre.org/techniques/T1195/002/"]

        ]
      ],
      tactic: [
        id : "TA0001",
        name : "Initial Access",
        reference : "https://attack.mitre.org/tactics/TA0001/"]
    ]
  ]
name: SUNBURST Command and Control Activity
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "network where event.type == \"protocol\" and network.protocol == \"http\" and\n
    process.name : (\"ConfigurationWizard.exe\",
                  \"NetFlowService.exe\",
                  \"NetflowDatabaseMaintenance.exe\",
                  \"SolarWinds.Administration.exe\",
                  \"SolarWinds.BusinessLayerHost.exe\",
                  \"SolarWinds.BusinessLayerHostx64.exe\",
                  \"SolarWinds.Collector.Service.exe\",
                  \"SolarwindsDiagnostics.exe\") and
    (http.request.body.content : \"*/swip/Upload.ashx*\" and http.request.body.content : (\"POST*\", \"PUT*\")) or
    (http.request.body.content : (\"*/swip/SystemDescription*\", \"*/swip/Events*\") and http.request.body.content : (\"GET*\", \"HEAD*\")) and
    not http.request.body.content : \"*solarwinds.com*\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
