ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a copy operation of the Active Directory Domain Database (ntds.dit) or Security Account Manager (SAM) files. Those files contain sensitive information including hashed domain and/or local credentials."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/"]

- risk_score: 73

- max_signals: 33

- rule_id: "3bc6deaa-fbd4-433a-ae21-3e892f95624f"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: NTDS or SAM Database File Copied
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n
    process.pe.original_file_name in (\"Cmd.Exe\", \"PowerShell.EXE\", \"XCOPY.EXE\") and\n
    process.args : (\"copy\", \"xcopy\", \"Copy-Item\", \"move\", \"cp\", \"mv\") and\n
    process.args : (\"*\\\\ntds.dit\", \"*\\\\config\\\\SAM\", \"\\\\*\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy*\\\\*\")"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
