ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the execution of known Windows utilities often abused to dump LSASS memory or the Active Directory database (NTDS.dit) in preparation for credential access."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://lolbas-project.github.io/"]

- risk_score: 73

- rule_id: "00140285-b827-4aee-aa09-8113f58a08f3"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: Potential Credential Access via Windows Utilities
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n
    /* update here with any new lolbas with dump capability */
    (process.pe.original_file_name == \"procdump\" and process.args : \"-ma\") or\n
    (process.name : \"ProcessDump.exe\" and not process.parent.executable regex~ \"\"\"C:\\Program Files( \\(x86\\))?\\Cisco Systems\\.*\"\"\") or\n
    (process.pe.original_file_name == \"WriteMiniDump.exe\" and not process.parent.executable regex~ \"\"\"C:\\Program Files( \\(x86\\))?\\Steam\\.*\"\"\") or\n
    (process.pe.original_file_name == \"RUNDLL32.EXE\" and (process.args : \"MiniDump*\" or process.command_line : \"*comsvcs.dll*#24*\")) or
    (process.pe.original_file_name == \"RdrLeakDiag.exe\" and process.args : \"/fullmemdmp\") or\n
    (process.pe.original_file_name == \"SqlDumper.exe\" and process.args : \"0x01100*\") or\n
    (process.pe.original_file_name == \"TTTracer.exe\" and process.args : \"-dumpFull\" and process.args : \"-attach\") or\n
    (process.pe.original_file_name == \"ntdsutil.exe\" and process.args : \"create*full*\") or\n
    (process.pe.original_file_name == \"diskshadow.exe\" and process.args : \"/s\")"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
