ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Identifies attempts to modify the WDigest security provider in the registry to force the user's password to be stored in clear text in memory. This behavior can be indicative of an adversary attempting to weaken the security configuration of an endpoint. Once the UseLogonCredential value is modified, the adversary may attempt to dump clear text passwords from memory."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.csoonline.com/article/3438824/how-to-detect-and-halt-credential-theft-via-windows-wdigest.html", "https://www.praetorian.com/blog/mitigating-mimikatz-wdigest-cleartext-credential-theft?edition=2019"]

- risk_score: 73

- rule_id: "d703a5af-d5b0-43bd-8ddb-7a5d500b7da5"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/",
        subtechnique: [
          [id : "T1003.001",        
          name : "LSASS Memory",        
          reference : "https://attack.mitre.org/techniques/T1003/001/"]
        ]
      ],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: Modification of WDigest Security Provider
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "registry where event.type in (\"creation\", \"change\") and\n
    registry.path:\"HKLM\\\\SYSTEM\\\\*ControlSet*\\\\Control\\\\SecurityProviders\\\\WDigest\\\\UseLogonCredential\" and\n
    registry.data.strings:\"1\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
