ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the creation or modification of Domain Backup private keys. Adversaries may extract the Data Protection API (DPAPI) domain backup key from a Domain Controller (DC) to be able to decrypt any domain user master key file."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.dsinternals.com/en/retrieving-dpapi-backup-keys-from-active-directory/", "https://www.harmj0y.net/blog/redteaming/operational-guidance-for-offensive-user-dpapi-abuse/"]

- risk_score: 73

- rule_id: "b83a7e96-2eb3-4edf-8346-427b6858d3bd"

- note: "## Triage and analysis Domain DPAPI Backup keys are stored on domain controllers and can be dumped remotely with tools such as Mimikatz. The resulting .pvk private key can be used to decrypt ANY domain user masterkeys, which then can be used to decrypt any secrets protected by those keys."

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1552",
        name : "Unsecured Credentials",
        reference : "https://attack.mitre.org/techniques/T1552/",
        subtechnique: [
          [id : "T1552.004",        
          name : "Private Keys",        
          reference : "https://attack.mitre.org/techniques/T1552/004/"]
        ]
      ],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]
    ]
  ]
name: Creation or Modification of Domain Backup DPAPI private key
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
  "query": "file where event.type != \"deletion\" and file.name : (\"ntds_capi_*.pfx\", \"ntds_capi_*.pvk\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
