ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Mimikatz is a credential dumper capable of obtaining plaintext Windows account logins and passwords, along with many other features that make it useful for testing the security of networks. This rule detects the Invoke-Mimikatz PowerShell command."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://attack.mitre.org/software/S0002/"]

- risk_score: 99

- rule_id: "ac96ceb8-4399-4191-af1d-4feeac1f1f46"

- note: "## Triage and analysis This rule identifies an adversary attempt to collect, decrypt, and/or use cached credentials. Alerts from this rule should be prioritized because an adversary has an initial foothold onto an endpoint."

- severity: "critical"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: Mimikatz Powershell Module Activity
index: anp-log-agentbase-winclient

type: frequency
num_events: 1
timeframe:
  hours: 1
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and process.name : (\"cmd.exe\", \"powershell.exe\", \"pwsh.exe\")
    and process.args : (\"*DumpCreds\", \"*Mimikatz*\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
