ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Identifies network connections to the standard Kerberos port from an unusual process. On Windows, the only process that normally performs Kerberos traffic from a domain joined host is lsass.exe."

- false_positives: ["HTTP traffic on a non standard port. Verify that the destination IP address is not related to a Domain Controller."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://blog.netspi.com/decrypting-iis-passwords-to-break-out-of-the-dmz-part-1/", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/greenbug-espionage-telco-south-asia"]

- risk_score: 47

- rule_id: "897dc6b5-b39f-432a-8d75-d3730d50c782"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1558",
        name : "Steal or Forge Kerberos Tickets",
        reference : "https://attack.mitre.org/techniques/T1558/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: Kerberos Traffic from Unusual Process
index: anp-log-agentbase-winclient
type: frequency
num_events: 1
timeframe:
  hours: 1

eql:
 "query": "network where event.type == \"start\" and network.direction == \"outgoing\" and\n    destination.port == 88 and source.port >= 49152 and\n    process.executable != \"C:\\\\Windows\\\\System32\\\\lsass.exe\" and destination.ip !=\"127.0.0.1\" and destination.ip !=\"::1\" and\n    /* insert False Positives here */    not process.name in (\"swi_fc.exe\", \"fsIPcam.exe\", \"IPCamera.exe\", \"MicrosoftEdgeCP.exe\", \"MicrosoftEdge.exe\", \"iexplore.exe\", \"chrome.exe\", \"msedge.exe\", \"opera.exe\", \"firefox.exe\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
