ANPdata:
- creation_date = "2021/8/1"
- maturity = "production"
- updated_date = "2021/8/1"
ANPrule:
- author: ["Elastic"]

- description: "An instance of MSBuild, the Microsoft Build Engine, loaded DLLs (dynamically linked libraries) responsible for Windows credential management. This technique is sometimes used for credential dumping."

- false_positives: ["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual."]

- language: "eql"

- license: "Elastic License v2"

- risk_score: 73

- rule_id: "9d110cb3-5f4b-4c9a-b9f5-53f0a1707ae5"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1003",
        name : "OS Credential Dumping",
        reference : "https://attack.mitre.org/techniques/T1003/"],
      tactic: [
        id : "TA0006",
        name : "Credential Access",
        reference : "https://attack.mitre.org/tactics/TA0006/"]]]

name: Microsoft Build Engine Loading Windows Credential Libraries
index: anp-log-agentbase-winclient

type: any

eql:
  "query": "sequence by process.entity_id\n
    [process where event.type == \"start\" and (process.name : \"MSBuild.exe\" or process.pe.original_file_name == \"MSBuild.exe\")]\n
    [library where dll.name : (\"vaultcli.dll\", \"SAMLib.DLL\")]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
