ANPdata:
- creation_date = "2021/8/4"
- maturity = "production"
- updated_date = "2021/8/4"
ANPrule:
- author: ["Elastic"]

- description: "Detects file name patterns generated by the use of Sysinternals SDelete utility to securely delete a file via multiple file overwrite and rename operations."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Verify process details such as command line and hash to confirm this activity legitimacy."

- risk_score: 21

- rule_id: "5aee924b-6ceb-4633-980e-1bde8cdb40c5"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1070",
        name : "Indicator Removal on Host",
        reference : "https://attack.mitre.org/techniques/T1070/",
        subtechnique: [
          [id : "T1070.004",        
          name : "File Deletion",        
          reference : "https://attack.mitre.org/techniques/T1070/004/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Potential Secure File Deletion via SDelete Utility"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "file where event.type == \"change\" and file.name : \"*AAA.AAA\""
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
