ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Adversaries can add the 'hidden' attribute to files to hide them from the user in an attempt to evade detection."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "4630d948-40d4-4cef-ac69-4002e29bc3db"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1564",
        name : "Hide Artifacts",
        reference : "https://attack.mitre.org/techniques/T1564/",
        subtechnique: [
          [id : "T1564.001",        
          name : "Hidden Files and Directories",        
          reference : "https://attack.mitre.org/techniques/T1564/001/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]],

    [framework : "MITRE ATT&CK",

      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]
name: "Adding Hidden File Attribute via Attrib"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n
    process.name: \"attrib.exe\" and process.args : \"+h\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
