ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies execution from a directory masquerading as the Windows Program Files directories. These paths are trusted and usually host trusted third party programs. An adversary may leverage masquerading, along with low privileges to bypass detections whitelisting those folders."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "32c5cf9c-2ef8-4e87-819e-5ccb7cd18b14"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1036",
        name : "Masquerading",
        reference : "https://attack.mitre.org/techniques/T1036/"
      ],

      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]


name: "Program Files Directory Masquerading"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type == \"start\" and
    process.executable : \"C:\\\\*Program*Files*\\\\*.exe\" and
    not process.executable : (\"C:\\\\Program Files\\\\*.exe\", \"C:\\\\Program Files (x86)\\\\*.exe\", \"C:\\\\Users\\\\*.exe\", \"C:\\\\ProgramData\\\\*.exe\")"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
