ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies unusual instances of dllhost.exe making outbound network connections. This may indicate adversarial Command
    and Control activity."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score: 47

- rule_id: "52aaab7b-b51c-441a-89ce-4387b3aea886"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/",
        subtechnique: [
          [id : "T1218.011",        
          name : "Rundll32",        
          reference : "https://attack.mitre.org/techniques/T1218/011/"]

        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Unusual Network Connection via RunDLL32"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "sequence by host.id, process.entity_id with maxspan=1m
    [process where event.type in (\"start\", \"process_started\") and process.name : \"rundll32.exe\" and process.args_count == 1]
    [network where process.name : \"rundll32.exe\" and
    not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",
        \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\",
        \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\",
        \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\",
        \"FE80::/10\", \"FF00::/8\")]"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
