ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies use of the netsh.exe program to enable host discovery via the network. Attackers can use this command-line tool to weaken the host firewall settings."

- false_positives: ["Host Windows Firewall planned system administration changes."]

- language: "eql"

- license: "Elastic License v2"

- risk_score: 47

- rule_id: "8b4f0816-6a65-4630-86a6-c21c179c0d09"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1562",
        name : "Impair Defenses",
        reference : "https://attack.mitre.org/techniques/T1562/",
        subtechnique: [
          [id : "T1562.001",        
          name : "Disable or Modify Tools",        
          reference : "https://attack.mitre.org/techniques/T1562/001/"],

        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]
name: "Enable Host Network Discovery via Netsh"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type == \"start\" and
    process.name : \"netsh.exe\" and
    process.args : (\"firewall\", \"advfirewall\") and process.args : \"group=Network Discovery\" and process.args : \"enable=Yes\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
