ANPdata:
- creation_date = "2021/8/2"
- maturity = "production"
- updated_date = "2021/8/2"
ANPrule:
- author: ["Elastic"]

- description: "Identifies attempts to clear or disable Windows event attackers in an attempt to evade detection or destroy forensic evidence on a system."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "d331bbe2-6db4-4941-80a5-8270db72eb61"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1070",
        name : "Impair Defenses",
        reference : "https://attack.mitre.org/techniques/T1070/"
      ],
      
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]
name: "Clearing Windows Event Logs"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type in (\"process_started\", \"start\") and
    (process.name : \"wevtutil.exe\" or process.pe.original_file_name == \"wevtutil.exe\") and
     process.args : (\"/e:false\", \"cl\", \"clear-log\") or
     process.name : \"powershell.exe\" and process.args : \"Clear-EventLog\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
