ANPdata:
- creation_date = "2021/8/4"
- maturity = "production"
- updated_date = "2021/8/4"
ANPrule:
- author: ["Elastic"]

- description: "Identifies child processes of unusual instances of RunDLL32 where the command line parameters were suspicious. Misuse of RunDLL32 could indicate malicious activity."

- interval: "30m"

- language: "eql"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "f036953a-4615-4707-a1ca-dc53bf69dcd5"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"


- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/",
        subtechnique: [
          [id : "T1218.011",        
          name : "Rundll32",        
          reference : "https://attack.mitre.org/techniques/T1218/011/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Unusual Child Processes of RunDLL32"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "sequence with maxspan=1h    [process where event.type in (\"start\", \"process_started\") and      (process.name : \"rundll32.exe\" or process.pe.original_file_name == \"RUNDLL32.EXE\") and        process.args_count == 1    ] by process.entity_id    [process where event.type in (\"start\", \"process_started\") and process.parent.name : \"rundll32.exe\"    ] by process.parent.entity_id"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
