ANPdata:
- creation_date = "2021/8/4"
- maturity = "production"
- updated_date = "2021/8/4"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a SolarWinds binary modifying the start type of a service to be disabled. An adversary may abuse this technique to manipulate relevant security services."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Verify process details such as command line and hash to confirm this activity legitimacy."

- references: ["https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html"]

- risk_score: 47

- rule_id: "b9960fef-82c6-4816-befa-44745030e917"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1562",
        name : "Impair Defenses",
        reference : "https://attack.mitre.org/techniques/T1562/",
        subtechnique: [
          [id : "T1562.001",        
          name : "Disable or Modify Tools",        
          reference : "https://attack.mitre.org/techniques/T1562/001/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1195",
        name : "Supply Chain Compromise",
        reference : "https://attack.mitre.org/techniques/T1195/",
        subtechnique: [
          [id : "T1195.002",        
          name : "Compromise Software Supply Chain",        
          reference : "https://attack.mitre.org/techniques/T1195/002/"]
        ]
      ],
      tactic: [
        id : "TA0001",
        name : "Initial Access",
        reference : "https://attack.mitre.org/tactics/TA0001/"]]]

name: "SolarWinds Process Disabling Services via Registry"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "registry where registry.path : \"HKLM\\\\SYSTEM\\\\*ControlSet*\\\\Services\\\\*\\\\Start\" and registry.data.strings == \"4\" and
    process.name : (
        \"SolarWinds.BusinessLayerHost*.exe\", 
        \"ConfigurationWizard*.exe\", 
        \"NetflowDatabaseMaintenance*.exe\", 
        \"NetFlowService*.exe\", 
        \"SolarWinds.Administration*.exe\", 
        \"SolarWinds.Collector.Service*.exe\" , 
        \"SolarwindsDiagnostics*.exe\")"
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
