ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies abuse of the Windows Update Auto Update Client (wuauclt.exe) to load an arbitrary DLL. This behavior is used as a defense evasion technique to blend-in malicious activity with legitimate Windows software."

- language: "eql"

- license: "Elastic License v2"

- references: ["https://dtm.uk/wuauclt/"]

- risk_score: 47

- rule_id: "edf8ee23-5ea7-4123-ba19-56b41e424ae3"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]

name: "ImageLoad via Windows Update Auto Update Client"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    (process.pe.original_file_name == \"wuauclt.exe\" or process.name : \"wuauclt.exe\") and
    /* necessary windows update client args to load a dll */
    process.args : \"/RunHandlerComServer\" and process.args : \"/UpdateDeploymentProvider\" and
    /* common paths writeable by a standard user where the target DLL can be placed */
    process.args : (\"C:\\\\Users\\\\*.dll\", \"C:\\\\ProgramData\\\\*.dll\", \"C:\\\\Windows\\\\Temp\\\\*.dll\", \"C:\\\\Windows\\\\Tasks\\\\*.dll\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
