ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "Identifies use of the Set-MpPreference PowerShell command to disable or weaken certain Windows Defender settings."

- false_positives: ["Planned Windows Defender configuration changes."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2019-ps"]

- risk_score: 47

- rule_id: "c8cccb06-faf2-4cd5-886e-2c9636cfcb87"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1562",
        name : "Impair Defenses",
        reference : "https://attack.mitre.org/techniques/T1562/",
        subtechnique: [
          [id : "T1562.001",        
          name : "Disable or Modify Tools",        
          reference : "https://attack.mitre.org/techniques/T1562/001/"],

        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]

name: "Disabling Windows Defender Security Settings via PowerShell"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type == \"start\" and
    (process.name : (\"powershell.exe\", \"pwsh.exe\") or process.pe.original_file_name == \"PowerShell.EXE\") and
    process.args : \"Set-MpPreference\" and process.args : (\"-Disable*\", \"Disabled\", \"NeverSend\", \"-Exclusion*\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
