ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies scrobj.dll loaded into unusual Microsoft processes. This usually means a malicious scriptlet is being
    executed in the target process."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Verify process details such as command line and hash to confirm this activity legitimacy."

- references: ["https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html"]

- risk_score: 47

- rule_id: "4ed678a9-3a4f-41fb-9fea-f85a6e0a0dff"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1218",
        name : "Signed Binary Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1218/"
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

name: "Suspicious Script Object Execution"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "sequence by process.entity_id with maxspan=2m
    [process where event.type == \"start\" 
    and (process.code_signature.subject_name in (\"Microsoft Corporation\", \"Microsoft Windows\") and 
    process.code_signature.trusted == true) and
      not process.executable : (
        \"?:\\\\Windows\\\\System32\\\\cscript.exe\",
        \"?:\\\\Windows\\\\SysWOW64\\\\cscript.exe\",
        \"?:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\",
        \"?:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\",
        \"?:\\\\Windows\\\\SystemApps\\\\Microsoft.MicrosoftEdge_*\\\\MicrosoftEdge.exe\",
        \"?:\\\\Windows\\\\system32\\\\msiexec.exe\",
        \"?:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\",
        \"?:\\\\Windows\\\\System32\\\\smartscreen.exe\",
        \"?:\\\\Windows\\\\system32\\\\taskhostw.exe\",
        \"?:\\\\windows\\\\system32\\\\inetsrv\\\\w3wp.exe\",
        \"?:\\\\windows\\\\SysWOW64\\\\inetsrv\\\\w3wp.exe\",
        \"?:\\\\Windows\\\\system32\\\\wscript.exe\",
        \"?:\\\\Windows\\\\SysWOW64\\\\wscript.exe\",
        \"?:\\\\Windows\\\\system32\\\\mobsync.exe\",
        \"?:\\\\Windows\\\\SysWOW64\\\\mobsync.exe\",
        \"?:\\\\Windows\\\\System32\\\\cmd.exe\",
        \"?:\\\\Windows\\\\SysWOW64\\\\cmd.exe\")]
    [library where event.type == \"start\" and dll.name : \"scrobj.dll\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
