ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies suspicious commands being used with certutil.exe. CertUtil is a native Windows component which is part of  Certificate Services. CertUtil is often abused by attackers to live off the land for stealthier command and control or  data exfiltration."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis Verify process details such as command line and hash to confirm this activity legitimacy."

- references: ["https://twitter.com/Moriarty_Meng/status/984380793383370752", "https://twitter.com/egre55/status/1087685529016193025", "https://www.sysadmins.lv/blog-en/certutil-tips-and-tricks-working-with-x509-file-format.aspx", "https://docs.microsoft.com/en-us/archive/blogs/pki/basic-crl-checking-with-certutil"]

- risk_score: 47

- rule_id: "fd70c98a-c410-42dc-a2e3-761c71848acf"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1140",
        name : "Deobfuscate/Decode Files or Information",
        reference : "https://attack.mitre.org/techniques/T1140/"

      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]]]

    
name: "Suspicious CertUtil Commands"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type == \"start\" and
    (process.name : \"certutil.exe\" or process.pe.original_file_name == \"CertUtil.exe\") and 
    process.args : (\"?decode\", \"?encode\", \"?urlcache\", \"?verifyctl\", \"?encodehex\", \"?decodehex\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
