ANPdata:
- creation_date = "2021/8/3"
- maturity = "production"
- updated_date = "2021/8/3"
ANPrule:
- author: ["Elastic"]

- description: "An instance of MSBuild, the Microsoft Build Engine, was started by Excel or Word. This is unusual behavior for the Build Engine and could have been caused by an Excel or Word document executing a malicious script payload."

- false_positives: ["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual. It is quite unusual for this program to be started by an Office application like Word or Excel."]

- language: "eql"

- license: "Elastic License v2"

- references: ["https://blog.talosintelligence.com/2020/02/building-bypass-with-msbuild.html"]

- risk_score: 73

- rule_id: "c5dc3223-13a2-44a2-946c-e9dc0aa0449c"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1127",
        name : "Trusted Developer Utilities Proxy Execution",
        reference : "https://attack.mitre.org/techniques/T1127/"],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]],

    [framework : "MITRE ATT&CK",
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]
    ]
  ]

name: "Microsoft Build Engine Started by an Office Application"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    process.name : \"MSBuild.exe\" and
    process.parent.name : (\"eqnedt32.exe\",
                          \"excel.exe\",
                          \"fltldr.exe\",
                          \"msaccess.exe\",
                          \"mspub.exe\",
                          \"outlook.exe\",
                          \"powerpnt.exe\",
                          \"winword.exe\" )"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
