ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "This rule detects the Active Directory query tool, AdFind.exe. AdFind has legitimate purposes, but it is frequently
    leveraged by threat actors to perform post-exploitation Active Directory reconnaissance. The AdFind tool has been
    observed in Trickbot, Ryuk, Maze, and FIN6 campaigns. For Winlogbeat, this rule requires Sysmon."

- language: "eql"

- license: "Elastic License v2"

- note: "## Triage and analysis
    AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment."

- references: ["http://www.joeware.net/freetools/tools/adfind/", "https://thedfirreport.com/2020/05/08/adfind-recon/", "https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html", "https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware", "https://www.fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html", "https://usa.visa.com/dam/VCOM/global/support-legal/documents/fin6-cybercrime-group-expands-threat-To-ecommerce-merchants.pdf"]

- risk_score: 21

- rule_id: "eda499b8-a073-4e35-9733-22ec71f57f3a"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Discovery"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1069",
        name : "Permission Groups Discovery",
        reference : "https://attack.mitre.org/techniques/T1069/",
        subtechnique: [
          [id : "T1566.002",        
          name : "Domain Groups",        
          reference : "https://attack.mitre.org/techniques/T1566/002/"]
        ]
      ]
    ],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1087",
        name : "Account Discovery",
        reference : "https://attack.mitre.org/techniques/T1087/",
        subtechnique: [
          [id : "T1087.002",        
          name : "Domain Account",        
          reference : "https://attack.mitre.org/techniques/T1087/002/"]
        ]
      ]

    ],
    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1482",
        name : "Domain Trust Discovery",
        reference : "https://attack.mitre.org/techniques/T1482/"],
      tactic: [
        id : "TA0007",
        name : "Discovery",
        reference : "https://attack.mitre.org/tactics/TA0007/"]]]

name: "AdFind Command Activity"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and 
    (process.name : \"AdFind.exe\" or process.pe.original_file_name == \"AdFind.exe\") and 
    process.args : (\"objectcategory=computer\", \"(objectcategory=computer)\", 
                    \"objectcategory=person\", \"(objectcategory=person)\",
                    \"objectcategory=subnet\", \"(objectcategory=subnet)\",
                    \"objectcategory=group\", \"(objectcategory=group)\", 
                    \"objectcategory=organizationalunit\", \"(objectcategory=organizationalunit)\",
                    \"objectcategory=attributeschema\", \"(objectcategory=attributeschema)\",
                    \"domainlist\", \"dcmodes\", \"adinfo\", \"dclist\", \"computers_pwnotreqd\", \"trustdmp\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
