ANPdata:
- creation_date = "2021/8/7"
- maturity = "production"
- updated_date = "2021/8/7"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the SYSTEM account using an account discovery utility. This could be a sign of discovery activity after an
    adversary has achieved privilege escalation."

- language: "eql"

- license: "Elastic License v2"

- risk_score: 21

- rule_id: "2856446a-34e6-435b-9fb5-f8f040bfa7ed"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Discovery"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1087",
        name : "Account Discovery",
        reference : "https://attack.mitre.org/techniques/T1087/"]
        
      ],
      tactic: [
        id : "TA0007",
        name : "Discovery",
        reference : "https://attack.mitre.org/tactics/TA0007/"]]

name: "Net command via SYSTEM account"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and 
    user.id in (\"S-1-5-18\", \"S-1-5-19\", \"S-1-5-20\") and
    process.name : \"whoami.exe\" or
    (process.name : \"net1.exe\" and not process.parent.name : \"net.exe\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
