ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a suspicious image load (wmiutils.dll) from Microsoft Office processes. This behavior may indicate
    adversarial activity where child processes are spawned via Windows Management Instrumentation (WMI). This technique can
    be used to execute code and evade traditional parent/child processes spawned from Microsoft Office products."

# - false_positives: ["Legitimate scheduled tasks may be created during installation of new software."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     The SxS DotLocal folder is a legitimate feature that can be abused to hijack standard modules loading order by forcing an executable on the same application.exe.local folder to load a malicious DLL module from the same directory."""

- references: ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"]

# - max_signals: 33

- risk_score: 21

- rule_id: "891cb88e-441a-4c3e-be2d-120d99fe7b0d"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1047",
        name : "Windows Management Instrumentation",
        reference : "https://attack.mitre.org/techniques/T1047/"],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]]]

name: "Suspicious WMI Image Load from MS Office"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "library where process.name : (\"WINWORD.EXE\", \"EXCEL.EXE\", \"POWERPNT.EXE\", \"MSPUB.EXE\", \"MSACCESS.EXE\") and    event.action : \"load\" and    event.category : \"library\" and    dll.name : \"wmiutils.dll\""
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
