ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies suspicious psexec activity which is executing from the psexec service that has been renamed, possibly to
    evade detection."

# - false_positives: ["Legitimate scheduled tasks may be created during installation of new software."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     The SxS DotLocal folder is a legitimate feature that can be abused to hijack standard modules loading order by forcing an executable on the same application.exe.local folder to load a malicious DLL module from the same directory."""

# - references: ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"]

# - max_signals: 33

- risk_score: 47

- rule_id: "e2f9fdf5-8076-45ad-9427-41e0e03dc9c2"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1569",
        name : "System Services",
        reference : "https://attack.mitre.org/techniques/T1569/",
        subtechnique: [
          [id : "T1569.002",        
          name : "Service Execution",        
          reference : "https://attack.mitre.org/techniques/T1569/002/"]
        ]
      ],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]]
  ]
name: "Suspicious Process Execution via Renamed PsExec Executable"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\", \"info\") and
    process.pe.original_file_name : \"psexesvc.exe\" and not process.name : \"PSEXESVC.exe\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
