ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies cmd.exe making a network connection. Adversaries could abuse cmd.exe to download or execute malware from a
    remote URL."

- false_positives: ["Administrators may use the command prompt for regular administrative tasks. It's important to baseline your
    environment for network connections being made from the command prompt to determine any abnormal use of this tool."]

# - interval: "30m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment."""

- references: ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

# - max_signals: 33

- risk_score: 21

- rule_id: "89f9a4b0-9f8f-4ee0-8823-c4751a6d6696"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1059",
        name : "Command and Scripting Interpreter",
        reference : "https://attack.mitre.org/techniques/T1059/"],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1105",
        name : "Ingress Tool Transfer",
        reference : "https://attack.mitre.org/techniques/T1105/"],
      tactic: [
        id : "TA0011",
        name : "Command and Control",
        reference : "https://attack.mitre.org/tactics/TA0011/"]
    ]
  ]

name: "Command Prompt Network Connection"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "sequence by process.entity_id
    [process where process.name : \"cmd.exe\" and event.type == \"start\"]
    [network where process.name : \"cmd.exe\" and
      not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",
                                    \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\",
                                    \"192.0.0.171/32\", \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\",
                                    \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\", \"192.175.48.0/24\",
                                    \"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\",
                                    \"FE80::/10\", \"FF00::/8\")]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
