ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "A suspicious SolarWinds child process (Cmd.exe or Powershell.exe) was detected."

- false_positives: ["Trusted SolarWinds child processes. Verify process details such as network connections and file writes."]

# - interval: "30m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment."""

- references: ["https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html", "https://github.com/fireeye/sunburst_countermeasures/blob/main/rules/SUNBURST/hxioc/SOLARWINDS%20SUSPICIOUS%20FILEWRITES%20(METHODOLOGY).ioc"]

# - max_signals: 33

- risk_score: 47

- rule_id: "d72e33fc-6e91-42ff-ac8b-e573268c5a87"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1059",
        name : "Command and Scripting Interpreter",
        reference : "https://attack.mitre.org/techniques/T1059/"],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1195",
        name : "Supply Chain Compromise",
        reference : "https://attack.mitre.org/techniques/T1195/",
        subtechnique: [
          [id : "T1195.002",        
          name : "Compromise Software Supply Chain",        
          reference : "https://attack.mitre.org/techniques/T1195/002/"]
        ]
      ],
      tactic: [
        id : "TA0001",
        name : "Initial Access",
        reference : "https://attack.mitre.org/tactics/TA0001/"]
    ]
  ]

name: "Command Execution via SolarWinds Process"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and process.name: (\"cmd.exe\", \"powershell.exe\") and
    process.parent.name: (
        \"ConfigurationWizard*.exe\",
        \"NetflowDatabaseMaintenance*.exe\",
        \"NetFlowService*.exe\",
        \"SolarWinds.Administration*.exe\",
        \"SolarWinds.Collector.Service*.exe\",
        \"SolarwindsDiagnostics*.exe\"
        )"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
