ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies native Windows host and network enumeration commands spawned by the Windows Management Instrumentation
    Provider Service (WMIPrvSE)."

# - false_positives: ["Microsoft Windows installers leveraging RunDLL32 for installation."]

# - interval: "30m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment."""

# - references: ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

# - max_signals: 33

- risk_score: 21

- rule_id: "770e0c4d-b998-41e5-a62e-c7901fd7f470"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1047",
        name : "Windows Management Instrumentation",
        reference : "https://attack.mitre.org/techniques/T1047/"],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]]
  ]


name: "Enumeration Command Spawned via WMIPrvSE"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    process.name:
    (
      \"arp.exe\",
      \"dsquery.exe\",
      \"dsget.exe\",
      \"gpresult.exe\",
      \"hostname.exe\",
      \"ipconfig.exe\",
      \"nbtstat.exe\",
      \"net.exe\",
      \"net1.exe\",
      \"netsh.exe\",
      \"netstat.exe\",
      \"nltest.exe\",
      \"ping.exe\",
      \"qprocess.exe\",
      \"quser.exe\",
      \"qwinsta.exe\",
      \"reg.exe\",
      \"sc.exe\",
      \"systeminfo.exe\",
      \"tasklist.exe\",
      \"tracert.exe\",
      \"whoami.exe\"
    ) and
    process.parent.name:\"wmiprvse.exe\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
