ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the PowerShell process loading the Task Scheduler COM DLL followed by an outbound RPC network connection
    within a short time period. This may indicate lateral movement or remote discovery via scheduled tasks."

- false_positives: ["Legitimate scheduled tasks may be created during installation of new software."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     This is related to the `Process Execution from an Unusual Directory rule`."""

- references: ["https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "5cd55388-a19c-47c7-8ec4-f41656c2fded"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1053",
        name : "Scheduled Task/Job",
        reference : "https://attack.mitre.org/techniques/T1053/"]
    ]
  ]

name: "Outbound Scheduled Task Activity via PowerShell"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "sequence by host.id, process.entity_id with maxspan = 5s
    [library where dll.name : \"taskschd.dll\" and process.name : (\"powershell.exe\", \"pwsh.exe\")]
    [network where process.name : (\"powershell.exe\", \"pwsh.exe\") and destination.port == 135 and destination.ip != \"127.0.0.1\" destination.ip != \"::1\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
