ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies use of vssadmin.exe for shadow copy deletion on endpoints. This commonly occurs in tandem with ransomware or
    other destructive attacks."

# - false_positives: ["The HTML Help executable program (hh.exe) runs whenever a user clicks a compiled help (.chm) file or menu item that
#     opens the help file inside the Help Viewer. This is not always malicious, but adversaries may abuse this technology
#     to conceal malicious code."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     The SxS DotLocal folder is a legitimate feature that can be abused to hijack standard modules loading order by forcing an executable on the same application.exe.local folder to load a malicious DLL module from the same directory."""

# - references: ["https://www.fireeye.com/blog/threat-research/2017/08/monitoring-windows-console-activity-part-one.html"]

# - max_signals: 33

- risk_score: 73

- rule_id: "b5ea4bfe-a1b2-421f-9d47-22a75a6f2921"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Impact"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1490",
        name : "Inhibit System Recovery",
        reference : "https://attack.mitre.org/techniques/T1490/"],
      tactic: [
        id : "TA0040",
        name : "Impact",
        reference : "https://attack.mitre.org/tactics/TA0040/"]]
  ]

name: "Volume Shadow Copy Deletion via VssAdmin"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    (process.name : \"vssadmin.exe\" or process.pe.original_file_name == \"VSSADMIN.EXE\") and
    process.args : \"delete\" and process.args : \"shadows\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
