ANPdata:
- creation_date = "2021/8/8"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/8"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a PowerShell process launched by either cscript.exe or wscript.exe. Observing Windows scripting processes
    executing a PowerShell script, may be indicative of malicious activity."

# - false_positives: ["The HTML Help executable program (hh.exe) runs whenever a user clicks a compiled help (.chm) file or menu item that
#     opens the help file inside the Help Viewer. This is not always malicious, but adversaries may abuse this technology
#     to conceal malicious code."]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis
#     The SxS DotLocal folder is a legitimate feature that can be abused to hijack standard modules loading order by forcing an executable on the same application.exe.local folder to load a malicious DLL module from the same directory."""

# - references: ["https://www.fireeye.com/blog/threat-research/2017/08/monitoring-windows-console-activity-part-one.html"]

# - max_signals: 33

- risk_score: 21

- rule_id: "f545ff26-3c94-4fd0-bd33-3c7f95a3a0fc"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Initial Access"]

- type: "eql"
- threat: [
    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1566",
        name : "Phishing",
        reference : "https://attack.mitre.org/techniques/T1566/",
        subtechnique: [
          [id : "T1566.001",        
          name : "Spearphishing Attachment",        
          reference : "https://attack.mitre.org/techniques/T1566/001/"]
        ]
      ],
      tactic: [
        id : "TA0001",
        name : "Initial Access",
        reference : "https://attack.mitre.org/tactics/TA0001/"]
    ]
  ]

name: "Windows Script Executing PowerShell"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    process.parent.name : (\"cscript.exe\", \"wscript.exe\") and process.name : \"powershell.exe\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
