ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the execution of a file that was created by the virtual system process. This may indicate lateral movement
    via network file shares."

# - false_positives:  ["""Environments that leverage DNS responses over 60k bytes will result in false positives - if this traffic is
    # predictable and expected, it should be filtered out. Additionally, this detection rule could be triggered by an
    # authorized vulnerability scan or compromise assessment."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Investigating Large DNS ResponsesDetection alerts from this rule indicate an attempt was made to exploit CVE-2020-1350 (SigRed) through the use of large DNS responses on a Windows DNS server. Here are some possible avenues of investigation - Investigate any corresponding Intrusion Detection Signatures (IDS) alerts that can validate this detection alert.- Examine the `dns.question_type` network fieldset with a protocol analyzer, such as Zeek, Packetbeat, or Suricata, for `SIG` or `RRSIG` data.- Validate the patch level and OS of the targeted DNS server to validate the observed activity was not large-scale Internet vulnerability scanning.- Validate that the source of the network activity was not from an authorized vulnerability scan or compromise assessment."""

- references: ["https://blog.menasec.net/2020/08/new-trick-to-detect-lateral-movement.html"]

# - max_signals: 33

- risk_score: 47

- rule_id: "ab75c24b-2502-43a0-bf7c-e60e662c811e"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/",
        subtechnique: [
          [id : "T1021.002",        
          name : "SMB/Windows Admin Shares",        
          reference : "https://attack.mitre.org/techniques/T1021/002/"]
        ]
      ],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]
    ]
  ]
name: "Remote Execution via File Shares"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "sequence with maxspan=1m
    [file where event.type in (\"creation\", \"change\") and process.pid == 4 and file.extension : \"exe\"] by host.id, file.path
    [process where event.type in (\"start\", \"process_started\")] by host.id, process.executable"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
