ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies suspicious Image Loading of the Remote Desktop Services ActiveX Client (mstscax), this may indicate the
    presence of RDP lateral movement capability."

# - false_positives:  ["""PowerShell remoting is a dual-use protocol that can be used for benign or malicious activity. It's important to
    # baseline your environment to determine the amount of noise to expect from this tool."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded tasks actions registry value to investigate the task configured action."""

- references: ["https://posts.specterops.io/revisiting-remote-desktop-lateral-movement-8fb905cb46c3"]

# - max_signals: 33

- risk_score: 47

- rule_id: "71c5cb27-eca5-4151-bb47-64bc3f883270"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/"
      ],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]
    ]
  ]

name: "Suspicious RDP ActiveX Client Loaded"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "library where dll.name : \"mstscax.dll\" and
    /* depending on noise in your env add here extra paths  */
    process.executable :
      (
      \"C:\\\\Windows\\\\*\",
      \"C:\\\\Users\\\\Public\\\\*\",
      \"C:\\\\Users\\\\Default\\\\*\",
      \"C:\\\\Intel\\\\*\",
      \"C:\\\\PerfLogs\\\\*\",
      \"C:\\\\ProgramData\\\\*\",
      \"\\\\Device\\\\Mup\\\\*\",
      \"\\\\*\"
      ) and
      /* add here FPs */
    not process.executable : (\"C:\\\\Windows\\\\System32\\\\mstsc.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\mstsc.exe\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
