ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies suspicious file creations in the startup folder of a remote system. An adversary could abuse this to move
    laterally by dropping a malicious script or executable that will be executed after a reboot or user logon."

# - false_positives:  ["""PowerShell remoting is a dual-use protocol that can be used for benign or malicious activity. It's important to
    # baseline your environment to determine the amount of noise to expect from this tool."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded tasks actions registry value to investigate the task configured action."""

- references: ["https://www.mdsec.co.uk/2017/06/rdpinception/"]

# - max_signals: 33

- risk_score: 73

- rule_id: "25224a80-5a4a-4b8a-991e-6ab390465c4f"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/"
      ],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]
    ],
    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/"
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Lateral Movement via Startup Folder"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "file where event.type in (\"creation\", \"change\") and
    /* via RDP TSClient mounted share or SMB */
      (process.name : \"mstsc.exe\" or process.pid == 4) and
      file.path : \"C:\\\\*\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\*\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
