ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies use of sc.exe to create, modify, or start services on remote hosts. This could be indicative of adversary
    lateral movement but will be noisy if commonly done by admins."

# - false_positives:  ["""Werfault.exe will legitimately spawn when dns.exe crashes, but the DNS service is very stable and so this is a low
    # occurring event. Denial of Service (DoS) attempts by intentionally crashing the service will also cause werfault.exe
    # to spawn."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Investigating Unusual File Write Detection alerts from this rule indicate potential unusual/abnormal file writes from the DNS Server service process (`dns.exe`) after exploitation from CVE-2020-1350 (SigRed) has occurred. Here are some possible avenues of investigation - Post-exploitation, adversaries may write additional files or payloads to the system as additional discovery/exploitation/persistence mechanisms.- Any suspicious or abnormal files written from `dns.exe` should be reviewed and investigated with care.""""""

# - references: ["https://research.checkpoint.com/2020/resolving-your-way-into-domain-admin-exploiting-a-17-year-old-bug-in-windows-dns-servers/", "https://msrc-blog.microsoft.com/2020/07/14/july-2020-security-update-cve-2020-1350-vulnerability-in-windows-domain-name-system-dns-server/"]

# - max_signals: 33

- risk_score: 21

- rule_id: "d61cbcf8-1bc1-4cff-85ba-e7b21c5beedc"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1021",
        name : "Remote Services",
        reference : "https://attack.mitre.org/techniques/T1021/"],
      tactic: [
        id : "TA0008",
        name : "Lateral Movement",
        reference : "https://attack.mitre.org/tactics/TA0008/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1543",
        name : "Create or Modify System Process",
        reference : "https://attack.mitre.org/techniques/T1543/",
        subtechnique: [
          [id : "T1543.003",        
          name : "Windows Service",        
          reference : "https://attack.mitre.org/techniques/T1543/003/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ],
    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1569",
        name : "System Services",
        reference : "https://attack.mitre.org/techniques/T1569/",
        subtechnique: [
          [id : "T1569.002",        
          name : "Service Execution",        
          reference : "https://attack.mitre.org/techniques/T1569/002/"]
        ]
      ],
      tactic: [
        id : "TA0002",
        name : "Execution",
        reference : "https://attack.mitre.org/tactics/TA0002/"]
    ]
  ]


name: "Service Command Lateral Movement"
index: anp-log-agentbase-winclient

type: any
eql:
  "query": "sequence by process.entity_id with maxspan = 1m
    [process where event.type in (\"start\", \"process_started\") and
      (process.name : \"sc.exe\" or process.pe.original_file_name : \"sc.exe\") and
        process.args : \"\\\\*\" and process.args : (\"binPath=*\", \"binpath=*\") and
        process.args : (\"create\", \"config\", \"failure\", \"start\")]
    [network where process.name : \"sc.exe\" and destination.ip != \"127.0.0.1\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
