ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies Component Object Model (COM) hijacking via registry modification. Adversaries may establish persistence by
    executing malicious content triggered by hijacked references to COM objects."

# - false_positives:  ["""A legitimate VBA for Outlook is usually configured interactively via OUTLOOK.EXE."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "16a52c14-7883-47af-8745-9357803f0d4c"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1546",
        name : "Event Triggered Execution",
        reference : "https://attack.mitre.org/techniques/T1546/",
        subtechnique: [
          [id : "T1546.015",        
          name : "Component Object Model Hijacking",        
          reference : "https://attack.mitre.org/techniques/T1546/015/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Component Object Model Hijacking"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "registry where
    /* uncomment once length is stable length(bytes_written_string) > 0 and */
    (registry.path : \"HK*}\\\\InprocServer32\\\\\" and registry.data.strings: (\"scrobj.dll\", \"C:\\\\*\\\\scrobj.dll\") and
    not registry.path : \"*\\\\{06290BD*-48AA-11D2-8432-006008C3FBFC}\\\\*\") 
    or
    /* in general COM Registry changes on Users Hive is less noisy and worth alerting */
    (registry.path : (\"HKEY_USERS\\\\*Classes\\\\*\\\\InprocServer32\\\\\",
                      \"HKEY_USERS\\\\*Classes\\\\*\\\\LocalServer32\\\\\", 
                      \"HKEY_USERS\\\\*Classes\\\\*\\\\DelegateExecute\\\\\", 
                      \"HKEY_USERS\\\\*Classes\\\\*\\\\TreatAs\\\\\", 
                      \"HKEY_USERS\\\\*Classes\\\\CLSID\\\\*\\\\ScriptletURL\\\\\") and
    /* not necessary but good for filtering privileged installations */
    user.domain != \"NT AUTHORITY\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
