ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Detects writing executable files that will be automatically launched by Adobe on launch."

# - false_positives:  ["""PowerShell remoting is a dual-use protocol that can be used for benign or malicious activity. It's important to
    # baseline your environment to determine the amount of noise to expect from this tool."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded tasks actions registry value to investigate the task configured action."""

# - references: ["https://www.mdsec.co.uk/2017/06/rdpinception/"]

# - max_signals: 33

- risk_score: 21

- rule_id: "2bf78aa2-9c56-48de-b139-f169bf99cf86"

- severity: "low"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1574",
        name : "Hijack Execution Flow",
        reference : "https://attack.mitre.org/techniques/T1574/",
        subtechnique: [
          [id : "T1574.010",        
          name : "Services File Permissions Weakness",        
          reference : "https://attack.mitre.org/techniques/T1574/010/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Adobe Hijack Persistence"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "file where event.type == \"creation\" and
    file.path : (\"?:\\\\Program Files (x86)\\\\Adobe\\\\Acrobat Reader DC\\\\Reader\\\\AcroCEF\\\\RdrCEF.exe\",
                \"?:\\\\Program Files\\\\Adobe\\\\Acrobat Reader DC\\\\Reader\\\\AcroCEF\\\\RdrCEF.exe\") and
    not process.name : \"msiexec.exe\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
