ANPdata:
- creation_date = "2021/8/10"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/10"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies the installation of custom Application Compatibility Shim databases. This Windows functionality has been
    abused by attackers to stealthily gain persistence and arbitrary code execution in legitimate Windows processes."

# - false_positives:  ["""PowerShell remoting is a dual-use protocol that can be used for benign or malicious activity. It's important to
    # baseline your environment to determine the amount of noise to expect from this tool."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded tasks actions registry value to investigate the task configured action."""

# - references: ["https://www.mdsec.co.uk/2017/06/rdpinception/"]

# - max_signals: 33

- risk_score: 21

- rule_id: "c5ce48a6-7f57-4ee8-9313-3d0024caee10"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1546",
        name : "Event Triggered Execution",
        reference : "https://attack.mitre.org/techniques/T1546/",
        subtechnique: [
          [id : "T1546.011",        
          name : "Application Shimming",        
          reference : "https://attack.mitre.org/techniques/T1546/011/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Installation of Custom Shim Databases"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "sequence by process.entity_id with maxspan = 5m
    [process where event.type in (\"start\", \"process_started\") and
      not (process.name : \"sdbinst.exe\" and process.parent.name : \"msiexec.exe\")]
    [registry where event.type in (\"creation\", \"change\") and
      registry.path : \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\AppCompatFlags\\\\Custom\\\\*.sdb\"]"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
