ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies script engines creating files in the startup folder, or the creation of script files in the startup folder."

# - false_positives:  ["""A legitimate VBA for Outlook is usually configured interactively via OUTLOOK.EXE."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

# - references: ["https://www.microsoftpressstore.com/articles/article.aspx?p=2762082&seqNum=2"]

# - max_signals: 33

- risk_score: 47

- rule_id: "f7c4dc5a-a58d-491d-9f14-9b66507121c0"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.001",        
          name : "Registry Run Keys / Startup Folder",        
          reference : "https://attack.mitre.org/techniques/T1547/001/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]

name: "Persistent Scripts in the Startup Directory"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "file where event.type != \"deletion\" and user.domain != \"NT AUTHORITY\" and
  
    /* detect shortcuts created by wscript.exe or cscript.exe */
    (file.path : \"C:\\\\*\\\\Programs\\\\Startup\\\\*.lnk\" and
      process.name : (\"wscript.exe\", \"cscript.exe\")) or
    /* detect vbs or js files created by any process */
    file.path : (\"C:\\\\*\\\\Programs\\\\Startup\\\\*.vbs\", 
                \"C:\\\\*\\\\Programs\\\\Startup\\\\*.vbe\", 
                \"C:\\\\*\\\\Programs\\\\Startup\\\\*.wsh\", 
                \"C:\\\\*\\\\Programs\\\\Startup\\\\*.wsf\", 
                \"C:\\\\*\\\\Programs\\\\Startup\\\\*.js\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
