ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies a persistence mechanism that utilizes the NtSetValueKey native API to create a hidden (null terminated)
    registry key. An adversary may use this method to hide from system utilities such as the Registry Editor (regedit)."

# - false_positives:  ["""Legitimate local user creations may be done by a system or network administrator. Verify whether this is known
    # behavior in your environment. Local user creations from unfamiliar users or hosts should be investigated. If known
    # behavior is causing false positives, it can be exempted from the rule."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://github.com/outflanknl/SharpHide", "https://github.com/ewhitehats/InvisiblePersistence/blob/master/InvisibleRegValues_Whitepaper.pdf"]

# - max_signals: 33

- risk_score: 73

- rule_id: "a9b05c3b-b304-4bf9-970d-acdfaef2944c"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.001",        
          name : "Registry Run Keys / Startup Folder",        
          reference : "https://attack.mitre.org/techniques/T1547/001/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]
name: "Persistence via Hidden Run Key Detected"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "/* Registry Path ends with backslash */
    registry where /* length(registry.data.strings) > 0 and */
    registry.path : (\"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\\", 
                      \"HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\\", 
                      \"HKLM\\\\Software\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\\", 
                      \"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\Run\\\\\", 
                      \"HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\Run\\\\\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
