ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Windows operating systems are utilizing the time provider architecture in order to obtain accurate time stamps from
    other network devices or clients in the network. Time providers are implemented in the form of a DLL file which resides
    in System32 folder. The service W32Time initiates during the startup of Windows and loads w32time.dll. Adversaries may
    abuse this architecture to establish persistence, specifically by registering and enabling a malicious DLL as a time
    provider."

# - false_positives:  ["""Legitimate scheduled tasks running third party software."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://pentestlab.blog/2019/10/22/persistence-time-providers/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "14ed1aa9-ebfd-4cf9-a463-0ac59ec55204"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1547",
        name : "Boot or Logon Autostart Execution",
        reference : "https://attack.mitre.org/techniques/T1547/",
        subtechnique: [
          [id : "T1547.003",        
          name : "Time Providers",        
          reference : "https://attack.mitre.org/techniques/T1547/003/"]
        ]
      ],
      tactic: [
        id : "TA0003",
        name : "Persistence",
        reference : "https://attack.mitre.org/tactics/TA0003/"]
    ]
  ]
name: "Potential Persistence via Time Provider Modification"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "registry where event.type:\"change\" and
    registry.path:\"HKLM\\\\SYSTEM\\\\*ControlSet*\\\\Services\\\\W32Time\\\\TimeProviders\\\\*\" and
    registry.data.strings:\"*.dll\""

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
