ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies attempts to bypass User Account Control (UAC) by abusing an elevated COM Interface to launch a rogue Windows
    ClipUp program. Attackers may attempt to bypass UAC to stealthily execute code with elevated permissions."

# - false_positives:  ["""Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as
    # manufacturer and signature information."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

- references: ["https://github.com/hfiref0x/UACME"]

# - max_signals: 33

- risk_score: 73

- rule_id: "b90cdde7-7e0d-4359-8bf0-2c112ce2008a"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"

- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1548",
        name : "Abuse Elevation Control Mechanism",
        reference : "https://attack.mitre.org/techniques/T1548/",
        subtechnique: [
          [id : "T1548.002",        
          name : "Bypass User Account Control",        
          reference : "https://attack.mitre.org/techniques/T1548/002/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]

name: "UAC Bypass Attempt with IEditionUpgradeManager Elevated COM Interface"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and process.name : \"Clipup.exe\" and
    not process.executable : \"C:\\\\Windows\\\\System32\\\\ClipUp.exe\" and process.parent.name : \"dllhost.exe\" and
    /* CLSID of the Elevated COM Interface IEditionUpgradeManager */
    process.parent.args : \"/Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
