ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "User Account Control (UAC) can help mitigate the impact of malware on Windows hosts. With UAC, apps and tasks always run
    in the security context of a non-administrator account, unless an administrator specifically authorizes
    administrator-level access to the system. This rule identifies registry value changes to bypass User Access Control
    (UAC) protection."

# - false_positives:  ["""Legitimate local user creations may be done by a system or network administrator. Verify whether this is known
    # behavior in your environment. Local user creations from unfamiliar users or hosts should be investigated. If known
    # behavior is causing false positives, it can be exempted from the rule."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Triage and analysis Decode the base64 encoded Tasks Actions registry value to investigate the task's configured action."""

- references: ["https://www.greyhathacker.net/?p=796", "https://docs.microsoft.com/en-us/windows/security/identity-protection/user-account-control/user-account-control-group-policy-and-registry-key-settings", "https://docs.microsoft.com/en-us/windows/security/identity-protection/user-account-control/user-account-control-overview"]

# - max_signals: 33

- risk_score: 47

- rule_id: "d31f183a-e5b1-451b-8534-ba62bca0b404"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1548",
        name : "Abuse Elevation Control Mechanism",
        reference : "https://attack.mitre.org/techniques/T1548/",
        subtechnique: [
          [id : "T1548.002",        
          name : "Bypass User Account Control",        
          reference : "https://attack.mitre.org/techniques/T1548/002/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]],

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1548",
        name : "Abuse Elevation Control Mechanism",
        reference : "https://attack.mitre.org/techniques/T1548/",
        subtechnique: [
          [id : "T1566.002",        
          name : "Bypass User Account Control",        
          reference : "https://attack.mitre.org/techniques/T1548/002/"]
        ]
      ],
      tactic: [
        id : "TA0005",
        name : "Defense Evasion",
        reference : "https://attack.mitre.org/tactics/TA0005/"]
    ]
  ]
name: "Disabling User Account Control via Registry Modification"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "registry where event.type == \"change\" and
    registry.path :
      (
        \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\\\\EnableLUA\",
        \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\\\\ConsentPromptBehaviorAdmin\",
        \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\\\\PromptOnSecureDesktop\"
      ) and
    registry.data.strings : \"0\""

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
