ANPdata:
- creation_date = "2021/8/12"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/12"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Identifies Windows programs run from unexpected parent processes. This could indicate masquerading or other strange
    activity on a system."

# - false_positives:  ["""Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as
    # manufacturer and signature information."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

# - note: """## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."""

- references: ["https://github.com/sbousseaden/Slides/blob/master/Hunting MindMaps/PNG/Windows Processes TH.map.png", "https://www.andreafortuna.org/2017/06/15/standard-windows-processes-a-brief-reference/"]

# - max_signals: 33

- risk_score: 47

- rule_id: "35df0dd8-092d-4a83-88c1-5151a804f31b"

- severity: "medium"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1055",
        name : "Process Injection",
        reference : "https://attack.mitre.org/techniques/T1055/",
        subtechnique: [
          [id : "T1055.012",        
          name : "Process Hollowing",        
          reference : "https://attack.mitre.org/techniques/T1055/012/"]
        ]
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]
name: "Unusual Parent-Child Relationship"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "process where event.type in (\"start\", \"process_started\") and
    process.parent.name != null and
    (
      /* suspicious parent processes */
      (process.name:\"autochk.exe\" and not process.parent.name:\"smss.exe\") or
      (process.name:(\"fontdrvhost.exe\", \"dwm.exe\") and not process.parent.name:(\"wininit.exe\", \"winlogon.exe\")) or
      (process.name:(\"consent.exe\", \"RuntimeBroker.exe\", \"TiWorker.exe\") and not process.parent.name:\"svchost.exe\") or
      (process.name:\"SearchIndexer.exe\" and not process.parent.name:\"services.exe\") or
      (process.name:\"SearchProtocolHost.exe\" and not process.parent.name:(\"SearchIndexer.exe\", \"dllhost.exe\")) or
      (process.name:\"dllhost.exe\" and not process.parent.name:(\"services.exe\", \"svchost.exe\")) or
      (process.name:\"smss.exe\" and not process.parent.name:(\"System\", \"smss.exe\")) or
      (process.name:\"csrss.exe\" and not process.parent.name:(\"smss.exe\", \"svchost.exe\")) or
      (process.name:\"wininit.exe\" and not process.parent.name:\"smss.exe\") or
      (process.name:\"winlogon.exe\" and not process.parent.name:\"smss.exe\") or
      (process.name:(\"lsass.exe\", \"LsaIso.exe\") and not process.parent.name:\"wininit.exe\") or
      (process.name:\"LogonUI.exe\" and not process.parent.name:(\"wininit.exe\", \"winlogon.exe\")) or
      (process.name:\"services.exe\" and not process.parent.name:\"wininit.exe\") or
      (process.name:\"svchost.exe\" and not process.parent.name:(\"MsMpEng.exe\", \"services.exe\")) or
      (process.name:\"spoolsv.exe\" and not process.parent.name:\"services.exe\") or
      (process.name:\"taskhost.exe\" and not process.parent.name:(\"services.exe\", \"svchost.exe\")) or
      (process.name:\"taskhostw.exe\" and not process.parent.name:(\"services.exe\", \"svchost.exe\")) or
      (process.name:\"userinit.exe\" and not process.parent.name:(\"dwm.exe\", \"winlogon.exe\")) or
      (process.name:(\"wmiprvse.exe\", \"wsmprovhost.exe\", \"winrshost.exe\") and not process.parent.name:\"svchost.exe\") or
      /* suspicious child processes */
      (process.parent.name:(\"SearchProtocolHost.exe\", \"taskhost.exe\", \"csrss.exe\") and not process.name:(\"werfault.exe\", \"wermgr.exe\", \"WerFaultSecure.exe\")) or
      (process.parent.name:\"autochk.exe\" and not process.name:(\"chkdsk.exe\", \"doskey.exe\", \"WerFault.exe\")) or
      (process.parent.name:\"smss.exe\" and not process.name:(\"autochk.exe\", \"smss.exe\", \"csrss.exe\", \"wininit.exe\", \"winlogon.exe\", \"setupcl.exe\", \"WerFault.exe\")) or
      (process.parent.name:\"wermgr.exe\" and not process.name:(\"WerFaultSecure.exe\", \"wermgr.exe\", \"WerFault.exe\")) or
      (process.parent.name:\"conhost.exe\" and not process.name:(\"mscorsvw.exe\", \"wermgr.exe\", \"WerFault.exe\", \"WerFaultSecure.exe\"))
      )"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
