ANPdata:
- creation_date = "2021/8/11"
- maturity = "production"
# - query_schema_validation = false
- updated_date = "2021/8/11"
# - min_stack_version = "7.12.0"
ANPrule:
- author: ["Elastic"]

- description: "Detects attempts to exploit privilege escalation vulnerabilities related to the Print Spooler service including
    CVE-2020-1048 and CVE-2020-1337."

# - false_positives:  ["""Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as
    # manufacturer and signature information."""]

# - interval: "60m"

- language: "eql"

- license: "Elastic License v2"

- note: "## Threat intel Refer to CVEs, CVE-2020-1048 and CVE-2020-1337 for further information on the vulnerability and exploit. Verify that the relevant system is patched."

- references: ["https://safebreach.com/Post/How-we-bypassed-CVE-2020-1048-Patch-and-got-CVE-2020-1337"]

# - max_signals: 33

- risk_score: 73

- rule_id: "a7ccae7b-9d2c-44b2-a061-98e5946971fa"

- severity: "high"

- tags: ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]

- type: "eql"
- threat: [

    [framework : "MITRE ATT&CK",
      technique: [
        id : "T1068",
        name : "Exploitation for Privilege Escalation",
        reference : "https://attack.mitre.org/techniques/T1068/"
      ],
      tactic: [
        id : "TA0004",
        name : "Privilege Escalation",
        reference : "https://attack.mitre.org/tactics/TA0004/"]]
  ]
name: "Suspicious PrintSpooler SPL File Created"
index: anp-log-agentbase-winclient
type: any
eql:
  "query": "file where event.type != \"deletion\" and
    file.extension : \"spl\" and
    file.path : \"?:\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\*\" and
    not process.name : (\"spoolsv.exe\",
                        \"printfilterpipelinesvc.exe\",
                        \"PrintIsolationHost.exe\",
                        \"splwow64.exe\",
                        \"msiexec.exe\",
                        \"poqexec.exe\")"

  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
