ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Adversaries may collect keychain storage data from a system to in order to acquire credentials. Keychains are the
    built-in way for macOS to keep track of users' passwords and credentials for many services and features, including Wi-Fi
    and website passwords, secure notes, certificates, and Kerberos."""

- false_positives = ["Applications for password management."]

- language = "eql"

- license = "Elastic License v2"

- references = [     "https://www.netmeister.org/blog/keychain-passwords.html",    "https://github.com/priyankchheda/chrome_password_grabber/blob/master/chrome.py",    "https://ss64.com/osx/security.html",    "https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/"]

- risk_score = 73

- rule_id =  "9092cd6c-650f-4fa3-8a8a-28256c7489c9"

- severity = "high"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "eql"

name: "Keychain Password Retrieval via Command Line"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type == \"start\" and\n process.name : \"security\" and process.args : \"-wa\" and process.args : (\"find-generic-password\", \"find-internet-password\") and\n process.args : (\"Chrome*\", \"Chromium\", \"Opera\", \"Safari*\", \"Brave\", \"Microsoft Edge\", \"Edge\", \"Firefox*\") and\n not process.parent.executable : \"/Applications/Keeper Password Manager.app/Contents/Frameworks/Keeper Password Manager Helper*/Contents/MacOS/Keeper Password Manager Helper*\""

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1555"
      - name = "Credentials from Password Stores"
      - reference = "https://attack.mitre.org/techniques/T1555/"
      - subtechnique01:
        - id = "T1555.001"
        - name = "Keychain"
        - reference = "https://attack.mitre.org/techniques/T1555/001/"
      - subtechnique02:
        - id = "T1555.003"
        - name = "Credentials from Web Browsers"
        - reference = "https://attack.mitre.org/techniques/T1555/003/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
