ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the use of osascript to execute scripts via standard input that may prompt a user with a rogue dialog for
    credentials."""

- language = "eql"

- license = "Elastic License v2"

- references = [    "https://github.com/EmpireProject/EmPyre/blob/master/lib/modules/collection/osx/prompt.py","https://ss64.com/osx/osascript.html"]

- risk_score = 73

- rule_id =  "38948d29-3d5d-42e3-8aec-be832aaaf8eb"

- severity = "high"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "eql"

name: "Prompt for Credentials with OSASCRIPT"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and process.name : \"osascript\" and\n process.command_line : \"osascript*display dialog*password*\""

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1056"
      - name = "Input Capture"
      - reference = "https://attack.mitre.org/techniques/T1056/"
      - subtechnique:
        - id = "T1056.002"
        - name = "GUI Input Capture"
        - reference = "https://attack.mitre.org/techniques/T1056/002/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
