ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Keychains are the built-in way for macOS to keep track of users' passwords and credentials for many services and
    features, including Wi-Fi and website passwords, secure notes, certificates, and Kerberos. Adversaries may collect the
    keychain storage data from a system to acquire credentials."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://github.com/AlessandroZ/LaZagne/blob/master/Mac/lazagne/softwares/system/chainbreaker.py"]

- risk_score = 73

- rule_id =  "d75991f2-b989-419d-b797-ac1e54ec2d61"

- severity = "high"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "query"

name: "SystemKey Access via Command Line"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n  process.args:\"/private/var/db/SystemKey\""}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1555"
      - name = "Credentials from Password Stores"
      - reference = "https://attack.mitre.org/techniques/T1555/"
      - subtechnique:
        - id = "T1555.001"
        - name = "Keychain"
        - reference = "https://attack.mitre.org/techniques/T1555/001/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
