ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the execution of a process with arguments pointing to known browser files that store passwords and cookies.
    Adversaries may acquire credentials from web browsers by reading files specific to the target browser."""

- language = "eql"

- license = "Elastic License v2"

- references = ["https://securelist.com/calisto-trojan-for-macos/86543/"]

- risk_score = 73

- rule_id =  "20457e4f-d1de-4b92-ae69-142e27a4342a"

- severity = "high"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "eql"

name: "Access of Stored Browser Credentials"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.args :    (      \"/Users/*/Library/Application Support/Google/Chrome/Default/Login Data\",       \"/Users/*/Library/Application Support/Google/Chrome/Default/Cookies\",       \"/Users/*/Library/Cookies*\",       \"/Users/*/Library/Application Support/Firefox/Profiles/*.default/cookies.sqlite\",       \"/Users/*/Library/Application Support/Firefox/Profiles/*.default/key*.db\",      \"/Users/*/Library/Application Support/Firefox/Profiles/*.default/logins.json\",       \"Login Data\",      \"Cookies.binarycookies\",       \"key4.db\",       \"key3.db\",       \"logins.json\",       \"cookies.sqlite\")"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1555"
      - name = "Credentials from Password Stores"
      - reference = "https://attack.mitre.org/techniques/T1555/"
      - subtechnique:
        - id = "T1555.003"
        - name = "Credentials from Web Browsers"
        - reference = "https://attack.mitre.org/techniques/T1555/003/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
