ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the execution of macOS built-in commands used to dump user account hashes. Adversaries may attempt to dump
    credentials to obtain account login information in the form of a hash. These hashes can be cracked or leveraged for
    lateral movement."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://apple.stackexchange.com/questions/186893/os-x-10-9-where-are-password-hashes-stored",    "https://www.unix.com/man-page/osx/8/mkpassdb/"]

- risk_score = 73

- rule_id =  "02ea4563-ec10-4974-b7de-12e65aa4f9b3"

- severity = "high"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "query"

name: "Dumping Account Hashes via Built-In Commands"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:process and event.type:start and\n process.name:(defaults or mkpassdb) and process.args:(ShadowHashData or \"-dump\")"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1003"
      - name = "OS Credential Dumping"
      - reference = "https://attack.mitre.org/techniques/T1003/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
