ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies a high number (20) of macOS SSH KeyGen process executions from the same host. An adversary may attempt a
    tack to obtain unauthorized access to user accounts."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://themittenmac.com/detecting-ssh-activity-via-process-monitoring/"]

- risk_score = 47

- rule_id =  "ace1e989-a541-44df-93a8-a8b0591b63c0"

- severity = "medium"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "threshold"

name: "Potential SSH Brute Force Detected"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:process and event.type:start and process.name:\"sshd-keygen-wrapper\" and process.parent.name:launchd"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1110"
      - name = "Brute Force"
      - reference = "https://attack.mitre.org/techniques/T1110/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.threshold]
field = ["host.id"]
value = 20

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
