ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the use of the Kerberos credential cache (kcc) utility to dump locally cached Kerberos tickets."""

- language = "kuery"

- license = "Elastic License v2"

- references = [ "https://github.com/EmpireProject/EmPyre/blob/master/lib/modules/collection/osx/kerberosdump.py",    "https://opensource.apple.com/source/Heimdal/Heimdal-323.12/kuser/kcc-commands.in.auto.html"]

- risk_score = 73

- rule_id =  "ad88231f-e2ab-491c-8fc6-64746da26cfe"

- severity = "high"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "query"

name: "Kerberos Cached Credentials Dumping"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n  process.name:kcc and\n  process.args:copy_cred_cache"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1003"
      - name = "OS Credential Dumping"
      - reference = "https://attack.mitre.org/techniques/T1003/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
