ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Adversaries may collect the keychain storage data from a system to acquire credentials. Keychains are the built-in way
    for macOS to keep track of users' passwords and credentials for many services and features such as WiFi passwords,
    websites, secure notes and certificates."""

- language = "eql"

- license = "Elastic License v2"

- references = [    "https://objective-see.com/blog/blog_0x25.html",    "https://securelist.com/calisto-trojan-for-macos/86543/"]

- risk_score = 73

- rule_id =  "96e90768-c3b7-4df6-b5d9-6237f8bc36a8"

- severity = "high"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "eql"

name: "Access to Keychain Credentials Directories"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql:
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.args :    (      \"/Users/*/Library/Keychains/*\",      \"/Library/Keychains/*\",      \"/Network/Library/Keychains/*\",      \"System.keychain\",      \"login.keychain-db\",      \"login.keychain\"    ) and\n    not process.args : (\"find-certificate\",                      \"add-trusted-cert\",                      \"set-keychain-settings\",                      \"delete-certificate\",                      \"/Users/*/Library/Keychains/openvpn.keychain-db\",                      \"show-keychain-info\",                      \"lock-keychain\",                      \"set-key-partition-list\",                      \"import\",                      \"find-identity\") and\n    not process.parent.executable : \"/Applications/OpenVPN Connect/OpenVPN Connect.app/Contents/MacOS/OpenVPN Connect\""

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1555"
      - name = "Credentials from Password Stores"
      - reference = "https://attack.mitre.org/techniques/T1555/"
      - subtechnique:
        - id = "T1555.001"
        - name = "Keychain"
        - reference = "https://attack.mitre.org/techniques/T1555/001/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
