ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the use of the built-in networksetup command to configure webproxy settings. This may indicate an attempt to
    hijack web browser traffic for credential access via traffic sniffing or redirection."""

- false_positives = ["Legitimate WebProxy Settings Modification"]

- language = "kuery"

- license = "Elastic License v2"

- references = [ "https://unit42.paloaltonetworks.com/mac-malware-steals-cryptocurrency-exchanges-cookies/","https://objectivebythesea.com/v2/talks/OBTS_v2_Zohar.pdf"]

- risk_score = 47

- rule_id =  "10a500bb-a28f-418e-ba29-ca4c8d1a9f2f"

- severity = "medium"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]

- type = "query"

name: "WebProxy Settings Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category : process and event.type : start and\n process.name : networksetup and process.args : ((\"-setwebproxy\" or \"-setsecurewebproxy\" or \"-setautoproxyurl\") and not (Bluetooth or off)) and\n not process.parent.executable : (\"/Library/PrivilegedHelperTools/com.80pct.FreedomHelper\" or\n                                  \"/Applications/Fiddler Everywhere.app/Contents/Resources/app/out/WebServer/Fiddler.WebUi\" or\n                                  \"/usr/libexec/xpcproxy\")"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1539"
      - name = "Steal Web Session Cookie"
      - reference = "https://attack.mitre.org/techniques/T1539/"
    - tactic:
      - id = "TA0006"
      - name =  "Credential Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
