ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the creation of a suspicious zip file prepended with special characters. Sandboxed Microsoft Office
    applications on macOS are allowed to write files that start with special characters, which can be combined with an
    AutoStart location to achieve sandbox evasion."""

- language = "kuery"

- license = "Elastic License v2"

- references = [ "https://i.blackhat.com/USA-20/Wednesday/us-20-Wardle-Office-Drama-On-macOS.pdf",    "https://www.mdsec.co.uk/2018/08/escaping-the-sandbox-microsoft-office-on-macos/",    "https://desi-jarvis.medium.com/office365-macos-sandbox-escape-fcce4fa4123c"]

- risk_score = 73

- rule_id = "d22a85c6-d2ad-4cc4-bf7b-54787473669a"

- severity = "high"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Defense Evasion"]

- type = "query"

name: "Potential Microsoft Office Sandbox Evasion"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category: file and not event.type: deletion and file.name: \"~$*.zip\""}}

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
