ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Detects attempts to disable Gatekeeper on macOS. Gatekeeper is a security feature that's designed to ensure that only
    trusted software is run. Adversaries may attempt to disable Gatekeeper before executing malicious code."""

- language = "kuery"

- license = "Elastic License v2"

- references = [ "https://support.apple.com/en-us/HT202491",    "https://www.carbonblack.com/blog/tau-threat-intelligence-notification-new-macos-malware-variant-of-shlayer-osx-discovered/"]

- risk_score = 47

- rule_id =  "4da13d6e-904f-4636-81d8-6ab14b4e6ae9"

- severity = "medium"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Defense Evasion"]

- type = "query"

name: "Attempt to Disable Gatekeeper"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and \n  process.args:(spctl and \"--master-disable\")"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1553"
      - name = "Subvert Trust Controls"
      - reference = "https://attack.mitre.org/techniques/T1553/"
    - tactic:
      - id = "TA0005"
      - name =  "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
