ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies attempts to execute a child process from within the context of an Electron application using the
    child_process Node.js module. Adversaries may abuse this technique to inherit permissions from parent processes."""

- language = "kuery"

- license = "Elastic License v2"

- references = [    "https://www.matthewslipper.com/2019/09/22/everything-you-wanted-electron-child-process.html",    "https://www.trustedsec.com/blog/macos-injection-via-third-party-frameworks/",    "https://nodejs.org/api/child_process.html"]

- risk_score = 47

- rule_id = "35330ba2-c859-4c98-8b7f-c19159ea0e58"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Defense Evasion", "Execution"]

- type = "query"

name: "Enumeration of Users or Groups via Built-in Commands"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and process.args:(\"-e\" and const*require*child_process*)"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
    - tactic:
      - id = "TA0002"
      - name =  "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1548"
      - name = "Abuse Elevation Control Mechanism"
      - reference = "https://attack.mitre.org/techniques/T1548/"
    - tactic:
      - id = "TA0005"
      - name =  "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
