ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the execution of the shell process (sh) via scripting (JXA or AppleScript). Adversaries may use the
    doShellScript functionality in JXA or do shell script in AppleScript to execute system commands."""

- language = "eql"

- license = "Elastic License v2"

- references = ["https://developer.apple.com/library/archive/technotes/tn2065/_index.html", "https://objectivebythesea.com/v2/talks/OBTS_v2_Thomas.pdf"]

- risk_score = 47

- rule_id = "d461fac0-43e8-49e2-85ea-3a58fe120b4f"

- severity = "medium"

- tags =  ["Elastic", "Host", "macOS", "Threat Detection", "Execution"]

- type = "eql"

name: "Shell Execution via Apple Scripting"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql: 
  "query": "sequence by host.id with maxspan=5s [process where event.type in (\"start\", \"process_started\", \"info\") and process.name == \"osascript\"] by process.pid [process where event.type in (\"start\", \"process_started\") and process.name == \"sh\" and process.args == \"-c\"] by process.parent.pid"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
    - tactic:
      - id = "TA0002"
      - name =  "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
