ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies when the built in macOS Installer program generates a network event after attempting to install a .pkg file.
    This activity has been observed being leveraged by malware."""

- false_positives = [    """    Custom organization-specific macOS packages that use .pkg files to run cURL could trigger this rule. If known behavior is causing false positives, it can be excluded from the rule.    """]

- language = "eql"

- license = "Elastic License v2"

- references = [  "https://redcanary.com/blog/clipping-silver-sparrows-wings",    "https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score = 47

- rule_id = "99239e7d-b0d4-46e3-8609-acafcf99f68c"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Execution"]

- type = "eql"

name: "macOS Installer Spawns Network Event"

index: ["logs-endpoint.events.*"]

type: any

eql: 
  "query": "sequence by process.entity_id with maxspan=1m  [process where event.type == \"start\" and host.os.family == \"macos\" and\n    process.parent.executable in (\"/usr/sbin/installer\", \"/System/Library/CoreServices/Installer.app/Contents/MacOS/Installer\") ]  [network where not cidrmatch(destination.ip,    \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\", \"192.0.0.0/29\", \"192.0.0.8/32\",    \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\", \"192.31.196.0/24\",    \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\", \"192.175.48.0/24\",    \"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\", \"FE80::/10\", \"FF00::/8\")]"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
      - subtechnique:
        - id = "T1059.007"
        - name = "JavaScript"
        - reference = "https://attack.mitre.org/techniques/T1059/007/"
    - tactic:
      - id = "TA0002"
      - name =  "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1071"
      - name = "Application Layer Protocol"
      - reference = "https://attack.mitre.org/techniques/T1071/"
      - subtechnique:
        - id = "T1071.001""
        - name = "Web Protocols"
        - reference = "https://attack.mitre.org/techniques/T1071/001/"
    - tactic:
      - id = "TA0011"
      - name = "Command and Control"
      - reference = "https://attack.mitre.org/tactics/TA0011/"
      
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
