ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies use of Bifrost, a known macOS Kerberos pentesting tool, which can be used to dump cached Kerberos tickets or
    attempt unauthorized authentication techniques such as pass-the-ticket/hash and kerberoasting."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://github.com/its-a-feature/bifrost"]

- risk_score = 73

- rule_id = "16904215-2c95-4ac8-bf5c-12354e047192"

- severity = "high"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access", "Lateral Movement"]

- type = "query"

name: "Potential Kerberos Attack via Bifrost"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:process and event.type:start and \n process.args:(\"-action\" and (\"-kerberoast\" or askhash or asktgs or asktgt or s4u or (\"-ticket\" and ptt) or (dump and (tickets or keytab))))"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1550"
      - name = "Use Alternate Authentication Material"
      - reference = "https://attack.mitre.org/techniques/T1550/"
      - subtechnique:
        - id = "T1550.003"
        - name = "Pass the Ticket"
        - reference = "https://attack.mitre.org/techniques/T1550/003/"
    - tactic:
      - id = "TA0006"
      - name = "Initial Access"
      - reference = "https://attack.mitre.org/tactics/TA0006/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
