ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the execution of macOS built-in commands to connect to an existing Virtual Private Network (VPN)."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://github.com/rapid7/metasploit-framework/blob/master/modules/post/osx/manage/vpn.rb",    "https://www.unix.com/man-page/osx/8/networksetup/",    "https://superuser.com/questions/358513/start-configured-vpn-from-command-line-osx"]

- risk_score = 21

- rule_id = "15dacaa0-5b90-466b-acab-63435a59701a"

- severity = "low"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Lateral Movement"]

- type = "query"

name: "Virtual Private Network Connection Attempt"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "process where event.type in (\"start\", \"process_started\") and\n  (    (process.name : \"networksetup\" and process.args : \"-connectpppoeservice\") or\n    (process.name : \"scutil\" and process.args : \"--nc\" and process.args : \"start\") or\n    (process.name : \"osascript\" and process.command_line : \"osascript*set VPN to service*\"))"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1021"
      - name = "Remote Services"
      - reference = "https://attack.mitre.org/techniques/T1021/"
    - tactic:
      - id = "TA0008"
      - name = "Lateral Movement"
      - reference = "https://attack.mitre.org/tactics/TA0008/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
