ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the execution of macOS built-in commands to mount a Server Message Block (SMB) network share. Adversaries may
    use valid accounts to interact with a remote network share using SMB."""

- language = "eql"

- license = "Elastic License v2"

- references = ["https://www.freebsd.org/cgi/man.cgi?mount_smbfs", "https://ss64.com/osx/mount.html"]

- risk_score = 21

- rule_id = "661545b4-1a90-4f45-85ce-2ebd7c6a15d0"

- severity = "low"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Lateral Movement"]

- type = "eql"

name: "Attempt to Mount SMB Share via Command Line"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql: 
  "query": "process where event.type in (\"start\", \"process_started\") and\n  (    process.name : \"mount_smbfs\" or\n    (process.name : \"open\" and process.args : \"smb://*\") or\n    (process.name : \"mount\" and process.args : \"smbfs\") or\n    (process.name : \"osascript\" and process.command_line : \"osascript*mount volume*smb://*\")  )"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1021"
      - name = "Remote Services"
      - reference = "https://attack.mitre.org/techniques/T1021/"
      - subtechnique:
        - id = "T1021.002"
        - name = "Pass the Ticket"
        - reference = "https://attack.mitre.org/techniques/T1021/002/"
    - tactic:
      - id = "TA0008"
      - name = "Lateral Movement"
      - reference = "https://attack.mitre.org/tactics/TA0008/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
