ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """An adversary can establish persistence by modifying an existing macOS dock property list in order to execute a malicious
    application instead of the intended one when invoked."""

- language = "kuery"

- license = "Elastic License v2"

- references = [""" https://github.com/specterops/presentations/raw/master/Leo    Pitt/Hey_Im_Still_in_Here_Modern_macOS_Persistence_SO-CON2020.pdf    """]

- risk_score = 47

- rule_id = "c81cefcb-82b9-4408-a533-3c3df549e62d"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]

- type = "query"

name:  "Persistence via Docker Shortcut Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category: file and event.action: modification and \n file.path: \"/Users/*/Library/Preferences/com.apple.dock.plist\" and \n not process.name: (xpcproxy or cfprefsd or plutil or jamf or PlistBuddy or InstallerRemotePluginService)"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1543"
      - name = "Create or Modify System Process"
      - reference = "https://attack.mitre.org/techniques/T1543/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
