ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the creation or modification of a DirectoryService PlugIns (dsplug) file. The DirectoryService daemonlaunches
    on each system boot and automatically reloads after crash. It scans and executes bundles that are located in the
    DirectoryServices PlugIns folder and can be abused by adversaries to maintain persistence."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://blog.chichou.me/2019/11/21/two-macos-persistence-tricks-abusing-plugins/"]

- risk_score = 47

- rule_id = "89fa6cb7-6b53-4de2-b604-648488841ab8"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]

- type = "query"

name: "Persistence via DirectoryService Plugin Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:file and not event.type:deletion and\n  file.path:/Library/DirectoryServices/PlugIns/*.dsplug"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1547"
      - name = "Boot or Logon Autostart Execution"
      - reference = "https://attack.mitre.org/techniques/T1547/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
