ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """A Folder Action script is executed when the folder to which it is attached has items added or removed, or when its
    window is opened, closed, moved, or resized. Adversaries may abuse this feature to establish persistence by utilizing a
    malicious script."""

- language = "eql"

- license = "Elastic License v2"

- references = ["https://posts.specterops.io/folder-actions-for-persistence-on-macos-8923f222343d"]

- risk_score = 47

- rule_id = "c292fa52-4115-408a-b897-e14f684b3cb7"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Execution", "Persistence"]

- type = "eql"

name: "Persistence via Folder Action Script"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql: 
  "query": "sequence by host.id with maxspan=5s [process where event.type in (\"start\", \"process_started\", \"info\") and process.name == \"com.apple.foundation.UserScriptService\"] by process.pid [process where event.type in (\"start\", \"process_started\") and process.name in (\"osascript\", \"sh\")] by process.parent.pid"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1037"
      - name = "Boot or Logon Initialization Scripts"
      - reference = "https://attack.mitre.org/techniques/T1037/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
    - tactic:
      - id = "TA0002"
      - name = "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
