ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the creation or modification of the Event Monitor Daemon (emond) rules. Adversaries may abuse this service by
    writing a rule to execute commands when a defined event occurs, such as system start up or user authentication."""

- language = "eql"

- license = "Elastic License v2"

- references = ["https://www.xorrior.com/emond-persistence/"]

- risk_score = 47

- rule_id =  "a6bf4dd4-743e-4da8-8c03-3ebd753a6c90"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]

- type = "eql"

name: "Emond Rules Creation or Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql: 
  "query": "file where event.type != \"deletion\" and\n file.path : (\"/private/etc/emond.d/rules/*.plist\", \"/etc/emon.d/rules/*.plist\")"
  
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1546"
      - name = "Event Triggered Execution"
      - reference = "https://attack.mitre.org/techniques/T1546/"
      - subtechnique:
        - id = "T1546.014"
        - name = "Emond"
        - reference = "https://attack.mitre.org/techniques/T1546/014/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
