ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Authorization plugins are used to extend the authorization services API and implement mechanisms that are not natively
    supported by the OS, such as multi-factor authentication with third party software. Adversaries may abuse this feature
    to persist and/or collect clear text credentials as they traverse the registered plugins during user logon."""

- language = "kuery"

- license = "Elastic License v2"

- references = [    "https://developer.apple.com/documentation/security/authorization_plug-ins",    "https://www.xorrior.com/persistent-credential-theft/"]

- risk_score = 47

- rule_id = "e6c98d38-633d-4b3e-9387-42112cd5ac10"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]

- type = "query"

name: "Authorization Plugin Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:file and not event.type:deletion and\n  file.path:(/Library/Security/SecurityAgentPlugins/* and\n  not /Library/Security/SecurityAgentPlugins/TeamViewerAuthPlugin.bundle/Contents/*)"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1547"
      - name = "Boot or Logon Autostart Execution"
      - reference = "https://attack.mitre.org/techniques/T1547/"
      - subtechnique: 
        - id = "T1547.002"
        - name =  "Authentication Package"
        - reference = "https://attack.mitre.org/techniques/T1547/002/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
