ANPdata:
- creation_date = "2021/08/09"
- maturity = "production"
- updated_date = "2021/08/09"

ANPrule:
- author = ["Elastic"]

- description = """Identifies suspicious modifications of the calendar file by an unusual process. Adversaries may create a custom calendar
    notification procedure to execute a malicious program at a recurring interval to establish persistence."""

- false_positives = ["Trusted applications for managing calendars and reminders."] 

- language = "kuery"

- license = "Elastic License v2"

- references = [ "https://labs.f-secure.com/blog/operationalising-calendar-alerts-persistence-on-macos",    "https://github.com/FSecureLABS/CalendarPersist",    "https://github.com/D00MFist/PersistentJXA/blob/master/CalendarPersist.js"]

- risk_score = 47

- rule_id = "cb71aa62-55c8-42f0-b0dd-afb0bb0b1f51"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]

- type = "query"

name: "Suspicious Calendar File Modification"

index: ["logs-endpoint.events.*", "auditbeat-*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:file and event.action:modification and\n  file.path:\"/Users/*/Library/Calendars/*.calendar/Events/*.ics\" and\n  process.executable:  (* and not\n     (      \"/System/Library/*\" or\n       \"/System/Applications/Calendar.app/Contents/MacOS/*\" or\n       \"/usr/libexec/xpcproxy\" or \n      \"/sbin/launchd\" or \n      \"/Applications/*\"    )  )"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1546"
      - name = "Event Triggered Execution"
      - reference = "https://attack.mitre.org/techniques/T1546/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
