ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """Identifies the execution of a launchd child process with a hidden file. An adversary can establish persistence by
    installing a new logon item, launch agent, or daemon that executes upon login."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://objective-see.com/blog/blog_0x61.html",    "https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/",    "https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html"]

- risk_score = 47

- rule_id = "083fa162-e790-4d85-9aeb-4fea04188adb"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence", "Defense Evasion"]

- type = "query"

name: "Suspicious Hidden Child Process of Launchd"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n process.name:.* and process.parent.executable:/sbin/launchd"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1543"
      - name = "Create or Modify System Process"
      - reference = "https://attack.mitre.org/techniques/T1543/"
      - subtechnique: 
        - id = "T1543.001"
        - name = "Launch Agent"
        - reference = "https://attack.mitre.org/techniques/T1543/001/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1564"
      - name = "Hide Artifacts"
      - reference = "https://attack.mitre.org/techniques/T1564/"
      - subtechnique: 
        - id = "T1564.001"
        - name = "Hidden Files and Directories"
        - reference = "https://attack.mitre.org/techniques/T1564/001/"
    - tactic:
      - id = "TA0005"
      - name = "Defense Evasion"
      - reference = "https://attack.mitre.org/tactics/TA0005/"
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
