ANPdata:
- creation_date = "2021/08/08"
- maturity = "production"
- updated_date = "2021/08/08"

ANPrule:
- author = ["Elastic"]

- description = """An adversary can establish persistence by installing a new launch agent that executes at login by using launchd or
    launchctl to load a plist into the appropriate directories."""

- false_positives = ["Trusted applications persisting via LaunchAgent"]

- language = "eql"

- license = "Elastic License v2"

- references = ["https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html"]

- risk_score = 21

- rule_id = "082e3f8c-6f80-485c-91eb-5b112cb79b28"

- severity = "low"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]

- type = "eql"

name: "Launch Agent Creation or Modification and Immediate Loading"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

eql: 
  "query": "sequence by host.id with maxspan=1m [file where event.type != \"deletion\" and \n  file.path : (\"/System/Library/LaunchAgents/*\", \"/Library/LaunchAgents/*\", \"/Users/*/Library/LaunchAgents/*\") ] [process where event.type in (\"start\", \"process_started\") and process.name == \"launchctl\" and process.args == \"load\"]"

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1543"
      - name = "Create or Modify System Process"
      - reference = "https://attack.mitre.org/techniques/T1543/"
      - subtechnique: 
        - id = "T1543.001"
        - name = "Launch Agent"
        - reference = "https://attack.mitre.org/techniques/T1543/001/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
