ANPdata:
- creation_date = "2021/08/09"
- maturity = "production"
- updated_date = "2021/08/09"

ANPrule:
- author = ["Elastic"]

- description = """Identifies modifications to the root crontab file. Adversaries may overwrite this file to gain code execution with root
    privileges by exploiting privileged file write or move related vulnerabilities."""

- language = "kuery"

- license = "Elastic License v2"

- references = [ "https://phoenhex.re/2017-06-09/pwn2own-diskarbitrationd-privesc",    "https://www.exploit-db.com/exploits/42146"]

- risk_score = 73

- rule_id = "0ff84c42-873d-41a2-a4ed-08d74d352d01"

- severity = "high"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Privilege Escalation"]

- type = "query"

name: "Privilege Escalation via Root Crontab File Modification"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:file and not event.type:deletion and\n file.path:/private/var/at/tabs/root and not process.executable:/usr/bin/crontab"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1053"
      - name = "Scheduled Task/Job"
      - reference = "https://attack.mitre.org/techniques/T1053/"
      - subtechnique: 
        - id = "T1053.003"
        - name = "Cron"
        - reference = "https://attack.mitre.org/techniques/T1053/003/"
    - tactic:
      - id = "TA0004"
      - name =  "Privilege Escalation"
      - reference = "https://attack.mitre.org/tactics/TA0004/"
      
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
