ANPdata:
- creation_date = "2021/08/09"
- maturity = "production"
- updated_date = "2021/08/09"

ANPrule:
- author = ["Elastic"]

- description = """Identifies attempts to add an account to the admin group via the command line. This could be an indication of privilege
    escalation activity."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://managingosx.wordpress.com/2010/01/14/add-a-user-to-the-admin-group-via-command-line-3-0/"]

- risk_score = 47

- rule_id = "565c2b44-7a21-4818-955f-8d4737967d2e"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Privilege Escalation"]

- type = "query"

name: "Potential Admin Group Account Addition"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
  "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n process.name:(dscl or dseditgroup) and process.args:((\"/Groups/admin\" or admin) and (\"-a\" or \"-append\"))"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1078"
      - name = "Valid Accounts"
      - reference = "https://attack.mitre.org/techniques/T1078/"
      - subtechnique: 
        - id = "T1078.003"
        - name = "Local Accounts"
        - reference = "https://attack.mitre.org/techniques/T1078/003/"
    - tactic:
      - id = "TA0004"
      - name =  "Privilege Escalation"
      - reference = "https://attack.mitre.org/tactics/TA0004/"
      
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
