ANPdata:
- creation_date = "2021/08/09"
- maturity = "production"
- updated_date = "2021/08/09"

ANPrule:
- author = ["Elastic"]

- description = """Identifies execution of the security_authtrampoline process via a scripting interpreter. This occurs when programs use
    AuthorizationExecute-WithPrivileges from the Security.framework to run another program with root privileges. It should
    not be run by itself, as this is a sign of execution with explicit logon credentials."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://objectivebythesea.com/v2/talks/OBTS_v2_Thomas.pdf",    "https://www.manpagez.com/man/8/security_authtrampoline/"]

- risk_score = 47

- rule_id = "f0eb70e9-71e9-40cd-813f-bf8e8c812cb1"

- severity = "medium"

- tags = ["Elastic", "Host", "macOS", "Threat Detection", "Execution", "Privilege Escalation"]

- type = "query"

name: "Execution with Explicit Credentials via Scripting"

index: ["auditbeat-*", "logs-endpoint.events.*"]

type: any

kql: 
    "query": {"query_string": {"query": "event.category:process and event.type:(start or process_started) and\n process.name:\"security_authtrampoline\" and\n process.parent.name:(osascript or com.apple.automator.runner or sh or bash or dash or zsh or python* or perl* or php* or ruby or pwsh)"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1078"
      - name = "Valid Accounts"
      - reference = "https://attack.mitre.org/techniques/T1078/"
    - tactic:
      - id = "TA0004"
      - name =  "Privilege Escalation"
      - reference = "https://attack.mitre.org/tactics/TA0004/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1059"
      - name = "Command and Scripting Interpreter"
      - reference = "https://attack.mitre.org/techniques/T1059/"
    - tactic:
      - id = "TA0002"
      - name =  "Execution"
      - reference = "https://attack.mitre.org/tactics/TA0002/"
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
