ANPdata:
- creation_date = "2021/08/07"
- maturity = "production"
- updated_date = "2021/08/07"

ANPrule:
- author = ["Elastic"]

- description = """Elastic Endgame detected Credential Dumping. Click the Elastic Endgame icon in the event.module column or the link
    in the rule.reference column for additional information."""

- interval = "10m"

- language = "kuery"

- license = "Elastic License v2"

- risk_score = 73

- rule_id =  "571afc56-5ed9-465d-a2a9-045f099f6e7e"

- severity = "high"

- tags = ["Elastic", "Elastic Endgame"]

- type = "query"

name: "Credential Dumping - Detected - Elastic Endgame"

index: ["endgame-*"]

type: any

kql:
  "query": {"query_string": {"query": "event.kind:alert and event.module:endgame and endgame.metadata.type:detection and (event.action:cred_theft_event or endgame.event_subtype_full:cred_theft_event)"}}


alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
