ANPdata:
- creation_date = "2021/08/07"
- maturity = "production"
- updated_date = "2021/08/07"

ANPrule:
- author = ["Elastic"]

- description = """Elastic Endgame prevented Ransomware. Click the Elastic Endgame icon in the event.module column or the link in the
    rule.reference column for additional information.."""

- interval = "10m"

- language = "kuery"

- license = "Elastic License v2"

- risk_score = 73

- rule_id =  "e3c5d5cb-41d5-4206-805c-f30561eae3ac"

- severity = "high"

- tags = ["Elastic", "Elastic Endgame"]

- type = "query"

name: "Ransomware - Prevented - Elastic Endgame"

index: ["endgame-*"]

type: any

kql:
  "query": {"query_string": {"query": "event.kind:alert and event.module:endgame and endgame.metadata.type:prevention and (event.action:ransomware_event or endgame.event_subtype_full:ransomware_event)"}}


alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
