ANPdata:
- creation_date = "2021/08/07"
- maturity = "production"
- updated_date = "2021/08/07"

ANPrule:
- author = ["Elastic"]

- description = """Generates a detection alert for each external alert written to the configured indices. Enabling this rule allows you to
    immediately begin investigating external alerts in the app."""

- enabled = true

- language = "kuery"

- license = "Elastic License v2"

- max_signals = 10000

- risk_score = 47

- rule_id =  "eb079c62-4481-4d6e-9643-3ca499df7aaa"

- rule_name_override = "message"

- severity = "medium"

- tags = ["Elastic", "Network", "Windows", "APM", "macOS", "Linux"]

- type = "query"

name: "External Alerts"

index: ["apm-*-transaction*", "traces-apm*", "auditbeat-*", "filebeat-*", "logs-*", "packetbeat-*", "winlogbeat-*"]

type: any

kql:
  "query": {"query_string": {"query": "event.kind:alert and not event.module:(endgame or endpoint)"}}


risk_score_mapping:
- field = "event.risk_score"
- operator = "equals"
- value = ""
severity_mapping:
- 01:
  - field = "event.severity"
  - operator = "equals"
  - value = "21"
  - severity = "low"
- 02:
  - field = "event.severity"
  - operator = "equals"
  - value = "47"
  - severity = "medium"
- 03:
  - field = "event.severity"
  - operator = "equals"
  - value = "73"
  - severity = "high"
- 04:
  - field = "event.severity"
  - operator = "equals"
  - value = "99"
  - severity = "critical"


alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
