ANPdata:
- creation_date = "2021/07/31"
- maturity = "production"
- updated_date = "2021/07/31"

ANPrule:
- author = ["Elastic"]

- description = """
    Detects a Roshal Archive (RAR) file or PowerShell script downloaded from the internet by an internal host. Gaining
    initial access to a system and then downloading encoded or encrypted tools to move laterally is a common practice for
    adversaries as a way to protect their more valuable tools and TTPs. This may be atypical behavior for a managed network
    and can be indicative of malware, exfiltration, or command and control."""

- false_positives = ["""Downloading RAR or PowerShell files from the Internet may be expected for certain systems. This rule should be tailored to either exclude systems as sources or destinations in which this behavior is expected."""

- language = "lucene"

- license = "Elastic License v2"

- note = """## Threat intel. This activity has been observed in FIN7 campaigns."""

- references = ["https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html", "https://www.justice.gov/opa/press-release/file/1084361/download","https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score = 47

- rule_id = "ff013cb4-274d-434a-96bb-fe15ddd3ae92"

- severity = "medium"

- tags = ["Elastic", "Network", "Threat Detection", "Command and Control", "Host"]

- type = "query"

name: "Roshal Archive (RAR) or PowerShell File Downloaded from the Internet"

index: ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:(network or network_traffic) and network.protocol:http and\n  (url.extension:(ps1 or rar) or url.path:(*.ps1 or *.rar)) and\n    not destination.ip:(      \"10.0.0.0/8\" or\n      \"127.0.0.0/8\" or\n      \"169.254.0.0/16\" or\n      \"172.16.0.0/12\" or\n      \"192.0.0.0/24\" or\n      \"192.0.0.0/29\" or\n      \"192.0.0.8/32\" or\n      \"192.0.0.9/32\" or\n      \"192.0.0.10/32\" or\n      \"192.0.0.170/32\" or\n      \"192.0.0.171/32\" or\n      \"192.0.2.0/24\" or\n      \"192.31.196.0/24\" or\n      \"192.52.193.0/24\" or\n      \"192.168.0.0/16\" or\n      \"192.88.99.0/24\" or\n      \"224.0.0.0/4\" or\n      \"100.64.0.0/10\" or\n      \"192.175.48.0/24\" or\n      \"198.18.0.0/15\" or\n      \"198.51.100.0/24\" or\n      \"203.0.113.0/24\" or\n      \"240.0.0.0/4\" or\n      \"::1\" or\n      \"FE80::/10\" or\n      \"FF00::/8\"    ) and\n    source.ip:(      \"10.0.0.0/8\" or\n      \"172.16.0.0/12\" or\n      \"192.168.0.0/16\"    )"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1105"
      - name = "Ingress Tool Transfer"
      - reference = "https://attack.mitre.org/techniques/T1105/"
    - tactic:
      - id = "TA0011"
      - name = "Command and Control"
      - reference = "https://attack.mitre.org/tactics/TA0011/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
