ANPdata:
- creation_date = "2021/07/31"
- maturity = "production"
- updated_date = "2021/07/31"

ANPrule:
- author = ["Elastic"]

- description = """
    Halfbaked is a malware family used to establish persistence in a contested network. This rule detects a network activity
    algorithm leveraged by Halfbaked implant beacons for command and control."""

- false_positives = ["""    This rule should be tailored to exclude systems, either as sources or destinations, in which this behavior is expected."""]

- language = "lucene"

- license = "Elastic License v2"

- note = """## Threat intel. This activity has been observed in FIN7 campaigns."""

- references = ["https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html", "https://attack.mitre.org/software/S0151/"]

- risk_score = 73

- rule_id = "2e580225-2a58-48ef-938b-572933be06fe"

- severity = "high"

- tags = ["Elastic", "Network", "Threat Detection", "Command and Control", "Host"]

- type = "query"

name: "Halfbaked Command and Control Beacon"

index: ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]

type: any

kql:
    "query": {"query_string": {"query": "event.category:(\"network\" or \"network_traffic\") and network.protocol: \"http\" and\n  network.transport: \"tcp\" and url.full: \"/http:\/\/[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}\/cd/\" and\n  destination.port:(\"53\" or \"80\" or \"8080\" or \"443\")"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique1:
      - id = "T1071"
      - name = "Application Layer Protocol"
      - reference = "https://attack.mitre.org/techniques/T1071/"
    - technique1:
      - id = "T1568"
      - name = "Dynamic Resolution"
      - reference = "https://attack.mitre.org/tactics/T1568/"
      - subtechnique:
        - id = "T1568.002"
        - name = "Domain Generation Algorithms"
        - reference = "https://attack.mitre.org/techniques/T1568/002/"
    - tactic:
      - id = "TA0011"
      - name = "Command and Control"
      - reference = "https://attack.mitre.org/tactics/TA0011/"
      
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
