ANPdata:
- creation_date = "2021/07/31"
- maturity = "production"
- updated_date = "2021/07/31"

ANPrule:
- author = ["Elastic"]

- description = """
    This rule detects when an internal network client sends DNS traffic directly to the Internet. This is atypical behavior
    for a managed network, and can be indicative of malware, exfiltration, command and control, or simply,
    misconfiguration. This DNS activity also impacts your organization's ability to provide enterprise monitoring and
    logging of DNS and opens your network to a variety of abuses and malicious communications."""

- false_positives = ["""
    Exclude DNS servers from this rule as this is expected behavior. Endpoints usually query local DNS servers defined
    in their DHCP scopes, but this may be overridden if a user configures their endpoint to use a remote DNS server.
    This is uncommon in managed enterprise networks because it could break intranet name resolution when split horizon
    DNS is utilized. Some consumer VPN services and browser plug-ins may send DNS traffic to remote Internet
    destinations. In that case, such devices or networks can be excluded from this rule when this is expected behavior."""]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://www.us-cert.gov/ncas/alerts/TA15-240A", "https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-81-2.pdf","https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score = 47

- rule_id = "6ea71ff0-9e95-475b-9506-2580d1ce6154"

- severity = "medium"

- tags = ["Elastic", "Network", "Threat Detection", "Command and Control", "Host"]

- type = "query"

name: "DNS Activity to the Internet"

index: ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:(network or network_traffic) and (event.type:connection or type:dns) and (destination.port:53 or event.dataset:zeek.dns)  and source.ip:(    10.0.0.0/8 or\n    172.16.0.0/12 or\n    192.168.0.0/16  ) and\n  not destination.ip:(    10.0.0.0/8 or\n    127.0.0.0/8 or\n    169.254.0.0/16 or\n    172.16.0.0/12 or\n    192.0.0.0/24 or\n    192.0.0.0/29 or\n    192.0.0.8/32 or\n    192.0.0.9/32 or\n    192.0.0.10/32 or\n    192.0.0.170/32 or\n    192.0.0.171/32 or\n    192.0.2.0/24 or\n    192.31.196.0/24 or\n    192.52.193.0/24 or\n    192.168.0.0/16 or\n    192.88.99.0/24 or\n    224.0.0.0/4 or\n    100.64.0.0/10 or\n    192.175.48.0/24 or\n    198.18.0.0/15 or\n    198.51.100.0/24 or\n    203.0.113.0/24 or\n    240.0.0.0/4 or\n    \"::1\" or\n    \"FE80::/10\" or\n    \"FF00::/8\"  )"}}

threat:
  - 01:
    - tactic:
      - id = "TA0011"
      - name = "Command and Control"
      - reference = "https://attack.mitre.org/tactics/TA0011/"

alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
