ANPdata:
- creation_date = "2021/07/31"
- maturity = "production"
- updated_date = "2021/07/31"

ANPrule:
- author = ["Elastic"]

- description = """
    This rule detects network events that may indicate the use of Telnet traffic. Telnet is commonly used by system
    administrators to remotely control older or embedded systems using the command line shell. It should almost never be
    directly exposed to the Internet, as it is frequently targeted and exploited by threat actors as an initial access or
    backdoor vector. As a plain-text protocol, it may also expose usernames and passwords to anyone capable of observing
    the traffic."""

- false_positives = [""" IoT (Internet of Things) devices and networks may use telnet and can be excluded if desired. Some business
    work-flows may use Telnet for administration of older devices. These often have a predictable behavior. Telnet
    activity involving an unusual source or destination may be more suspicious. Telnet activity involving a production
    server that has no known associated Telnet work-flow or business requirement is often suspicious."""]

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score = 47

- rule_id =  "34fde489-94b0-4500-a76f-b8a157cf9269"

- severity = "medium"

- tags = ["Elastic", "Host", "Network", "Threat Detection", "Command and Control", "Host"]

- type = "query"

name: "RDP (Remote Desktop Protocol) from the Internet"

index: ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:(network or network_traffic) and network.transport:tcp and destination.port:23"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - tactic:
      - id = "TA0011"
      - name = "Command and Control"
      - reference = "https://attack.mitre.org/tactics/TA0011/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1021"
      - name = "Remote Services"
      - reference = "https://attack.mitre.org/techniques/T1021/"
    - tactic:
      - id = "TA0008"
      - name = "Lateral Movement"
      - reference = "https://attack.mitre.org/tactics/TA0008/"
  - 03:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1190"
      - name = "Exploit Public-Facing Application"
      - reference = "https://attack.mitre.org/techniques/T1190/"
    - tactic:
      - id = "TA0001"
      - name = "Initial Access"
      - reference = "https://attack.mitre.org/tactics/TA0001/"
      
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
