ANPdata:
- creation_date = "2021/08/07"
- maturity = "production"
- updated_date = "2021/08/07"

ANPrule:
- author : ["Elastic"]

- description : |
    Identifies Elasticsearch nodes that do not have Transport Layer Security (TLS), and/or lack authentication, and are
    accepting inbound network connections over the default Elasticsearch port."""

- false_positives : |
    If you have front-facing proxies that provide authentication and TLS, this rule would need to be tuned to eliminate the source IP address of your reverse-proxy.    """]

- language : "lucene"

- license : "Elastic License v2"

- note : |
  ## Config. This rule requires the addition of port `9200` and `send_all_headers` to the `HTTP` protocol configuration in `packetbeat.yml`. See the References section for additional configuration documentation."""

- references : ["https://www.elastic.co/guide/en/elasticsearch/reference/current/configuring-security.html",    "https://www.elastic.co/guide/en/beats/packetbeat/current/packetbeat-http-options.html#_send_all_headers"]

- risk_score : 47

- rule_id :  "31295df3-277b-4c56-a1fb-84e31b4222a9"

- severity : "medium"

- tags : ["Elastic", "Network", "Threat Detection", "Initial Access", "Host"]

- type : "query"

name: "Inbound Connection to an Unsecure Elasticsearch Node"

index: auditbeat-*, filebeat-*, packetbeat-*, logs-endpoint.events.*

type: any

kql:
  "query": {"query_string": {"query": "event.category:network_traffic and network.protocol:http and status:OK and destination.port:9200 and network.direction:inbound and not http.response.headers.content-type:\"image/x-icon\" and not _exists_:http.request.headers.authorization"}}

# threat:
#   - 01:
#     - threat_rule: 
#       - framework = "MITRE ATT&CK"
#     - technique:
#       - id = "T1190"
#       - name = "Exploit Public-Facing Application"
#       - reference = "https://attack.mitre.org/techniques/T1190/"
#     - tactic:
#       - id = "TA0001"
#       - name = "Initial Access"
#       - reference = "https://attack.mitre.org/tactics/TA0001/"
 
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
