ANPdata:
- creation_date = "2021/08/07"
- maturity = "production"
- updated_date = "2021/08/07"

ANPrule:
- author = ["Elastic"]

- description = """This rule detects network events that may indicate the use of Windows file sharing (also called SMB or CIFS) traffic to
    the Internet. SMB is commonly used within networks to share files, printers, and other system resources amongst trusted
    systems. It should almost never be directly exposed to the Internet, as it is frequently targeted and exploited by
    threat actors as an initial access or backdoor vector or for data exfiltration."""

- language = "kuery"

- license = "Elastic License v2"

- references = ["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"]

- risk_score = 73

- rule_id =  "c82b2bd8-d701-420c-ba43-f11a155b681a"

- severity = "high"

- tags = ["Elastic", "Host", "Network", "Threat Detection", "Initial Access", "Host"]

- type = "query"

name: "SMB (Windows File Sharing) Activity to the Internet"

index: ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]

type: any

kql:
  "query": {"query_string": {"query": "event.category:(network or network_traffic) and network.transport:tcp and (destination.port:(139 or 445) or event.dataset:zeek.smb) and\n  source.ip:(    10.0.0.0/8 or\n    172.16.0.0/12 or\n    192.168.0.0/16  ) and\n  not destination.ip:(    10.0.0.0/8 or\n    127.0.0.0/8 or\n    169.254.0.0/16 or\n    172.16.0.0/12 or\n    192.0.0.0/24 or\n    192.0.0.0/29 or\n    192.0.0.8/32 or\n    192.0.0.9/32 or\n    192.0.0.10/32 or\n    192.0.0.170/32 or\n    192.0.0.171/32 or\n    192.0.2.0/24 or\n    192.31.196.0/24 or\n    192.52.193.0/24 or\n    192.168.0.0/16 or\n    192.88.99.0/24 or\n    224.0.0.0/4 or\n    100.64.0.0/10 or\n    192.175.48.0/24 or\n    198.18.0.0/15 or\n    198.51.100.0/24 or\n    203.0.113.0/24 or\n    240.0.0.0/4 or\n    \"::1\" or\n    \"FE80::/10\" or\n    \"FF00::/8\"  )"}}

threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1190"
      - name = "Exploit Public-Facing Application"
      - reference = "https://attack.mitre.org/techniques/T1190/"
    - tactic:
      - id = "TA0001"
      - name = "Initial Access"
      - reference = "https://attack.mitre.org/tactics/TA0001/"
  - 02:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique:
      - id = "T1048"
      - name = "Exfiltration Over Alternative Protocol"
      - reference = "https://attack.mitre.org/techniques/T1048/"
    - tactic:
      - id = "TA0010"
      - name = "Exfiltration"
      - reference = "https://attack.mitre.org/tactics/TA0010/"
 
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
