ANPdata:
- creation_date = "2021/7/31"
- maturity = "production"
- updated_date = "2021/7/31"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """A netcat process is engaging in network activity on a Linux host. Netcat is often used as a persistence mechanism by exporting a reverse shell or by serving a shell on a listening port. Netcat is also sometimes used for data exfiltration."""

# - false_positives = ["Netcat is a dual-use tool that can be used for benign or malicious activity. Netcat is included in some Linux distributions so its presence is not necessarily suspicious. Some normal use of this program, while uncommon, may originate from scripts, automation tools, and frameworks."]

- language = "eql"

- license = "Elastic License v2"

- references = ["http://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet","https://www.sans.org/security-resources/sec560/netcat_cheat_sheet_v1.pdf","https://en.wikipedia.org/wiki/Netcat"]

- risk_score = 47

# - max_signals = 33

- rule_id = "adb961e0-cb74-42a0-af9e-29fc41f88f5f"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection"]

- type = "eql"
name: "Netcat Network Activity"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
eql:
  "query": "sequence by process.entity_id\n  [process where (process.name == \"nc\" or process.name == \"ncat\" or process.name == \"netcat\" or\n                  process.name == \"netcat.openbsd\" or process.name == \"netcat.traditional\") and\n     event.type == \"start\"]\n  [network where (process.name == \"nc\" or process.name == \"ncat\" or process.name == \"netcat\" or\n                  process.name == \"netcat.openbsd\" or process.name == \"netcat.traditional\")]"
# threat:
#   - 01:
#     - threat_rule: 
#       - framework = "MITRE ATT&CK"
#     - technique: 
#       - id = "T1021"
#       - name = "Remote Services"
#       - reference = "https://attack.mitre.org/techniques/T1021/"
#       # - subtechnique:
#       #   - id = "T1562.001"
#       #   - name = "Disable or Modify Tools"
#       #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
#     - tactic:
#       - id = "TA0008"
#       - name = "Lateral Movement"
#       - reference = "https://attack.mitre.org/tactics/TA0008/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1078"
  #     - name = "Valid Accounts"
  #     - reference = "https://attack.mitre.org/techniques/T1078/"
  #     # - subtechnique:
  #     #   - id = "T1547.006"
  #     #   - name ="Kernel Modules and Extensions"
  #     #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0003"
  #     - name = "Persistence"
  #     - reference = "https://attack.mitre.org/tactics/TA0003/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
