ANPdata:
- creation_date = "2021/7/31"
- maturity = "production"
- updated_date = "2021/7/31"
# - min_stack_version = "7.12.0"
ANPrule:
- author = ["Elastic"]

- description = """Identifies the creation or modification of a K Desktop Environment (KDE) AutoStart script or desktop file that will execute upon each user logon. Adversaries may abuse this method for persistence."""

# - false_positives = ["Trusted OpenSSH executable updates. It's recommended to verify the integrity of OpenSSH binary changes."]

- language = "eql"

- license = "Elastic License v2"

- references = ["https://userbase.kde.org/System_Settings/Autostart", "https://www.amnesty.org/en/latest/research/2020/09/german-made-finspy-spyware-found-in-egypt-and-mac-and-linux-versions-revealed/", "https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/"]

- risk_score = 47

# - max_signals = 33

- rule_id = "e3e904b3-0a8e-4e68-86a8-977a163e21d3"

- severity = "medium"

- tags = ["Elastic", "Host", "Linux", "Threat Detection", "Persistence"]

- type = "eql"
name: "Persistence via KDE AutoStart Script or Desktop File Modification"
index: ["auditbeat-*", "logs-endpoint.events.*"]
type: any
eql:
  "query": "file where event.type != \"deletion\" and\n  file.extension in (\"sh\", \"desktop\") and\n  file.path :    (      \"/home/*/.config/autostart/*\", \"/root/.config/autostart/*\",      \"/home/*/.kde/Autostart/*\", \"/root/.kde/Autostart/*\",      \"/home/*/.kde4/Autostart/*\", \"/root/.kde4/Autostart/*\",      \"/home/*/.kde/share/autostart/*\", \"/root/.kde/share/autostart/*\",      \"/home/*/.kde4/share/autostart/*\", \"/root/.kde4/share/autostart/*\",      \"/home/*/.local/share/autostart/*\", \"/root/.local/share/autostart/*\",      \"/home/*/.config/autostart-scripts/*\", \"/root/.config/autostart-scripts/*\",      \"/etc/xdg/autostart/*\", \"/usr/share/autostart/*\"    )"
threat:
  - 01:
    - threat_rule: 
      - framework = "MITRE ATT&CK"
    - technique: 
      - id = "T1547"
      - name = "Boot or Logon Autostart Execution"
      - reference = "https://attack.mitre.org/techniques/T1547/"
      # - subtechnique:
      #   - id = "T1562.001"
      #   - name = "Disable or Modify Tools"
      #   - reference = "https://attack.mitre.org/techniques/T1562/001/"
    - tactic:
      - id = "TA0003"
      - name = "Persistence"
      - reference = "https://attack.mitre.org/tactics/TA0003/"
  # - 02: 
  #   - threat_rule:
  #     - framework = "MITRE ATT&CK"
  #   - technique:
  #     - id = "T1556"
  #     - name = "Modify Authentication Process"
  #     - reference = "https://attack.mitre.org/techniques/T1556/"
  #     # - subtechnique:
  #     #   - id = "T1547.006"
  #     #   - name ="Kernel Modules and Extensions"
  #     #   - reference = "https://attack.mitre.org/techniques/T1547/006/"
  #   - tactic:
  #     - id = "TA0006"
  #     - name = "Credential Access"
  #     - reference = "https://attack.mitre.org/tactics/TA0006/"


#filter:
#- term:
#    event.code: 751
    

# eql:
  # "query": " process where process.name == \"services.exe\""
  
# kql:
#   "query": {"query_string": {"query": "event.code : 967" }  }
  
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"
